[
  {
    "NNQT_question": "Give me {social} that {Mérimée ID} {Inventory of intangible cultural heritage in France} and which contains the word {day} in their name",
    "uid": 31926,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2114,
    "question": "What is the social with a Mérimée ID of Inventory of intangible cultural heritage in France and containing the word 'day' in its name?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q345367 . ?sbj wdt:P380 wd:Q21011287 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'day')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Name a not asocial with Inventory of intangible cultural heritage in France as Mérimée ID and having a name that contains 'day' word.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q345367 . ?sbj wdt:P3259 wd:Q21011287 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'day')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {postal code} for {Baidu} has {headquarters location} as {Beijing} ?",
    "uid": 6527,
    "subgraph": "statement_property",
    "template_index": 2972,
    "question": "Get  the postal code for Baidu that is headquartered at Beijing?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q14772 p:P159 ?s . ?s ps:P159 wd:Q956 . ?s pq:P281 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q14772> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P159> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q956> .\n?statement <http://www.wikidata.org/entity/P281> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Headquartered at Beijing, what is the postal code of Baidu?",
    "answers": [
      "100080"
    ]
  },
  {
    "NNQT_question": "What is {headquarters location} of {educated at} of {Macrinus} ?",
    "uid": 30614,
    "subgraph": "right-subgraph",
    "template_index": 5993,
    "question": "What is the admin HQ of Alma Matter and Macrinus?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1752 wdt:P69 ?X . ?X wdt:P159 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the admin HQ of Alma Matter and Macrinus?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q535 wdt:P69 ?X . ?X wdt:P159 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Fantastic Fiction author ID} of {Ambrose Burnside}",
    "uid": 30849,
    "subgraph": "center",
    "template_index": 988,
    "question": "What is Fantastic Fiction author ID of Ambrose Burnside?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q355444 wdt:P5408 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q318487 wdt:P5408 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {writer} of {Julius Caesar}, that has {sister} is {Joan Shakespeare} ?",
    "uid": 13367,
    "subgraph": "right-subgraph",
    "template_index": 181,
    "question": "who is the writer of Julius Caesar who has a sister named Joan Shakespeare?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q215750 wdt:P50 ?answer . ?answer wdt:P3373 wd:Q6205446}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q215750> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P50>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3373> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q6205446> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "who is the author of Julius Caesar who includes a sister named Joan Shakespeare?",
    "answers": [
      "William Shakespeare"
    ]
  },
  {
    "NNQT_question": "How many {appointed by} are to/by {prime minister} ?",
    "uid": 31758,
    "subgraph": "statement_property",
    "template_index": 1329,
    "question": "How many people are appointed by the prime minister?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P748 wd:Q14212 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "The prime minister appoints how many people?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P748 wd:Q19546 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {influenced by} are to/by {Gustave Courbet} ?",
    "uid": 2346,
    "subgraph": "statement_property",
    "template_index": 1690,
    "question": "How many are influenced by Gustave Courbet?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P737 wd:Q34618 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P737> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q34618 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "How many people are there that are influenced by Gustave Courbet?",
    "answers": [
      "6"
    ]
  },
  {
    "NNQT_question": "Give me {minor planet} that starts with {'r'}",
    "uid": 31192,
    "subgraph": "string matching simple contains word",
    "template_index": 3030,
    "question": "What are the minor planet  which start with the letter r",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1022867 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the minor planets that begin with alphabet R.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28951811 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {genetic association} of {major depressive disorder} that is {determination method} is {TAS} ?",
    "uid": 8447,
    "subgraph": "statement_property",
    "template_index": 4892,
    "question": "What is the genetic association of major depressive disorder with the determination method TAS?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q42844 p:P2293 ?s . ?s ps:P2293 ?obj . ?s pq:P459 wd:Q23190853 }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q42844> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2293> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P459> <http://wikidata.dbpedia.org/resource/Q23190853>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "With the determination method TAS, for what major depressive disorder is this associated?",
    "answers": [
      "CCBE1",
      "ANK3",
      "ESRRG",
      "PCLO",
      "ITGA11",
      "KCNH5",
      "CACNA1C",
      "MYO10",
      "FAT4",
      "SP4",
      "ENOX1",
      "TRPS1",
      "GRM7",
      "SYNE1",
      "SHC4"
    ]
  },
  {
    "NNQT_question": "What is the {taxon} for {incarnation of} of {cholera}",
    "uid": 30249,
    "subgraph": "simple question left",
    "template_index": 456,
    "question": "Cholera incarnates which taxon?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P3701 wd:Q12090 . ?sbj wdt:P31 wd:Q16521 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which taxon does Cholera incarnate?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1542 wd:Q12090 . ?sbj wdt:P31 wd:Q16521 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {participant} of {conflict} of {Xanthippus} ?",
    "uid": 30700,
    "subgraph": "left-subgraph",
    "template_index": 39,
    "question": "Who were the victims due to Xanthippus's actions?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q380401 wdt:P607 ?X . ?X wdt:P710 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who were the casualties due to Xanthippus's actions?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q218102 wdt:P607 ?X . ?X wdt:P710 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {ice hockey team} that {number of losses} {National Hockey League} and which contains the word {ottawa} in their name",
    "uid": 31924,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2281,
    "question": "What hockey team with NHL number of losses contains Ottawa in their name?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4498974 . ?sbj wdt:P1356 wd:Q1215892 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ottawa')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What hockey group with NHL number of losses contains Ottawa in their name?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4498974 . ?sbj wdt:P118 wd:Q1215892 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ottawa')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {mother} of {John Huston}",
    "uid": 30335,
    "subgraph": "simple question left",
    "template_index": 1004,
    "question": "Who is John Huston's mother?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P25 wd:Q51575 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which person has John Huston as son?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P3448 wd:Q51575 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {cast member} of {present in work} of {impressionist} ?",
    "uid": 30521,
    "subgraph": "left-subgraph",
    "template_index": 83,
    "question": "Who stars with impressionist in the production?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1148872 wdt:P1441 ?X . ?X wdt:P161 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who stars with impressionist within the generation?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q42421333 wdt:P1441 ?X . ?X wdt:P161 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {owned by} and the {named as} of {Disneyland} ?",
    "uid": 31969,
    "subgraph": "two intentions right subgraph",
    "template_index": 576,
    "question": "Who owns Disneyland and what is its alternative name?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q181185 wdt:P127 ?ans_1 . wd:Q181185 wdt:P1810 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What is Disneyland other name and who is the current owner?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q181185 wdt:P127 ?ans_1 . wd:Q181185 wdt:P138 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {depositor} are to/by {figure skating} ?",
    "uid": 31722,
    "subgraph": "statement_property",
    "template_index": 1026,
    "question": "How many depositors are with the {figure skating} ?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2058 wd:Q38108 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Who are the depositors with the figure skating?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2058 wd:Q81066 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {interface standard} that contains the word {virtuallink} in their name",
    "uid": 23773,
    "subgraph": "string matching simple contains word",
    "template_index": 1669,
    "question": "Tell me interface standard whose name has the word virtuallink in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6046311 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'virtuallink')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q6046311>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'virtuallink')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me the standard interface whose name contains the word virtual link.",
    "answers": [
      "VirtualLink"
    ]
  },
  {
    "NNQT_question": "Give me {gas giant} that {child astronomical body} {Enceladus} and which that starts with {'s'}",
    "uid": 25377,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1162,
    "question": "What what is gas giant child astronomical body by Enceladus and also which starts with letter s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q121750 . ?sbj wdt:P398 wd:Q3303 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q121750>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P398> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3303>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "What what is gas giant infant astronomical body by using Enceladus and additionally which starts with letter s",
    "answers": [
      "Saturn"
    ]
  },
  {
    "NNQT_question": "How many {member of the crew of} are to/by {Straight Flush} ?",
    "uid": 31745,
    "subgraph": "statement_property",
    "template_index": 1046,
    "question": "how many crew members does Straight Flush have?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P5096 wd:Q7621009 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "How many crew members work for Straight Flush?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P5096 wd:Q204424 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {sovereign state} for {replaces} of {Second Hellenic Republic}",
    "uid": 30279,
    "subgraph": "simple question left",
    "template_index": 3195,
    "question": "What is the sovereign state that replaced the Second Hellenic Republic?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1365 wd:Q265824 . ?sbj wdt:P31 wd:Q3624078 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the sovereign state that replaced the Second Hellenic Republic",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1365 wd:Q12560 . ?sbj wdt:P31 wd:Q3624078 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {homoglyph} for {toxaphene} has {density} as {1.65} ?",
    "uid": 31519,
    "subgraph": "statement_property",
    "template_index": 1386,
    "question": "What is the homoglyph of toxaphene that has a density of 1.65?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q417157 p:P2054 ?s . ?s ps:P2054 ?x filter(contains(?x,'1.65')) . ?s pq:P2444 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What is the homoglyph of toxaphene at a density of 1.65?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q417157 p:P2054 ?s . ?s ps:P2054 ?x filter(contains(?x,'1.65')) . ?s pq:P2076 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {gravitational lens} with the {MIN(flux)} whose {constellation} is {Virgo} ?",
    "uid": 31128,
    "subgraph": "rank",
    "template_index": 703,
    "question": "What is the gravitational lens with the lowest flux whose constellation is Virgo ?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q185243 . ?ent wdt:P2221 ?obj . ?ent wdt:P59 wd:Q8842} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "What is the gravitational lens with the least flux whose star grouping is Virgo ?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q204107 . ?ent wdt:P2221 ?obj . ?ent wdt:P59 wd:Q8842} ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {spice} for {endemic to} of {Cuminum cyminum}",
    "uid": 31845,
    "subgraph": "simple question right",
    "template_index": 3161,
    "question": "Cuminum cyminum is endemic to what type of spice?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q132624 wdt:P183 ?obj . ?obj wdt:P31 wd:Q42527 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Cuminum cyminum is endemic to a sort of spice, what is it?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q132624 wdt:P1672 ?obj . ?obj wdt:P31 wd:Q42527 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {child} of {Leopold II, Holy Roman Emperor}, that has {sibling} is {Fabrizio Donato} ?",
    "uid": 30418,
    "subgraph": "right-subgraph",
    "template_index": 4719,
    "question": "What is the daughter of Leopold II, Holy Roman Emperor, whose sister is Fabrizio Donato?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q151321 wdt:P40 ?answer . ?answer wdt:P3373 wd:Q1753}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the girl of Leopold II, Heavenly Roman Sovereign, whose sister is Fabrizio Donato?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q151321 wdt:P40 ?answer . ?answer wdt:P3373 wd:Q1032317}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {residence} of {Frank Zamboni}, that has {contains administrative territorial entity} is {Carbon County} ?",
    "uid": 30471,
    "subgraph": "right-subgraph",
    "template_index": 626,
    "question": "In which city in Carbon County Frank Zamboni had residence?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1287174 wdt:P551 ?answer . ?answer wdt:P150 wd:Q156467}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which city in Carbon County was Frank Zamboni's residence?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1287174 wdt:P19 ?answer . ?answer wdt:P150 wd:Q156467}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Anselm of Canterbury} that starts with {'t'}",
    "uid": 31147,
    "subgraph": "string matching simple contains word",
    "template_index": 1536,
    "question": "Which Anselm of Canterbury starts with the letter t",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43939 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which Anselm of Canterbury begins with the letter t",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23847174 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {number of branches} are for {Steffi Graf} ?",
    "uid": 31699,
    "subgraph": "statement_property",
    "template_index": 245,
    "question": "How many branches does Steffi Graf have?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q11662 wdt:P8368 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Steffi Graf has how many branches?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q11662 wdt:P1344 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Green Peafowl} that starts with {'p'}",
    "uid": 31223,
    "subgraph": "string matching simple contains word",
    "template_index": 2256,
    "question": "Tell me a Green Peafowl that starts with {'p'}",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q254636 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Let me know a Green Peafowl that begins with {'p'}",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3917160 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {record held} and the {named after} of {Marathon} ?",
    "uid": 10143,
    "subgraph": "two intentions right subgraph",
    "template_index": 431,
    "question": "After what is Marathon named and what is the current record?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q40244 wdt:P1000 ?ans_1 . wd:Q40244 wdt:P138 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q40244> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1000> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q40244> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P138> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "why Marathon had this name and the current record is?",
    "answers": [
      "Battle of Marathon",
      "Eliud Kipchoge",
      "Battle of Marathon",
      "Dennis Kipruto Kimetto"
    ]
  },
  {
    "NNQT_question": "What is the {stage race} with the {MAX(frequency of event)} ?",
    "uid": 2443,
    "subgraph": "rank",
    "template_index": 19,
    "question": "WHICH IS THE STAGE RACE WITH THE MAXIMUM FREQUENCY OF EVENT",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q1318941 . ?ent wdt:P2257 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q1318941>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2257>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .}\nORDER BY DESC(?obj)\nLIMIT 5",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "WHAT IS THE MAXIMUM FREQUENCY OF EVENT RACE",
    "answers": [
      "Vuelta Ciclista a Chiloé",
      "UAE Tour",
      "Itzulia Basque Women",
      "The 60th Anniversary \"Thai Cycling Association\"",
      "Vuelta a Burgos Féminas"
    ]
  },
  {
    "NNQT_question": "How many {signed form} are for {Acuña} ?",
    "uid": 31685,
    "subgraph": "statement_property",
    "template_index": 607,
    "question": "How many {signed form} are there for {Monterrey} ?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q81033 wdt:P3969 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What is the number of signed forms of Monterrey?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q81033 wdt:P190 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {creator} and the {executive producer} of {The_X-Files} ?",
    "uid": 9611,
    "subgraph": "two intentions right subgraph",
    "template_index": 578,
    "question": "Who is The X-Files' creator and executive producer?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q2744 wdt:P170 ?ans_1 . wd:Q2744 wdt:P1431 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2744> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P170> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2744> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1431> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Who is the creator and executive producer of The X-Files?",
    "answers": [
      "Chris Carter",
      "Vince Gilligan",
      "Chris Carter",
      "Michelle MacLaren",
      "Chris Carter",
      "Chris Carter",
      "Chris Carter",
      "Kim Manners",
      "Chris Carter",
      "James Wong",
      "Chris Carter",
      "Glen Morgan",
      "Chris Carter",
      "Howard Gordon",
      "Chris Carter",
      "David Greenwalt",
      "Chris Carter",
      "John Shiban"
    ]
  },
  {
    "NNQT_question": "What is {award received} of {discoverer or inventor} of {Universal Media Disc} ?",
    "uid": 30683,
    "subgraph": "right-subgraph",
    "template_index": 202,
    "question": "What honors have coined the Universal Media Disc?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q270309 wdt:P61 ?X . ?X wdt:P166 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What respects have coined the Universal Media Disc?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q34467 wdt:P61 ?X . ?X wdt:P166 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]