[
  {
    "NNQT_question": "What is {owned by} of {Lion de la Feuillée}, that has {member of} is {G20} ?",
    "uid": 30401,
    "subgraph": "right-subgraph",
    "template_index": 5339,
    "question": "whos is owner of the Lion de la Feuillée that have members of is G20",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q11228 wdt:P127 ?answer . ?answer wdt:P463 wd:Q19771}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "whos is proprietor of the Lion de la Feuillée that have individuals of is G20",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q2418237 wdt:P127 ?answer . ?answer wdt:P463 wd:Q19771}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {item operated} of {P1Y Ginga}",
    "uid": 30792,
    "subgraph": "center",
    "template_index": 2923,
    "question": "What is the item operated of P1Y Ginga?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P121 wd:Q391456}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P121 wd:Q184870}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {end time} for {Anders Behring Breivik} has {member of} as {ERROR1} ?",
    "uid": 9124,
    "subgraph": "statement_property",
    "template_index": 5569,
    "question": null,
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q44220 p:P463 ?s . ?s ps:P463 wd:Q2319455 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q44220> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P463> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2319455> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": [],
    "answers": [
      "2011-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {prosecutor} of {Park Geun-hye}",
    "uid": 30889,
    "subgraph": "center",
    "template_index": 952,
    "question": "What is the prosecutor of Park Geun-hye ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q138048 wdt:P1592 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q138048 wdt:P4226 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {organism form} with the {MIN(height)} whose {instance of} is {Tilia platyphyllos} ?",
    "uid": 31115,
    "subgraph": "rank",
    "template_index": 550,
    "question": "What is the organism form with the lowest height whose instance of is Tilia platyphyllos?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q55597235 . ?ent wdt:P2048 ?obj . ?ent wdt:P31 wd:Q156831} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Which organism form has the lowest height in the instance of Tilia platyphyllos?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q2438638 . ?ent wdt:P2048 ?obj . ?ent wdt:P31 wd:Q156831} ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {has regions} of {Lower Saxony}, that has {on the coast of} is {Maade} ?",
    "uid": 12574,
    "subgraph": "right-subgraph",
    "template_index": 8364,
    "question": "What are the regions available on the coast of Lower Saxony?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1197 wdt:P150 ?answer . ?answer wdt:P206 wd:Q1882240}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1197> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P150>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P206> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1882240> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the locales accessible on the coast of Lower Saxony?",
    "answers": [
      "Wilhelmshaven"
    ]
  },
  {
    "NNQT_question": "What is {on bay} of {Tsushima Island}, that has {tributary} is {Iwaki River} ?",
    "uid": 12381,
    "subgraph": "right-subgraph",
    "template_index": 72,
    "question": "What is on the Bay of Tsushima Island, that is a tributary of Iwaki River",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q52051 wdt:P206 ?answer . ?answer wdt:P974 wd:Q5359180}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q52051> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P206>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P974> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q5359180> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is on the Bay of Tsushima Island, that is a tributary of Iwaki River",
    "answers": [
      "Sea of Japan"
    ]
  },
  {
    "NNQT_question": "Give me {firelighting} that contains the word {tinder} in their name",
    "uid": 31227,
    "subgraph": "string matching simple contains word",
    "template_index": 1511,
    "question": "TELL ME FIRELIGHTING WHOSE NAME HAS THE WORD TINDER IN IT",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1192478 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tinder')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let Me know Firelighting WHOSE Title HAS THE WORD TINDER IN IT",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1724915 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tinder')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {AlloCiné series ID} of {More Than Life at Stake}",
    "uid": 30910,
    "subgraph": "center",
    "template_index": 1395,
    "question": "What is More Than Life at Stake' AlloCine series ID?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q961 wdt:P1267 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q212731 wdt:P1267 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {student} of {student of} of {Mentuhotep II} ?",
    "uid": 30505,
    "subgraph": "left-subgraph",
    "template_index": 8,
    "question": "Who was the teacher that supervised Mentuhotep II?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q296439 wdt:P1066 ?X . ?X wdt:P802 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who was the instructor that administered Mentuhotep II?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q6533159 wdt:P1066 ?X . ?X wdt:P802 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {thoracic disease} that starts with {'s'}",
    "uid": 24567,
    "subgraph": "string matching simple contains word",
    "template_index": 661,
    "question": "What are the thoracic disease which start with the letter s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18553676 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q18553676>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the thoracic disease that begins with the letter s",
    "answers": [
      "second-degree atrioventricular block",
      "short QT syndrome",
      "sinoatrial node disease",
      "subendocardial infarction acute myocardial infarction",
      "scapuloperoneal myopathy",
      "solitary cyst of breast",
      "septic myocarditis",
      "slate pneumoconiosis"
    ]
  },
  {
    "NNQT_question": "What is {has rural cities} of {Pará}, that has {inhabitants} is {13155} ?",
    "uid": 12599,
    "subgraph": "right-subgraph",
    "template_index": 9600,
    "question": "Do the rural cities of Para have 13155 inhabitants?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q39517 wdt:P150 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'13155'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q39517> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P150>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <13155> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Do the country cities of Para have 13155 inhabitants?",
    "answers": [
      "São João do Araguaia"
    ]
  },
  {
    "NNQT_question": "What is {ethnic group} of {Mitchell Watt}, that has {history of topic} is {history of the Arabs} ?",
    "uid": 30410,
    "subgraph": "right-subgraph",
    "template_index": 689,
    "question": "What is the ethnic group of Mitchell Watt, that is also the topic of the history of Arabs?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1747 wdt:P172 ?answer . ?answer wdt:P2184 wd:Q48999793}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the ethnich group topic of Arabic history, to which Mitchell Watt belongs?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1943555 wdt:P172 ?answer . ?answer wdt:P2184 wd:Q48999793}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {is shown in} of {based upon} of {Clark Kent} ?",
    "uid": 16535,
    "subgraph": "left-subgraph",
    "template_index": 9,
    "question": "Who gave the {is shown in} of {based upon} of {Clark Kent} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q774772 wdt:P144 ?X . ?X wdt:P1441 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q774772> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P144>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1441> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who gave the {is appeared in} of {based upon} of {Clark Kent} ?",
    "answers": [
      "DC Universe Online",
      "Superman",
      "Lego Batman 2: DC Super Heroes",
      "The Batman Superman Movie: World's Finest",
      "Smallville",
      "Superman",
      "Justice League",
      "Superman II",
      "Superman Returns",
      "Action Comics",
      "Batman: The Brave and the Bold",
      "Superboy",
      "Superman",
      "Superman III",
      "Injustice: Gods Among Us",
      "Man of Steel",
      "Mortal Kombat vs. DC Universe",
      "The Batman",
      "Superman Returns",
      "Young Justice",
      "The Dark Knight Returns",
      "Lois & Clark: The New Adventures of Superman",
      "Superman and the Mole Men",
      "Superman IV: The Quest for Peace",
      "Superman: The Animated Series",
      "Superman II: The Richard Donner Cut",
      "The New Adventures of Superman",
      "Batman Beyond",
      "Static Shock",
      "Krypto the Superdog",
      "The Adventures of Superman",
      "Superman",
      "Superman: Shadow of Apokolips",
      "Superman/Batman: Public Enemies",
      "Justice League Heroes",
      "Adventures of Superman",
      "Superman",
      "Superman: Doomsday",
      "The Death and Return of Superman",
      "Superman",
      "Legion of Super Heroes",
      "The Lego Movie",
      "Superman: The Man of Steel",
      "Justice League: Crisis on Two Earths",
      "Superman: Brainiac Attacks",
      "Super Friends",
      "Batman: The Dark Knight Returns",
      "Justice League: The New Frontier",
      "Superman/Batman: Apocalypse",
      "Justice League: Doom"
    ]
  },
  {
    "NNQT_question": "What is the {end time} for {Cicely Tyson} has {award received} as {Candace Award} ?",
    "uid": 31653,
    "subgraph": "statement_property",
    "template_index": 4870,
    "question": "Until when was Cicely Tyson granted the Candace Award?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q238081 p:P166 ?s . ?s ps:P166 wd:Q27851929 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Give me the end date that Cicely Tyson was granted the Candace Award.",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q238081 p:P166 ?s . ?s ps:P166 wd:Q27851929 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {occupation} of {Toyota}, that has {field of this occupation} is {screenwriting} ?",
    "uid": 30353,
    "subgraph": "right-subgraph",
    "template_index": 1422,
    "question": "What kind of career does Toyota, Aichi have in the screenwriting field?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q201117 wdt:P106 ?answer . ?answer wdt:P425 wd:Q3429919}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What kind of career in the screenwriting field does Toyota, Aichi have?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q553072 wdt:P106 ?answer . ?answer wdt:P425 wd:Q3429919}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {collection or exhibition size} of {Goya Museum} that is {point in time} is {2012-01-01} ?",
    "uid": 31427,
    "subgraph": "statement_property",
    "template_index": 486,
    "question": "What was the total size of exhibition of Goya Museum in the year 2012?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q246821 p:P1436 ?s . ?s ps:P1436 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2012')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which is the total size of the exhibition of Goya Museum in 2012?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q160112 p:P1436 ?s . ?s ps:P1436 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2012')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {medium} of {maker of} of {textile arts} ?",
    "uid": 16279,
    "subgraph": "right-subgraph",
    "template_index": 6,
    "question": "What is the medium used by textile artists?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q10988986 wdt:P1056 ?X . ?X wdt:P186 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q10988986> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1056>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P186> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Textile artists use what medium?",
    "answers": [
      "textile"
    ]
  },
  {
    "NNQT_question": "What is {NLP ID (unique)} of {Juan Antonio Rios}",
    "uid": 30915,
    "subgraph": "center",
    "template_index": 1312,
    "question": "Which is the NLP ID for Juan Antonio Rios?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q820 wdt:P1695 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q179785 wdt:P1695 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {follows} and {followed by} of {Matteo Ricci} has {noble title} as {king of Franks}",
    "uid": 32050,
    "subgraph": [],
    "template_index": 260,
    "question": "Mention the predecessor and the successor of Matteo Ricci while being recognized as king of Franks",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q233340 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who were the kings of the Franks before and after Matteo Ricci?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q43974 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {employer} of {Nora Ephron} and {object has role}",
    "uid": 32038,
    "subgraph": [],
    "template_index": 75,
    "question": "Tell me about employer of Nora Ephron and the objects for which she represents their role?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q214677 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P3831 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Who hired Nora Ephron and what are the objects for which she represents their role?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q214677 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P106 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {population} of {filming location} of {Who's Harry Crumb?} ?",
    "uid": 30708,
    "subgraph": "right-subgraph",
    "template_index": 5611,
    "question": "What are the inhabitants of the studio where Who's Harry Crumb? was filmed?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q186445 wdt:P915 ?X . ?X wdt:P1082 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the occupants of the studio where Who's Harry Crumb? was filmed?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q221103 wdt:P915 ?X . ?X wdt:P1082 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of sports team} of {Alex Ferguson} that is {UTC date of spacecraft launch} is {1973-01-01} ?",
    "uid": 31371,
    "subgraph": "statement_property",
    "template_index": 1867,
    "question": "Is Alex Ferguson is the member of sports team which UTC date of spacecraft launch was 1-1-1973?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q44980 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P619 ?x filter(contains(YEAR(?x),'1973')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Is it correct that Alex Ferguson is the member of sports team which UTC date of spacecraft launch was 1-1-1973?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q44980 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1973')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {scalar quantity} that contains the word {flux} in their name",
    "uid": 31233,
    "subgraph": "string matching simple contains word",
    "template_index": 3684,
    "question": "Tell me scalar quantity whose name has the word scalar quantity in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q181175 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'flux')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know scalar quantity whose title has the word scalar quantity in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6485344 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'flux')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {use} that contains the word {tinder} in their name",
    "uid": 23366,
    "subgraph": "string matching simple contains word",
    "template_index": 1511,
    "question": "TELL ME USE WHOSE NAME HAS THE WORD TINDER IN IT",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1724915 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tinder')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1724915>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tinder')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let Me know Utilize WHOSE Title HAS THE WORD TINDER IN IT",
    "answers": [
      "tinder"
    ]
  },
  {
    "NNQT_question": "What is {continent} of {mountain belt} of {Mount Caywood} ?",
    "uid": 16264,
    "subgraph": "left-subgraph",
    "template_index": 16090,
    "question": "Where is the name of the continent of the mountain belt in Mount Caywood?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q6920087 wdt:P4552 ?X . ?X wdt:P30 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q6920087> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P4552>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P30> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "In the continent of the mountain belt in Mount Caywood, what is the name?",
    "answers": [
      "Antarctica"
    ]
  },
  {
    "NNQT_question": "Give me {Olympic sport} that contains the word {weightlifting} in their name",
    "uid": 23259,
    "subgraph": "string matching simple contains word",
    "template_index": 517,
    "question": "What are theOlympic sport which start with the letter weightlifting",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q212434 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'weightlifting')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q212434>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'weightlifting')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are theOlympic game which start with the letter weightlifting",
    "answers": [
      "weightlifting"
    ]
  },
  {
    "NNQT_question": "Give me {Bantu languages} that contains the word {zulu} in their name",
    "uid": 23480,
    "subgraph": "string matching simple contains word",
    "template_index": 1693,
    "question": "What are the Bantu languages which start with the letter zulu",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33146 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zulu')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q33146>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zulu')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the Bantu languages which start with the letter zulu",
    "answers": [
      "Zulu"
    ]
  },
  {
    "NNQT_question": "What is {spouse} of {Douglas Adams} that is {end time} is {1967-01-01} ?",
    "uid": 31352,
    "subgraph": "statement_property",
    "template_index": 2085,
    "question": "Is the end time for the spouse of Douglas Adams 1967-0-0?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q42 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1967')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Does 1967-0-0 Is the death date of Douglas Adams wife?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q213430 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1967')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]