[
  {
    "NNQT_question": "What is the {member of sports team} and the {supported sports team} of {Thierry Henry} ?",
    "uid": 31983,
    "subgraph": "two intentions right subgraph",
    "template_index": 328,
    "question": "What position and supported sports team does Thierry Henry play on?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q45901 wdt:P54 ?ans_1 . wd:Q45901 wdt:P6758 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Thierry Henry plays on what supported sports team and in which position?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q45901 wdt:P54 ?ans_1 . wd:Q45901 wdt:P413 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {shares border with} of {place of death} of {Rex Wailes} ?",
    "uid": 30692,
    "subgraph": "right-subgraph",
    "template_index": 798,
    "question": "What is bordered by death of Rex Wailes",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7319336 wdt:P20 ?X . ?X wdt:P47 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is bordered by passing of Rex Wailes",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q309882 wdt:P20 ?X . ?X wdt:P47 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {field of this craft} of {craft} of {Fernand Maillaud} ?",
    "uid": 14836,
    "subgraph": "left-subgraph",
    "template_index": 266,
    "question": "What field does Fernand Maillaud work in?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3069252 wdt:P106 ?X . ?X wdt:P425 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q3069252> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P425> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What field does Fernand Maillaud work in?",
    "answers": [
      "Cabinetry",
      "illustration",
      "art of painting",
      "pro player de fifa",
      "tapestry weaving"
    ]
  },
  {
    "NNQT_question": "What is {Norwegian filmography ID} of {The Wages of Fear}",
    "uid": 30955,
    "subgraph": "center",
    "template_index": 2985,
    "question": "What is the Norwegian filmography ID for The Wages of Fear?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q465773 wdt:P1439 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q465773 wdt:P3961 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {death location} of {Samuel Butler}, that has {partner city} is {Jakarta} ?",
    "uid": 11804,
    "subgraph": "right-subgraph",
    "template_index": 1682,
    "question": "What is the death location, whose partner city is Jakarta, of Samuel Butler?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q258766 wdt:P20 ?answer . ?answer wdt:P190 wd:Q3630}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q258766> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3630> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the demise location, whose partner metropolis is Jakarta, of Samuel Butler?",
    "answers": [
      "London"
    ]
  },
  {
    "NNQT_question": "Give me {film} that {filming location} {New York City} and which that starts with {'s'}",
    "uid": 25311,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1454,
    "question": "Name a film shot in New York that starts with letter S",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11424 . ?sbj wdt:P915 wd:Q60 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q11424>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P915> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q60>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "Title a film shot in Modern York that begins with letter S",
    "answers": [
      "Serpico",
      "Scarface",
      "Street Smart",
      "Synecdoche, New York",
      "Silence Like Glass",
      "Sabrina",
      "Shadows and Fog",
      "Sex and the City 2",
      "Super Size Me",
      "Shame",
      "Spider-Man",
      "Saturday Night Fever",
      "Shortbus",
      "Strangers on a Train",
      "Streets of Gold",
      "Shaft",
      "Safe",
      "Superman II",
      "Stepmom",
      "Superman Returns",
      "Sea of Love",
      "Step Up 3D",
      "Street Scene",
      "Sivaji",
      "See You in the Morning"
    ]
  },
  {
    "NNQT_question": "How many {mother} are for {Eros} ?",
    "uid": 1480,
    "subgraph": "statement_property",
    "template_index": 480,
    "question": "How many mothers did Eros have?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q121973 wdt:P25 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q121973> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P25> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Which is the number of mothers that Eros had?",
    "answers": [
      "5"
    ]
  },
  {
    "NNQT_question": "What is {nominated for} of {Kiefer Sutherland} that is {point in time} is {2002-0-0} ?",
    "uid": 4696,
    "subgraph": "statement_property",
    "template_index": 1141,
    "question": "Which award was Kiefer Sutherland nominated for in 2002?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q103946 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2002')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q103946> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2002-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What award, in 2002, was Kiefer Sutherland nominated for?",
    "answers": [
      "Satellite Award for Best Actor – Television Series Drama",
      "Primetime Emmy Award for Outstanding Lead Actor in a Drama Series",
      "TCA Award for Individual Achievement in Drama"
    ]
  },
  {
    "NNQT_question": "What is {signature} of {Cindy Crawford}",
    "uid": 31043,
    "subgraph": "center",
    "template_index": 230,
    "question": "Which is the signature of Cindy Crawford?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q199801 wdt:P109 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q199801 wdt:P3379 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {capital} of {Higashiōmi}",
    "uid": 30807,
    "subgraph": "center",
    "template_index": 3043,
    "question": "What's the capital of Higashiōmi?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P36 wd:Q240891}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P36 wd:Q202907}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Behind The Voice Actors person ID} of {Juan Antonio Rios}",
    "uid": 30991,
    "subgraph": "center",
    "template_index": 4001,
    "question": "Which is the Behind The Voice Actors person ID for Juan Antonio Rios?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q820 wdt:P5007 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q40523 wdt:P5007 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {twinned administrative body} of {residence} of {Franklin Graham} ?",
    "uid": 30531,
    "subgraph": "right-subgraph",
    "template_index": 8067,
    "question": "What is the sister city of Franklin Graham's hometown?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1445246 wdt:P551 ?X . ?X wdt:P190 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the sister city of Franklin Graham's hometown?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q42831 wdt:P551 ?X . ?X wdt:P190 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {San Gregorio nelle Alpi} has {located in the administrative territorial entity} as {Bombay Presidency} ?",
    "uid": 31546,
    "subgraph": "statement_property",
    "template_index": 3324,
    "question": "When did San Gregorio nelle Alpi become Presidency of Bombay which was located in the administrative territorial entity?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q40408 p:P131 ?s . ?s ps:P131 wd:Q891827 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "In what year did San Gregorio nelle Alpi become the capital of Bombay?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q1070 p:P131 ?s . ?s ps:P131 wd:Q891827 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {goddess} for {Wikidata property example for senses} of {Artemis}",
    "uid": 30256,
    "subgraph": "simple question left",
    "template_index": 3610,
    "question": "What Wikidata property example for senses is the goddess Artemis?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P5977 wd:Q39503 . ?sbj wdt:P31 wd:Q205985 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who Wikidata property example for senses is the goddess Artemis?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P460 wd:Q39503 . ?sbj wdt:P31 wd:Q205985 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {polytheism} for {name day} of {Etruschi}",
    "uid": 31853,
    "subgraph": "simple question right",
    "template_index": 2273,
    "question": "Which polytheistic name day did the Etruschi follow?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q17161 wdt:P1750 ?obj . ?obj wdt:P31 wd:Q9163 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which polytheistic name day did the Etruschi follow?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q17161 wdt:P140 ?obj . ?obj wdt:P31 wd:Q9163 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Arnulfo Arias} that contains the word {virtuallink} in their name",
    "uid": 31153,
    "subgraph": "string matching simple contains word",
    "template_index": 1669,
    "question": "Tell me Arnulfo Arias whose name has the word virtuallink in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q603836 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'virtuallink')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me the Arnulfo Arias whose name contains the word virtual link.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6046311 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'virtuallink')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {religious concept} that starts with {'t'}",
    "uid": 24037,
    "subgraph": "string matching simple contains word",
    "template_index": 1536,
    "question": "Which religious concept starts with the letter t",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23847174 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q23847174>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which devout concept begins with the letter t",
    "answers": [
      "Trika",
      "title of Virgin Mary",
      "Thirteen Buddhas",
      "Three Turnings of the Wheel of Dharma",
      "Two truths doctrine",
      "triple deity",
      "tsumi",
      "Trishula",
      "theologoumenon",
      "Tirtha and Kshetra",
      "Tatastha",
      "Tantra in Buddhism",
      "Tamas",
      "Tapas",
      "The All",
      "Theosis",
      "The Lord's Recovery",
      "Tohu and Tikun",
      "Tianlong babu",
      "Transitus",
      "trilingual heresy",
      "tent",
      "Thousand-armed Avalokiteśvara",
      "Tantra",
      "translation"
    ]
  },
  {
    "NNQT_question": "What is {award received} of {One Piece} that is {point in time} is {2009-0-0} ?",
    "uid": 6387,
    "subgraph": "statement_property",
    "template_index": 2832,
    "question": "Which award did One Piece receive in 2009?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q673 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2009')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q673> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2009-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "One Pierce received what award in 2009",
    "answers": [
      "Sondermann Award"
    ]
  },
  {
    "NNQT_question": "What is the {hill} with the {MAX(topographic isolation)} whose {instance of} is {mountain range}  ?",
    "uid": 3141,
    "subgraph": "rank",
    "template_index": 340,
    "question": "Give the name of the hill with the highest isolation whose is at a high range.",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q54050 . ?ent wdt:P2659 ?obj . ?ent wdt:P31 wd:Q46831 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q54050>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2659>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q46831> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Which highly isolated hill is at a high range?",
    "answers": [
      "Arjuno-Welirang"
    ]
  },
  {
    "NNQT_question": "What is the {organizer} and the {sex or gender} of {Super Bowl} ?",
    "uid": 31971,
    "subgraph": "two intentions right subgraph",
    "template_index": 501,
    "question": "What is the organizer and the sex or gender of Super Bowl ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q32096 wdt:P664 ?ans_1 . wd:Q32096 wdt:P21 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "The Super Bowl is part of which organization and has what sex or gender?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q32096 wdt:P664 ?ans_1 . wd:Q32096 wdt:P641 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {International Nuclear Event Scale} {guide book} that contains the word {ארץ} in their name",
    "uid": 31174,
    "subgraph": "string matching simple contains word",
    "template_index": 859,
    "question": "Tell me element with an International Nuclear Event Scale of guide book whose name has the word ארץ in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P2127 wd:Q223638 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ארץ')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me an object with an International Nuclear Event Scale of guide book whose name includes the word ארץ.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223638 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ארץ')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {painting} that starts with {'y'}",
    "uid": 24366,
    "subgraph": "string matching simple contains word",
    "template_index": 539,
    "question": "what are the painting which start with the letter y",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3305213 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3305213>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "what are the portray which begin with the letter y",
    "answers": [
      "Young Girls in Black",
      "Young Virgin Auto-Sodomized by the Horns of Her Own Chastity",
      "Young man in Mayo costume",
      "Young Lady in 1866",
      "Young Spartans Exercising",
      "Young Bacchus",
      "Young Christ",
      "Young Cicero reading",
      "Young Man with Arrow",
      "Yvonne and Christine Lerolle at the Piano",
      "Young Saint with a Sword",
      "Young Omahaw, War Eagle, Little Missouri, and Pawnees",
      "Young Peasant",
      "Yellow Cow",
      "Young Woman Powdering Herself",
      "Young Woman in a Black Dress",
      "Young Ladies Beside the Seine",
      "Young Spanish Nobleman",
      "Young Saint John the Baptist with ram",
      "Young Boy Peeling a Pear",
      "Young woman with cats",
      "Yellow and Green Brushstrokes",
      "Young Man at His Window",
      "Yard with Lunatics",
      "Yperite"
    ]
  },
  {
    "NNQT_question": "Give me {gas giant} that {compulsory education (minimum age)} {Enceladus} and which that starts with {'s'}",
    "uid": 31910,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1162,
    "question": "What what is gas giant with a compulsory education of Enceladus and also which starts with letter s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q121750 . ?sbj wdt:P3270 wd:Q3303 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "What what is gas giant having Enceladus compulsory education and additionally which starts with letter s",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q121750 . ?sbj wdt:P398 wd:Q3303 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of political party} of {François Villon} that is {start time} is {1987-02-28} ?",
    "uid": 31359,
    "subgraph": "statement_property",
    "template_index": 4724,
    "question": "What political party did François Villon belong to in 1987-02-28?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q849 p:P102 ?s . ?s ps:P102 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1987')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Tell me the political party François Villon belonged to in 1987-02-28?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q22368 p:P102 ?s . ?s ps:P102 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1987')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {New York City} has {population} as {4480000} ?",
    "uid": 31542,
    "subgraph": "statement_property",
    "template_index": 3647,
    "question": "When was the population of New York City 4480000?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q60 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'4480000')) . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did New York City have a population of 4480000?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q74881 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'4480000')) . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located in time zone} of {Cassiopeia}, that has {child} is {Andromeda} ?",
    "uid": 30428,
    "subgraph": "right-subgraph",
    "template_index": 131,
    "question": "\"Which is {located in time zone} of {Cassiopeia}, who {has son} is {Andromeda} ?\"",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q207681 wdt:P421 ?answer . ?answer wdt:P40 wd:Q161582}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "\"Which is {located in time zone} of {Cassiopeia}, who {has son} is {Andromeda} ?\"",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q207681 wdt:P26 ?answer . ?answer wdt:P40 wd:Q161582}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {officeholder} are for {Dmitriy Ustinov} ?",
    "uid": 31678,
    "subgraph": "statement_property",
    "template_index": 416,
    "question": "how many officers are there for Dmitriy Ustinov?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q48067 wdt:P1308 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What is the number of officers for Dmitriy Ustinov?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q81066 wdt:P1308 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {borders} of {Riverside}, that has {start date} is {1984-0-0} ?",
    "uid": 12513,
    "subgraph": "right-subgraph",
    "template_index": 1573,
    "question": "Which borders of borders of Riverside have a start date of 1984-0-0?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q49243 wdt:P47 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1984'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q49243> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P47>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P571> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <1984-0-0> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which borders of borders of Riverside have a begin date of 1984-0-0?",
    "answers": [
      "Moreno Valley"
    ]
  },
  {
    "NNQT_question": "How many {time period} are to/by {Sixth Republic of South Korea} ?",
    "uid": 31744,
    "subgraph": "statement_property",
    "template_index": 1737,
    "question": "What is the period of time of the  {Sixth Republic of South Korea} ?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2348 wd:Q488889 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "The Sixth Republic of South Korea is from what time period?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2348 wd:Q428995 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {2.1} with the {MAX(speed)} whose {participating teams} is {Katusha 2016}  ?",
    "uid": 2867,
    "subgraph": "rank",
    "template_index": 66,
    "question": "What is the 2.1 with the highest speed whose participating teams is Katusha 2016?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q22231112 . ?ent wdt:P2052 ?obj . ?ent wdt:P1923 wd:Q21955186 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q22231112>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2052>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1923> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q21955186> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Out of the participating teams in the Katusha 2016, who with a 2.1 had the highest speed?",
    "answers": [
      "2016 Trois Jours de Flandre-Occidentale",
      "2016 Volta Ciclista a la Comunitat Valenciana",
      "2016 Tour des Fjords",
      "2016 Volta ao Algarve",
      "2016 Tour de Yorkshire"
    ]
  }
]