[
  {
    "NNQT_question": "What is the {winner} for {Herbie Hancock} has {award received} as {Edward Oliver LeBlanc} ?",
    "uid": 31494,
    "subgraph": "statement_property",
    "template_index": 2980,
    "question": "Was Herbie Hancock the winner of the award for the Edward Oliver LeBlanc?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q105875 p:P166 ?s . ?s ps:P166 wd:Q563173 . ?s pq:P1346 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Did Herbie Hancock the winner of the award for the Edward Oliver LeBlanc?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q105875 p:P166 ?s . ?s ps:P166 wd:Q691203 . ?s pq:P1346 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {literary work} for {based on} of {Exodus}",
    "uid": 31884,
    "subgraph": "simple question right",
    "template_index": 3032,
    "question": "What literary work inspired the book of Exodus?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q9190 wdt:P144 ?obj . ?obj wdt:P31 wd:Q7725634 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What scholarly work was the source of inspiration of the book of Exodus?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q9190 wdt:P155 ?obj . ?obj wdt:P31 wd:Q7725634 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {twinned administrative body} are for {Monterrey} ?",
    "uid": 1607,
    "subgraph": "statement_property",
    "template_index": 607,
    "question": "How many {twinned administrative body} are there for {Monterrey} ?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q81033 wdt:P190 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q81033> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What is the number of twinned administrative bodies in Monterrey?",
    "answers": [
      "17"
    ]
  },
  {
    "NNQT_question": "What is the {end time} for {Alexandria} has {located in the administrative territorial entity} as {Diocese of Asia} ?",
    "uid": 31563,
    "subgraph": "statement_property",
    "template_index": 5677,
    "question": "When Alexandria, Diocese of Asia, ended?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q87 p:P131 ?s . ?s ps:P131 wd:Q1223088 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Alexdandria stop being the diocese of Asia?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q87 p:P131 ?s . ?s ps:P131 wd:Q1018761 . ?s pq:P582 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {diplomatic relation} of {nationality} of {Lee Friedlander} ?",
    "uid": 14481,
    "subgraph": "right-subgraph",
    "template_index": 4566,
    "question": "What are Lee Friedlander's national diplomatic relations?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q711391 wdt:P27 ?X . ?X wdt:P530 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q711391> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P27>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P530> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are Lee Friedlander's national discretionary relations?",
    "answers": [
      "Canada",
      "Japan",
      "Norway",
      "Ireland",
      "Hungary",
      "Belgium",
      "Luxembourg",
      "Finland",
      "Sweden",
      "Denmark",
      "Poland",
      "Lithuania",
      "Italy",
      "Switzerland",
      "Greece",
      "Turkey",
      "Portugal",
      "Netherlands",
      "Uruguay",
      "Mexico",
      "Ethiopia",
      "Ghana",
      "France",
      "United Kingdom",
      "People's Republic of China",
      "Brazil",
      "Russia",
      "Germany",
      "Belarus",
      "Iceland",
      "Estonia",
      "Latvia",
      "Ukraine",
      "Czech Republic",
      "Slovakia",
      "Slovenia",
      "Moldova",
      "Romania",
      "North Macedonia",
      "Albania",
      "Croatia",
      "Bosnia and Herzegovina",
      "Azerbaijan",
      "Andorra",
      "Cyprus",
      "Georgia",
      "Kazakhstan",
      "Malta",
      "Monaco",
      "Montenegro"
    ]
  },
  {
    "NNQT_question": "What is {of} of {laboratory animal science}",
    "uid": 30790,
    "subgraph": "center",
    "template_index": 2500,
    "question": "What is laboratory animal science comprised of?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P642 wd:Q69957706}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P642 wd:Q521}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {total equity} of {Nawaz Sharif}",
    "uid": 30836,
    "subgraph": "center",
    "template_index": 3611,
    "question": "Which is the total equity of Nawaz Sharif?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q134068 wdt:P2137 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q1197548 wdt:P2137 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {field of this occupation} of {musicographer}, that has {history of topic} is {history of music} ?",
    "uid": 30450,
    "subgraph": "right-subgraph",
    "template_index": 26,
    "question": "Who is profession's field is musicographer having a timeline of topic of history of music?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q61996872 wdt:P425 ?answer . ?answer wdt:P2184 wd:Q846047}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is profession's field is musicographer having a timeline of subject of history of music?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q639669 wdt:P425 ?answer . ?answer wdt:P2184 wd:Q846047}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {part of series} of {preceded by} of {Opie's Newspaper} ?",
    "uid": 14288,
    "subgraph": "left-subgraph",
    "template_index": 430,
    "question": "What episode preceded Opie's Newspapers?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q51231142 wdt:P155 ?X . ?X wdt:P179 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q51231142> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P155>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P179> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What scene gone before Opie's Newspapers?",
    "answers": [
      "The Andy Griffith Show"
    ]
  },
  {
    "NNQT_question": "What is the {start time} for {Riga} has {kit supplier} as {Latvia} ?",
    "uid": 31532,
    "subgraph": "statement_property",
    "template_index": 3984,
    "question": "When did Riga become the kit supplier of Latvia?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q1773 p:P5995 ?s . ?s ps:P5995 wd:Q211 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Riga become Latvia kit supplier?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q1773 p:P17 ?s . ?s ps:P17 wd:Q211 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {location of landing} of {cerebellum}",
    "uid": 30802,
    "subgraph": "center",
    "template_index": 3223,
    "question": "Where is the location of landing of the cerebellum?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1158 wd:Q130983}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P927 wd:Q130983}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {US Congress Bio ID} of {James Callaghan}",
    "uid": 30975,
    "subgraph": "center",
    "template_index": 65,
    "question": "What is US Congress Bio ID for James Callaghan ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q9576 wdt:P1157 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q9576 wdt:P1331 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {film character} that {from fictional universe} {Marvel Universe} and which that starts with {'w'}",
    "uid": 25365,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3185,
    "question": "Give me a film character from a fictional universe, such as Marvel comics that starts with a W.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15773347 . ?sbj wdt:P1080 wd:Q931597 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q15773347>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1080> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q931597>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "Give me a movie personality from a fictional universe, such as Marvel comics that starts with a W.",
    "answers": [
      "Weasel",
      "Warren Worthington III",
      "Wolfsbane",
      "Warpath",
      "Wolverine",
      "William Stryker"
    ]
  },
  {
    "NNQT_question": "How many {business division} are for {Kamal Haasan} ?",
    "uid": 31682,
    "subgraph": "statement_property",
    "template_index": 451,
    "question": "How many business divisions does Kamal Haasan have?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q381477 wdt:P199 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What number of business divisions does Kamal Haasan have?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q381477 wdt:P1412 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {sponsor} are for {Atalanta B.C.} ?",
    "uid": 31689,
    "subgraph": "statement_property",
    "template_index": 590,
    "question": "How many sponsors are for Atalanta B.C.?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q1886 wdt:P859 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Which is the number of sponsors that are for Atalanta B.C.?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q1422 wdt:P859 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Edmund Campion} that is {point in time} is {2007-01-01} ?",
    "uid": 31282,
    "subgraph": "statement_property",
    "template_index": 3178,
    "question": "What is { award received } from { Edmund Campion } that is { point in time } is { 2007 - 0 - 0 }?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q547042 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What is { grant gotten } from { Edmund Campion } that's { point in time } is { 2007 - - }?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q43432 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {movement} of {spouse} of {Buckminster Fuller} ?",
    "uid": 30750,
    "subgraph": "left-subgraph",
    "template_index": 373,
    "question": "WHO IS THE SPOUSE MOVEMENT OF BUCKMINSTER FULLER?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q102289 wdt:P26 ?X . ?X wdt:P135 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "WHO IS THE SPOUSE MOVEMENT OF BUCKMINSTER More full?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q102289 wdt:P737 ?X . ?X wdt:P135 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {facet of} of {geological history of Earth}, that has {child astronomical body} is {S/2015 (136472) 1} ?",
    "uid": 30400,
    "subgraph": "right-subgraph",
    "template_index": 521,
    "question": "The S/2015 (136472) 1 is found in which subtopic of the geological history of the Earth that has moon in the name?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2389585 wdt:P1269 ?answer . ?answer wdt:P398 wd:Q23926758}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "The S/2015 (136472) 1 is found in which subtopic of the geographical history of the Soil that has moon within the name?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q2389585 wdt:P1269 ?answer . ?answer wdt:P398 wd:Q405}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {The Tonight Show} has {movement} as {Johnny Carson} ?",
    "uid": 31512,
    "subgraph": "statement_property",
    "template_index": 4378,
    "question": "When did Johnny Carson start as the movement for The Tonight Show?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q1338655 p:P135 ?s . ?s ps:P135 wd:Q310819 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Give the date Johnny Carson began as the movement for The Tonight Show.",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q1338655 p:P371 ?s . ?s ps:P371 wd:Q310819 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {nonmetal} with the {MAX(electronegativity)} ?",
    "uid": 2629,
    "subgraph": "rank",
    "template_index": 205,
    "question": "Tell me the name of a non-metal with the most electronegativity",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q19600 . ?ent wdt:P1108 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q19600>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1108>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .}\nORDER BY DESC(?obj)\nLIMIT 5",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "Let me know the name of a non-metal with the foremost electronegativity",
    "answers": [
      "oxygen"
    ]
  },
  {
    "NNQT_question": "What is {Showrunner} of {The Apprentice}, that has {has sister} is {Robert Trump} ?",
    "uid": 13980,
    "subgraph": "right-subgraph",
    "template_index": 65,
    "question": "Who is the showrunner of The Apprentice, who also has a sister called Robert Trump?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q863122 wdt:P1431 ?answer . ?answer wdt:P3373 wd:Q28748031}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q863122> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1431>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3373> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q28748031> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the showrunner of The Apprentice, who additionally has a sister called Robert Trump?",
    "answers": [
      "Donald Trump"
    ]
  },
  {
    "NNQT_question": "What is {age of consent} of {Roger Milla} and {number of matches played/races/starts}",
    "uid": 32002,
    "subgraph": [],
    "template_index": 1315,
    "question": "What was Roger Milla's age of consent and how many matches did he play?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q168540 p:P2999 ?s . ?s ps:P2999 ?obj . ?s pq:P1350 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Roger Milla had what age of consent and how numerous matches did he play?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q168540 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {newspaper format} are to/by {road} ?",
    "uid": 31736,
    "subgraph": "statement_property",
    "template_index": 1561,
    "question": "How many newspaper formats by road?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3912 wd:Q34442 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Which is the number of the newspaper formats by road?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2505 wd:Q34442 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Podgorica} has {country} as {Atahualpa} ?",
    "uid": 31486,
    "subgraph": "statement_property",
    "template_index": 5760,
    "question": "When Podgorica started as Atahualpa?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q23564 p:P17 ?s . ?s ps:P17 wd:Q179577 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Podgorica start as Atahualpa?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q23564 p:P17 ?s . ?s ps:P17 wd:Q779011 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {has cities} of {county seat of} of {Catania} ?",
    "uid": 15396,
    "subgraph": "right-subgraph",
    "template_index": 2379,
    "question": "The country of Catania has which cities?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1903 wdt:P1376 ?X . ?X wdt:P150 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1903> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1376>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P150> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "The nation of Catania has which cities?",
    "answers": [
      "Catania",
      "Acireale",
      "Zafferana Etnea",
      "Linguaglossa",
      "Aci Bonaccorsi",
      "Aci Castello",
      "Aci Catena",
      "Aci Sant'Antonio",
      "Adrano",
      "Belpasso",
      "Biancavilla",
      "Bronte",
      "Calatabiano",
      "Caltagirone",
      "Camporotondo Etneo",
      "Castel di Judica",
      "Castiglione di Sicilia",
      "Fiumefreddo di Sicilia",
      "Giarre",
      "Grammichele",
      "Gravina di Catania",
      "Licodia Eubea",
      "Maletto",
      "Maniace",
      "Mascali",
      "Mascalucia",
      "Mazzarrone",
      "Militello in Val di Catania",
      "Milo, Sicily",
      "Mineo",
      "Mirabella Imbaccari",
      "Misterbianco",
      "Motta Sant'Anastasia",
      "Nicolosi",
      "Palagonia",
      "Paternò",
      "Pedara",
      "Piedimonte Etneo",
      "Raddusa",
      "Ragalna",
      "Ramacca",
      "Randazzo",
      "Riposto",
      "San Cono",
      "San Giovanni la Punta",
      "San Gregorio di Catania",
      "San Michele di Ganzaria",
      "San Pietro Clarenza",
      "Sant'Agata li Battiati",
      "Sant'Alfio"
    ]
  },
  {
    "NNQT_question": "What is {deathplace} of {Amelia Earhart}, that has {tributary} is {Ayampe River} ?",
    "uid": 11876,
    "subgraph": "right-subgraph",
    "template_index": 4603,
    "question": "\"Where is {deathplace} of {Amelia Earhart}, which has {tributary} is {Ayampe River} ?\"",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3355 wdt:P20 ?answer . ?answer wdt:P974 wd:Q1367043}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q3355> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P974> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1367043> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "\"Where is {deathplace} of {Amelia Earhart}, which has {tributary} is {Ayampe River} ?\"",
    "answers": [
      "Pacific Ocean"
    ]
  },
  {
    "NNQT_question": "What is the {replaces} for {Arturo Alessandri} has {position held} as {Chief Justice of the United States} ?",
    "uid": 31559,
    "subgraph": "statement_property",
    "template_index": 2786,
    "question": "Who replaced Arturo Alessandri as the Chief Justice of The United States?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q848 p:P39 ?s . ?s ps:P39 wd:Q11147 . ?s pq:P1365 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Give the name of the Chief Justice of the United States who replaced Arturo Alessandri.",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q313252 p:P39 ?s . ?s ps:P39 wd:Q11147 . ?s pq:P1365 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {founder} of {located in} of {The Parnassus} ?",
    "uid": 16609,
    "subgraph": "left-subgraph",
    "template_index": 239,
    "question": "What is the founder of the located in of The Parnassus ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2715152 wdt:P276 ?X . ?X wdt:P112 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2715152> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P276>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P112> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is the founder of the location of The Parnassus?",
    "answers": [
      "Julius II"
    ]
  },
  {
    "NNQT_question": "What is the {3D film} with the {MAX(cost)} whose {FSK film rating} is {music critic} ?",
    "uid": 31098,
    "subgraph": "rank",
    "template_index": 258,
    "question": "Name the music critic rated 3D film with the highest cost ?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q229390 . ?ent wdt:P2130 ?obj . ?ent wdt:P1981 wd:Q1350157 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "What music critic rated 3D film cost the most?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q229390 . ?ent wdt:P2130 ?obj . ?ent wdt:P1981 wd:Q20644796 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Edward C. Prescott} that is {point in time} is {2004-1-1} ?",
    "uid": 8568,
    "subgraph": "statement_property",
    "template_index": 5013,
    "question": "What award did Edward C. Prescott receive on 1-1-2004?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q312585 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2004')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q312585> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2004-1-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Edward C. Prescott received what award on January 1st, 2004?",
    "answers": [
      "Prize in Economic Sciences in Memory of Alfred Nobel"
    ]
  },
  {
    "NNQT_question": "What is the {United States federal executive department} for {archives at} of {Jefferson Davis}",
    "uid": 31831,
    "subgraph": "simple question right",
    "template_index": 1670,
    "question": "What U.S. federal executive department holds the archives of Jefferson Davis?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q162269 wdt:P485 ?obj . ?obj wdt:P31 wd:Q910252 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What U.S. federal executive department holds the files of Jefferson Davis?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q162269 wdt:P485 ?obj . ?obj wdt:P31 wd:Q1752939 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {branch of science} that starts with {'v'}",
    "uid": 24040,
    "subgraph": "string matching simple contains word",
    "template_index": 2649,
    "question": "What branch of science starts with the letter \"v\"?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2465832 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2465832>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What department of science begins with the letter \"v\"?",
    "answers": [
      "volkerpsychologie",
      "valeology",
      "viticulture",
      "veterinary pathology",
      "viral phylodynamics",
      "vision science"
    ]
  }
]