[
  {
    "NNQT_question": "What is {start time} and {end time} of {Aleksandr Solzhenitsyn} has {student of} as {Natalia Solzhenitsyna}",
    "uid": 32095,
    "subgraph": [],
    "template_index": 356,
    "question": "When was Aleksandr Solzhenitsyn a student of Natalia Solzhenitsyna and when did it end?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q34474 p:P1066 ?s . ?s ps:P1066 wd:Q4427694 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the starting and ending date of Aleksandr Solzhenitsyn's lessons with Natalia Solzhenitsyna?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q34474 p:P26 ?s . ?s ps:P26 wd:Q4427694 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {position held} of {Madonna} that is {end time} is {2004-01-01} ?",
    "uid": 31417,
    "subgraph": "statement_property",
    "template_index": 5174,
    "question": "what position did Madonna hold in 2004-0-0?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1744 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2004')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What job did Madonna have in 2004?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q335189 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2004')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {diplomatic relation} of {country for sport} of {Ajay Devgn} ?",
    "uid": 30726,
    "subgraph": "right-subgraph",
    "template_index": 1878,
    "question": "With what nation does Ajay Devgan have diplomatic relations?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q146929 wdt:P1532 ?X . ?X wdt:P530 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "With what country does Ajay Devgan have diplomatic relations?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q146929 wdt:P27 ?X . ?X wdt:P530 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Commons category} of {Tabinshwehti}",
    "uid": 30847,
    "subgraph": "center",
    "template_index": 1783,
    "question": "What is the Commons category of Tabinshwehti ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q981475 wdt:P373 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q465108 wdt:P373 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Yichun} that contains the word {xinjiang} in their name",
    "uid": 31144,
    "subgraph": "string matching simple contains word",
    "template_index": 2315,
    "question": "Tell me the Yichun which contains the word xinjiang in it's name?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q349976 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'xinjiang')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me the Yichun which consists of the phrase xinjiang in it's name?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q57362 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'xinjiang')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {candidate} of {took part} of {Gustav Winckler} ?",
    "uid": 16612,
    "subgraph": "left-subgraph",
    "template_index": 66,
    "question": "Which is the candidature that Gustav Winckler took part of?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q715063 wdt:P1344 ?X . ?X wdt:P710 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q715063> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1344>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P710> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the candidature that Gustav Wincklet took part of?",
    "answers": [
      "Margot Hielscher",
      "Corry Brokken",
      "Lys Assia",
      "Paule Desjardins",
      "Bob Martin",
      "Patricia Bredin",
      "Birthe Wilke",
      "Danièle Dupré",
      "Bobbejaan Schoepen",
      "Gustav Winckler",
      "Nunzio Gallo"
    ]
  },
  {
    "NNQT_question": "What is {member of sports team} of {Peter Schmeichel} that is {start time} is {1984-1-1} ?",
    "uid": 6087,
    "subgraph": "statement_property",
    "template_index": 2532,
    "question": "What team did Peter Schmeichel start playing for in 1984?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q182314 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1984')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q182314> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P54> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1984-1-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What team did Peter Schmeichel join in 1984?",
    "answers": [
      "Denmark national under-21 football team",
      "Hvidovre IF"
    ]
  },
  {
    "NNQT_question": "What is {nominated for} of {D. T. Suzuki} that is {end time} is {1963-01-01} ?",
    "uid": 31464,
    "subgraph": "statement_property",
    "template_index": 1233,
    "question": "For what reason D.T. suzuku was in nomination until the year 1963?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q44847 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1963')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Why was D.T. Suzuku nominated until 1963?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q44847 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1963')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {famous for} of {writers} of {Sonnet 72} ?",
    "uid": 15693,
    "subgraph": "left-subgraph",
    "template_index": 44,
    "question": "William Shakespeare is the famous for writing's in the Sonnet 72.",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3490580 wdt:P50 ?X . ?X wdt:P800 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q3490580> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P50>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P800> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "William Shakespeare is the well-known for writing's in the Sonnet seventy two",
    "answers": [
      "Othello",
      "Hamlet",
      "The Two Noble Kinsmen",
      "Romeo and Juliet",
      "The Tempest",
      "A Midsummer Night's Dream",
      "Love's Labour's Lost",
      "Macbeth",
      "Much Ado About Nothing",
      "King Lear",
      "Troilus and Cressida",
      "The Merchant of Venice",
      "Julius Caesar",
      "Twelfth Night",
      "The Two Gentlemen of Verona",
      "As You Like It",
      "Titus Andronicus",
      "Timon of Athens",
      "The Taming of the Shrew",
      "Coriolanus",
      "Henry V",
      "The Comedy of Errors",
      "All's Well That Ends Well",
      "Pericles, Prince of Tyre",
      "Antony and Cleopatra",
      "Henry IV, Part 1",
      "Henry VI, Part 1",
      "Richard II",
      "Richard III",
      "King John",
      "Shakespeare's sonnets",
      "Measure for Measure",
      "Henry VIII",
      "Cymbeline",
      "The Winter's Tale",
      "The Merry Wives of Windsor",
      "Henry IV, Part 2",
      "Henry VI, Part 2",
      "Henry VI, Part 3"
    ]
  },
  {
    "NNQT_question": "Give me {fictional detective} that starts with {'s'}",
    "uid": 24653,
    "subgraph": "string matching simple contains word",
    "template_index": 214,
    "question": "What are the fictional detective which start with the letter s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3656924 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3656924>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the anecdotal criminologist which begin with the letter s",
    "answers": [
      "Sherlock Holmes",
      "Sandman",
      "Sam Spade",
      "Sarah Essen",
      "Space Ranger",
      "Shabor Dasgupta"
    ]
  },
  {
    "NNQT_question": "How many {occupant} are to/by {Rijksmuseum} ?",
    "uid": 2126,
    "subgraph": "statement_property",
    "template_index": 1470,
    "question": "How many works are occupied in the Rijksmuseum?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P466 wd:Q190804 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P466> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q190804 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "How many works are contained within the Rijksmuseum?",
    "answers": [
      "12"
    ]
  },
  {
    "NNQT_question": "What is {noble title} of {Plato} and {followed by}",
    "uid": 32011,
    "subgraph": [],
    "template_index": 788,
    "question": "Plato position is what and he got his position after which person?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q859 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P156 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Plato role is what and he bought his role after which person?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q71231 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P156 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {film production company} for {Slack organization ID} of {Oprah Winfrey}",
    "uid": 30304,
    "subgraph": "simple question left",
    "template_index": 3371,
    "question": "What film production company was Slack organization ID of Oprah Winfrey?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P8614 wd:Q55800 . ?sbj wdt:P31 wd:Q1762059 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What film generation company was Slack organization ID of Oprah Winfrey?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P112 wd:Q55800 . ?sbj wdt:P31 wd:Q1762059 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {location} of {participant in} of {Charles de Gaulle} ?",
    "uid": 30624,
    "subgraph": "left-subgraph",
    "template_index": 3451,
    "question": "What region does Charles de Gaulle compete in?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2042 wdt:P1344 ?X . ?X wdt:P276 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What locale does Charles de Gaulle compete in?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q46104 wdt:P1344 ?X . ?X wdt:P276 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {formation} of {Story Musgrave}, that has {in action} is {Banana Wars} ?",
    "uid": 13863,
    "subgraph": "right-subgraph",
    "template_index": 1290,
    "question": "This sentence makes no sense.",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q462132 wdt:P241 ?answer . ?answer wdt:P607 wd:Q768496}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q462132> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P241>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P607> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q768496> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "This sentence makes no sense.",
    "answers": [
      "United States Marine Corps"
    ]
  },
  {
    "NNQT_question": "what is the {language of work or name} for {Tuesday} has {named after} as {3} ?",
    "uid": 4184,
    "subgraph": "statement_property",
    "template_index": 629,
    "question": "what is Tuesday named after?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q127 p:P138 ?s . ?s ps:P138 wd:Q201 . ?s pq:P407 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q127> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P138> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q201> .\n?statement <http://www.wikidata.org/entity/P407> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Where does Tuesday get its name from?",
    "answers": [
      "Portuguese",
      "Greek",
      "Vietnamese",
      "Hebrew",
      "Arabic"
    ]
  },
  {
    "NNQT_question": "What is {ionization energy} of {1}",
    "uid": 30893,
    "subgraph": "center",
    "template_index": 630,
    "question": "What is the ionization energy of 1?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q199 wdt:P2260 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q199 wdt:P179 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {fictional family} for {relative} of {Donald Duck}",
    "uid": 31892,
    "subgraph": "simple question right",
    "template_index": 1490,
    "question": "What is the name of Donald Ducks relative ?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q6550 wdt:P1038 ?obj . ?obj wdt:P31 wd:Q15331236 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the title of Donald Ducks relative ?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q6550 wdt:P53 ?obj . ?obj wdt:P31 wd:Q15331236 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {main building contractor} {type of food or dish} that contains the word {torta} in their name",
    "uid": 31172,
    "subgraph": "string matching simple contains word",
    "template_index": 1026,
    "question": "What are the things with type of food or dish as main building contractor that contains the word torta in their name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P193 wd:Q19861951 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'torta')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What kind of objects having food or dish as main building contractor does the word torta contain in its name?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19861951 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'torta')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {television series} for {executive producer} of {Robert Rusler}",
    "uid": 30315,
    "subgraph": "simple question left",
    "template_index": 1607,
    "question": "Which television series did Robert Rusler produce?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1431 wd:Q687218 . ?sbj wdt:P31 wd:Q5398426 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which TV series were produced by Robert Rusler?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1431 wd:Q56094 . ?sbj wdt:P31 wd:Q5398426 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {country} for {participant} of {Battle for the Kapelsche Veer}",
    "uid": 31862,
    "subgraph": "simple question right",
    "template_index": 3355,
    "question": "What countries participated in the Battle for the Kapelsche Veer?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q2236703 wdt:P710 ?obj . ?obj wdt:P31 wd:Q6256 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What nations taken part within the Battle for the Kapelsche Veer?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q151340 wdt:P710 ?obj . ?obj wdt:P31 wd:Q6256 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {circle of} of {Claude Lancelot}",
    "uid": 30809,
    "subgraph": "center",
    "template_index": 3300,
    "question": "What is the circle of Claude Lancelot?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1776 wd:Q1096867}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1776 wd:Q318943}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {crystal system} and the {discoverer or inventor} of {Titanium} ?",
    "uid": 10119,
    "subgraph": "two intentions right subgraph",
    "template_index": 361,
    "question": "Which is the {crystal system} who {discoverer or inventor} of {Titanium} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q716 wdt:P556 ?ans_1 . wd:Q716 wdt:P61 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q716> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P556> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q716> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P61> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "who invented titanum and what is the crystal system?",
    "answers": [
      "hexagonal crystal system",
      "Friedrich Wöhler"
    ]
  },
  {
    "NNQT_question": "What is the {Ahwaz} with the {MAX(individual tax rate)} ?",
    "uid": 31073,
    "subgraph": "rank",
    "template_index": 370,
    "question": "Which Ahvaz has highest individual tax rate?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q170366 . ?ent wdt:P2834 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "What Ahvaz has the highest taxes?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q6256 . ?ent wdt:P2834 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {has edition or translation} of {platform} of {Dizzy – The Ultimate Cartoon Adventure} ?",
    "uid": 30619,
    "subgraph": "right-subgraph",
    "template_index": 1088,
    "question": "What gaming platform is Dizzy – The Ultimate Cartoon Adventure on?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q147789 wdt:P400 ?X . ?X wdt:P747 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "The Dizzy – The Ultimate Cartoon Adventure game  is available on which platform?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q106827 wdt:P400 ?X . ?X wdt:P747 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {licence plate code} are for {Almaty} ?",
    "uid": 31716,
    "subgraph": "statement_property",
    "template_index": 556,
    "question": "How many licence plate codes are there for Almaty?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q35493 wdt:P395 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "How many different licence plate codes does Almaty have?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q35493 wdt:P1448 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {carbonated water} for {manufacturer} of {The Coca-Cola Company}",
    "uid": 30322,
    "subgraph": "simple question left",
    "template_index": 1038,
    "question": "Which is the carbonated water, manufactured by the Coca Cola Company?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P176 wd:Q3295867 . ?sbj wdt:P31 wd:Q264554 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "The Coca Cola Company manufactured which carbonated water",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P176 wd:Q3295867 . ?sbj wdt:P31 wd:Q147538 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {recurring sporting event} that contains the word {world} in their name",
    "uid": 23100,
    "subgraph": "string matching simple contains word",
    "template_index": 3619,
    "question": "Tell me recurring sporting event whose name has the word world in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18608583 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'world')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q18608583>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'world')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me habitual sporting event whose name has the word world in it.",
    "answers": [
      "World Figure Skating Championships",
      "World Squash Championships",
      "World Rugby Pacific Nations Cup",
      "IFAF Women's World Championship",
      "IFAF World Championship",
      "World Junior Curling Championships",
      "Cricket World Cup",
      "World Outgames",
      "Motocross World Championship",
      "WWE World Championship",
      "FIFA U-20 World Cup",
      "Rugby World Cup",
      "World Chess Championship",
      "World Darts Trophy",
      "World Snooker Championship",
      "Badminton World Championships",
      "Para-Badminton World Championships",
      "World Junior Badminton Championships",
      "World Railway Badminton Championships",
      "World Senior Badminton Championships",
      "Badminton World Cup",
      "World Deaf Badminton Championships",
      "Bandy World Championship for women",
      "Six-red World Championship",
      "World Weightlifting Championships"
    ]
  },
  {
    "NNQT_question": "What is {champ} of {prize awarded} of {Lily Tomlin} ?",
    "uid": 14554,
    "subgraph": "left-subgraph",
    "template_index": 189,
    "question": "Who is {champ} of {prize awarded} {Lily Tomlin} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q229271 wdt:P166 ?X . ?X wdt:P1346 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q229271> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1346> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is {champ} of {prize granted} {Lily Tomlin} ?TARD ?",
    "answers": [
      "Elizabeth Taylor",
      "Frank Sinatra",
      "Mary Tyler Moore",
      "Audrey Hepburn",
      "Clint Eastwood",
      "Morgan Freeman",
      "Katharine Hepburn",
      "Robert Redford",
      "Stan Laurel",
      "Gene Kelly",
      "Charlton Heston",
      "Edward G. Robinson",
      "Barbara Stanwyck",
      "James Cagney",
      "Bob Hope",
      "Jack Lemmon",
      "Karl Malden",
      "James Stewart",
      "Ernest Borgnine",
      "Kirk Douglas",
      "Sidney Poitier",
      "Gregory Peck",
      "James Garner",
      "Ed Asner",
      "Burt Lancaster",
      "Julie Andrews",
      "Shirley Temple",
      "James Earl Jones",
      "Angela Lansbury",
      "Danny Kaye",
      "Lily Tomlin",
      "Rita Moreno",
      "Rosalind Russell",
      "Ruby Dee",
      "Carol Burnett",
      "Debbie Reynolds",
      "Dick Van Dyke",
      "Alan Alda",
      "Leon Ames",
      "Charles Durning",
      "Ricardo Montalbán",
      "George Burns",
      "Eddie Cantor",
      "Walter Pidgeon",
      "Ralph Bellamy",
      "Betty White",
      "Martha Raye",
      "Pearl Bailey",
      "Ossie Davis",
      "Brock Peters"
    ]
  },
  {
    "NNQT_question": "What is {inhabitants} of {studio where filmed} of {Halloween} ?",
    "uid": 15198,
    "subgraph": "right-subgraph",
    "template_index": 5611,
    "question": "What are the inhabitants of the studio where Halloween was filmed?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q221103 wdt:P915 ?X . ?X wdt:P1082 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q221103> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P915>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the occupants of the studio where Halloween was filmed?",
    "answers": [
      "3976322",
      "39144818"
    ]
  }
]