[
  {
    "NNQT_question": "What is {office held by head of state} of {place of death} of {Francisco Serrão} ?",
    "uid": 30732,
    "subgraph": "right-subgraph",
    "template_index": 540,
    "question": "What is the head of state's office held by Francisco Serrao?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q554452 wdt:P20 ?X . ?X wdt:P1906 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the head of state's office held by Francisco Serrao?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q554452 wdt:P27 ?X . ?X wdt:P1906 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {ISNI} of {pentathlon}",
    "uid": 30842,
    "subgraph": "center",
    "template_index": 4027,
    "question": "Which is the ISNI for pentathlon?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1163125 wdt:P213 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q216256 wdt:P213 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Bielefeld} with the {MIN(race time)} whose {winner} is {Peter Gehm} ?",
    "uid": 31097,
    "subgraph": "rank",
    "template_index": 501,
    "question": "What is the Bielefeld with the lowest race time whose winner is Peter Gehm?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q2112 . ?ent wdt:P2781 ?obj . ?ent wdt:P1346 wd:Q12044712} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "What Bielefeld has the lowest race time that was won by Peter Gehm?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q1701273 . ?ent wdt:P2781 ?obj . ?ent wdt:P1346 wd:Q12044712} ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {languages spoken, written or signed} of {Romy Schneider}, that has {has grammatical person} is {George I of Greece} ?",
    "uid": 30363,
    "subgraph": "right-subgraph",
    "template_index": 2658,
    "question": "Which language spoken by Romy Schneider, has the grammatical person speaking as George I of Greece?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q78469 wdt:P1412 ?answer . ?answer wdt:P5110 wd:Q17142}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which dialect spoken by Romy Schneider, has the syntactic individual talking as George I of Greece?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q78469 wdt:P1412 ?answer . ?answer wdt:P5110 wd:Q51929517}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {head of state} and the {office held by head of state} of {natural track luge} ?",
    "uid": 31946,
    "subgraph": "two intentions right subgraph",
    "template_index": 630,
    "question": "What are the head of state and the office held by head of state of the natural track luge?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q31897 wdt:P35 ?ans_1 . wd:Q31897 wdt:P1906 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What is the head of state of the natural track luge?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q15180 wdt:P35 ?ans_1 . wd:Q15180 wdt:P1906 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {given name} of {Chrissie Hynde} and {end time}",
    "uid": 32036,
    "subgraph": [],
    "template_index": 194,
    "question": "What was Chrissie Hynde given name and when did it end?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q239202 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P582 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What was Chrissie Hynde given name and when did it conclude?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q239202 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {product or material produced} of {grapefruit juice}",
    "uid": 30794,
    "subgraph": "center",
    "template_index": 2623,
    "question": "Which is the product or the material produced of grapefruit juice?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1056 wd:Q1138468}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1056 wd:Q787325}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {nut} that contains the word {nut} in their name",
    "uid": 23920,
    "subgraph": "string matching simple contains word",
    "template_index": 1522,
    "question": "WHICH ARE THE NUT THAT CONTAINS THE WORD NUT IN THEIR NAME",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11009 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'nut')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q11009>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'nut')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "WHICH ARE THE NUT THAT CONTAINS THE WORD NUT IN THEIR Title",
    "answers": [
      "buckeye nut",
      "kukui nut",
      "American chestnut",
      "Manchurian walnut"
    ]
  },
  {
    "NNQT_question": "What is {end time} and {start time} of {Augsburg} has {located in the administrative territorial entity} as {Territory of Hawaii}",
    "uid": 32066,
    "subgraph": [],
    "template_index": 74,
    "question": "When did Augsburg become an entity as the Territory of Hawaii?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q2749 p:P131 ?s . ?s ps:P131 wd:Q547795 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "On what date did Augsburg become an entity of the Territory of Hawaii?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q18094 p:P131 ?s . ?s ps:P131 wd:Q547795 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {position held} of {Ashdod} that is {start time} is {1994-11-10} ?",
    "uid": 31264,
    "subgraph": "statement_property",
    "template_index": 153,
    "question": "When position did Ashdod hold on November 10, 1994?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q171639 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1994')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "On November 10, 1994, what was Ashdod's role?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q567 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1994')) }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {InChIKey} of {atropine}",
    "uid": 31056,
    "subgraph": "center",
    "template_index": 3978,
    "question": "What is the InChIKey of Atropine?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q26272 wdt:P235 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q26272 wdt:P3890 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {image} of {Kentucky}",
    "uid": 31053,
    "subgraph": "center",
    "template_index": 63,
    "question": "Which is the image of Kentucky?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1603 wdt:P18 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q1603 wdt:P2927 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {main food source} of {Thessaloniki}",
    "uid": 30247,
    "subgraph": "simple question left",
    "template_index": 287,
    "question": "Where is the human main food source in Thessaloniki?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1034 wd:Q17151 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is Thessaloniki human main food source?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P19 wd:Q17151 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {oxidation state} are for {nickel} ?",
    "uid": 1200,
    "subgraph": "statement_property",
    "template_index": 200,
    "question": "What is the oxidation state for nickel?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q744 wdt:P1121 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q744> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1121> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "When does nickel enter an oxidation state?",
    "answers": [
      "5"
    ]
  },
  {
    "NNQT_question": "What is {convicted of} of {Canada} that is {start time} is {1966-01-01} ?",
    "uid": 31384,
    "subgraph": "statement_property",
    "template_index": 1254,
    "question": "Who is the convicted of Canada that was elected on January 1st, 1966?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q16 p:P1399 ?s . ?s ps:P1399 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1966')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Could you provide the convicted of Canada elected on January 1st, 1966?.",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q16 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1966')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {county seat} of {Central District}, that has {twin cities} is {Feodosiya} ?",
    "uid": 12163,
    "subgraph": "right-subgraph",
    "template_index": 2775,
    "question": "Located in the Central District, what is the county seat whose twin cities include Feodosiya?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q188785 wdt:P36 ?answer . ?answer wdt:P190 wd:Q158491}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q188785> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P36>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q158491> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Located in the Central District, what is the county seat whose twin cities include Feodosiya?",
    "answers": [
      "Ramla"
    ]
  },
  {
    "NNQT_question": "What is the {mother} and the {spouse} of {Candice_Bergen} ?",
    "uid": 9729,
    "subgraph": "two intentions right subgraph",
    "template_index": 37,
    "question": "Who is the mother and husband of Candice Bergen?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q106942 wdt:P25 ?ans_1 . wd:Q106942 wdt:P26 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q106942> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P25> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q106942> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Who are Candice Bergen's parents?",
    "answers": [
      "Frances Bergen",
      "Louis Malle"
    ]
  },
  {
    "NNQT_question": "What is {voice actor} of {gained territory from} of {Rukh} ?",
    "uid": 30571,
    "subgraph": "left-subgraph",
    "template_index": 48,
    "question": "WHO THE DUBBER OF RUKH gained territory from?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q30060903 wdt:P7903 ?X . ?X wdt:P725 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "WHO THE DUBBER OF RUKH gained territory from?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q30060903 wdt:P1441 ?X . ?X wdt:P725 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {grapheme} for {incarnation of} of {Jesus}",
    "uid": 31823,
    "subgraph": "simple question right",
    "template_index": 325,
    "question": "What is the grapheme of the incarnation of Jesus Christ?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q302 wdt:P3701 ?obj . ?obj wdt:P31 wd:Q2545446 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "The grapheme given to Jesus Christ incarnated, do you recall it?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q302 wdt:P3701 ?obj . ?obj wdt:P31 wd:Q82799 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {base} of {6-cube}",
    "uid": 30789,
    "subgraph": "center",
    "template_index": 1721,
    "question": "What is the base of a 6-cube?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P3263 wd:Q2527813}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P3263 wd:Q812880}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {record label} for {record label} of {Emperor Wu of Liu Song}",
    "uid": 31783,
    "subgraph": "simple question right",
    "template_index": 3759,
    "question": "Which record label signed Emperor Wu of Song?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q49699 wdt:P264 ?obj . ?obj wdt:P31 wd:Q18127 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the record label signed by Emperor Wu of Song?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q131324 wdt:P264 ?obj . ?obj wdt:P31 wd:Q18127 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {musical composition} for {prize money} of {Dionysus}",
    "uid": 30255,
    "subgraph": "simple question left",
    "template_index": 3894,
    "question": "Name a musical composition which prize money is Dionysus",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2121 wd:Q41680 . ?sbj wdt:P31 wd:Q207628 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Title a melodic composition which prize money is Dionysus",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P674 wd:Q41680 . ?sbj wdt:P31 wd:Q207628 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {parallax} for {Vasily Chuikov} has {award received} as {Order of Lenin} ?",
    "uid": 31525,
    "subgraph": "statement_property",
    "template_index": 3736,
    "question": "What was Vasily Chuikov parallax when he was awarded with the Order of Lenin?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q157594 p:P166 ?s . ?s ps:P166 wd:Q185493 . ?s pq:P2214 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was Vasily Chuikov parallax when he won the Order of Lenin?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q157594 p:P166 ?s . ?s ps:P166 wd:Q185493 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {armament} are to/by {aircraft} ?",
    "uid": 2400,
    "subgraph": "statement_property",
    "template_index": 1744,
    "question": "How many armament does the aircraft has?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P520 wd:Q11436 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P520> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q11436 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "What are all the kinds of armaments on this aircraft?",
    "answers": [
      "10"
    ]
  },
  {
    "NNQT_question": "What is the {point in time} for {Supernatural} has {file format} as {Favorite Pop/Rock Album} ?",
    "uid": 31514,
    "subgraph": "statement_property",
    "template_index": 3823,
    "question": "When did Supernatural have the Favorite Pop/Rock Album file format?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q819127 p:P2701 ?s . ?s ps:P2701 wd:Q19858080 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "On what date did Supernatural have the Favorite Pop/Rock Album file format?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q819127 p:P166 ?s . ?s ps:P166 wd:Q19858080 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {anatomical location} are to/by {Scorpius} ?",
    "uid": 31752,
    "subgraph": "statement_property",
    "template_index": 1205,
    "question": "How many anatomical locations are by Scorpius?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P927 wd:Q8865 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "What is the number of anatomical locations near Scorpius?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P59 wd:Q8865 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Independent software vendor} for {product or material produced} of {Pong}",
    "uid": 30280,
    "subgraph": "simple question left",
    "template_index": 1058,
    "question": "Which Independent software vendor developed Pong ?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1056 wd:Q216293 . ?sbj wdt:P31 wd:Q1661112 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which Independent software vendor developed Pong ?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1056 wd:Q216293 . ?sbj wdt:P31 wd:Q210167 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Khanate} for {country} of {Volga Bulgaria}",
    "uid": 31872,
    "subgraph": "simple question right",
    "template_index": 1674,
    "question": "When did khanate for country of Volga Bulgaria?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q185488 wdt:P17 ?obj . ?obj wdt:P31 wd:Q331644 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What Khanate was Volga Bulgaria state?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q79965 wdt:P17 ?obj . ?obj wdt:P31 wd:Q331644 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {colour} of {appears in} of {Rocketeer} ?",
    "uid": 15961,
    "subgraph": "left-subgraph",
    "template_index": 11,
    "question": "Which color appears in Rocketeer?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q13476036 wdt:P1441 ?X . ?X wdt:P462 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q13476036> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1441>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P462> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the color of Rocketeer?",
    "answers": [
      "Technicolor",
      "color"
    ]
  },
  {
    "NNQT_question": "What is {executive authority} of {play} of {snowboard} ?",
    "uid": 15247,
    "subgraph": "right-subgraph",
    "template_index": 9,
    "question": "Who is {executive authority} of {play} {snowboard} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2000617 wdt:P641 ?X . ?X wdt:P797 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2000617> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P641>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P797> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What major works are created by Ruth?",
    "answers": [
      "International Ski Federation"
    ]
  },
  {
    "NNQT_question": "What is {population} of {United States of America} that is {point in time} is {1992-01-01} ?",
    "uid": 31409,
    "subgraph": "statement_property",
    "template_index": 795,
    "question": "What was the population of United States of America in 1992?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q30 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1992')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "how many people lived in United States of America in 1992?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q967 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1992')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {place of death} of {Gerrit Rietveld}, that has {territory claimed by} is {Themaat} ?",
    "uid": 30441,
    "subgraph": "right-subgraph",
    "template_index": 249,
    "question": "Where is the death place of Gerrit Rietveld located in the territory claimed by Themaat?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q160435 wdt:P20 ?answer . ?answer wdt:P1336 wd:Q1846873}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Where is the dying location of Gerrit Rietveld placed in the territory claimed by Themaat?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q160435 wdt:P20 ?answer . ?answer wdt:P1383 wd:Q1846873}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {nonprofit organization} for {concentration} of {association football}",
    "uid": 31801,
    "subgraph": "simple question right",
    "template_index": 3657,
    "question": "What nonprofit organization is a concentration of the association of football?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q2736 wdt:P6274 ?obj . ?obj wdt:P31 wd:Q163740 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What nonprofit organization is a concentration of the affiliation of football?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q2736 wdt:P3719 ?obj . ?obj wdt:P31 wd:Q163740 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {constituency of the Rajya Sabha} for {synonym} of {Karnataka}",
    "uid": 31846,
    "subgraph": "simple question right",
    "template_index": 1396,
    "question": "Which is the constituency of the Rajya Sabha synonym of Karnataka?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q1185 wdt:P5973 ?obj . ?obj wdt:P31 wd:Q57156205 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Are the voters of Rajya Sabha synonym of Karnataka?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q1185 wdt:P3403 ?obj . ?obj wdt:P31 wd:Q57156205 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {stock character} for {noun class} of {superhero}",
    "uid": 31796,
    "subgraph": "simple question right",
    "template_index": 713,
    "question": "Who is the noun class of the superhero?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q188784 wdt:P7165 ?obj . ?obj wdt:P31 wd:Q636497 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the superhero's noun class?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q188784 wdt:P461 ?obj . ?obj wdt:P31 wd:Q636497 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of sports team} of {Marcel Hirscher} and {number of matches played/races/starts}",
    "uid": 32008,
    "subgraph": [],
    "template_index": 507,
    "question": "How many matches has Marcel Hirscher played?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q2072 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "How many matches has Marcel Hirscher played?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q2154479 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {participant in} of {Deep Blue}, that has {majority opinion by} is {Cray Blitz} ?",
    "uid": 30381,
    "subgraph": "right-subgraph",
    "template_index": 657,
    "question": "Who else participated in Deep Blue with the majority opinion of Cray Blitz?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q187899 wdt:P1344 ?answer . ?answer wdt:P5826 wd:Q937297}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who else took an interest in Deep Blue with the majority opinion of Cray Blitz?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q187899 wdt:P1344 ?answer . ?answer wdt:P1346 wd:Q937297}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  }
]