[
  {
    "NNQT_question": "What is {field of exercise} of {affiliated with} of {Terje Langli} ?",
    "uid": 17632,
    "subgraph": "left-subgraph",
    "template_index": 5314,
    "question": "What is field of exercise for affiliated with Terje Langli ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q954719 wdt:P1416 ?X . ?X wdt:P452 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q954719> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1416>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P452> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is field of work out for partnered with Terje Langli ?",
    "answers": [
      "loyalty program",
      "coffee",
      "food industry"
    ]
  },
  {
    "NNQT_question": "How many {programmer} are to/by {John Carmack} ?",
    "uid": 1866,
    "subgraph": "statement_property",
    "template_index": 1210,
    "question": "How many programmers work for John Carmack?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P943 wd:Q92605 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P943> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q92605 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Which is the number of programmers that work for John Carmack?",
    "answers": [
      "26"
    ]
  },
  {
    "NNQT_question": "What is {start time} and {place of marriage} of {Juan Manuel Fangio} has {spouse} as {Adèle Foucher}",
    "uid": 32067,
    "subgraph": [],
    "template_index": 530,
    "question": "When and where did Juan Manuel Fangio marry his spouse, Adele Foucher?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q2069 p:P26 ?s . ?s ps:P26 wd:Q2825429 . ?s pq:P580 ?value1 . ?s pq:P2842 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When and the place did Juan Manuel Fangio marry his spouse, Adele Foucher?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q535 p:P26 ?s . ?s ps:P26 wd:Q2825429 . ?s pq:P580 ?value1 . ?s pq:P2842 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {birthplace} of {Chris Rock}, that has {geotag} is {33.45} ?",
    "uid": 13390,
    "subgraph": "right-subgraph",
    "template_index": 372,
    "question": "\"Which birthplace of Chris Rock, has a Geotag of 33.45?\"",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q4109 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'33.45'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q4109> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P625> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <33.45> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "\"Which origin of Chris Shake, contains a Geotag of 33.45?\"",
    "answers": [
      "Andrews",
      "Andrews"
    ]
  },
  {
    "NNQT_question": "Give me {property} that {measured by} {Wechsler Intelligence Scale for Children} and which that starts with {'i'}",
    "uid": 25419,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1240,
    "question": "What what is  property measured by Wechsler Intelligence Scale for Children   which that starts with letters i",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q937228 . ?sbj wdt:P1880 wd:Q1572850 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'i')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q937228>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1880> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1572850>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'i')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "What what is property measured by Wechsler Insights Scale for Children which that begins with letters i",
    "answers": [
      "intelligence"
    ]
  },
  {
    "NNQT_question": "What is {award received} of {I. M. Pei} that is {patronym or matronym for this person} is {2010-01-01} ?",
    "uid": 31306,
    "subgraph": "statement_property",
    "template_index": 20,
    "question": "What award did I.M. Pei receive that is patronym or matronym of 2010?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q46868 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P5056 ?x filter(contains(YEAR(?x),'2010')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which award was presented to I.M.Pei that is patronym or matronym of year 2010?.",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q46868 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2010')) }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {chemical compound} for {polymer of} of {paracetamol}",
    "uid": 31824,
    "subgraph": "simple question right",
    "template_index": 3705,
    "question": "What is the chemical compound of paracetamol?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q57055 wdt:P4600 ?obj . ?obj wdt:P31 wd:Q11173 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "The chemical compound for paracetamol is what?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q146368 wdt:P4600 ?obj . ?obj wdt:P31 wd:Q11173 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {career} of {characters} of {Buffy the Vampire Slayer} ?",
    "uid": 15602,
    "subgraph": "right-subgraph",
    "template_index": 3560,
    "question": "Which career did the character Buffy the Vampire Slayer choose?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q183513 wdt:P674 ?X . ?X wdt:P106 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q183513> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P674>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which career did the character Buffy the Vampire Slayer choose?",
    "answers": [
      "vampire hunter",
      "priest",
      "vampire hunter",
      "school counselor",
      "demon hunter",
      "vampire hunter",
      "private investigator",
      "warrior",
      "fictional mass murderer",
      "demon hunter",
      "fictional businessperson",
      "poet",
      "vampire hunter",
      "warrior",
      "gambler",
      "fictional mass murderer",
      "actor",
      "vampire hunter",
      "private investigator",
      "demon hunter",
      "fictional mass murderer",
      "vampire hunter",
      "demon hunter",
      "librarian",
      "vampire hunter",
      "Watcher",
      "construction worker",
      "vampire hunter",
      "demon hunter",
      "demon hunter",
      "vampire hunter",
      "demon hunter",
      "vampire hunter",
      "demon hunter",
      "vampire hunter",
      "private investigator",
      "Watcher",
      "prostitute",
      "vampire hunter",
      "soldier",
      "demon hunter",
      "singer",
      "dancer"
    ]
  },
  {
    "NNQT_question": "What is {place of death} of {Gediminas}, that has {twinned administrative body} is {Jigme Dorji Wangchuck} ?",
    "uid": 30365,
    "subgraph": "right-subgraph",
    "template_index": 1803,
    "question": "Where is the deathplace of Gediminas, whose twin town is Jigme Dorji Wangchuck?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q244852 wdt:P20 ?answer . ?answer wdt:P190 wd:Q298020}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Where is the deathplace of Gediminas, that has Jigme Dorji Wangchuck as twin town?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q244852 wdt:P20 ?answer . ?answer wdt:P190 wd:Q6576}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {on harbour} of {Kryvyi Rih}, that has {tributary} is {Saksahan} ?",
    "uid": 13156,
    "subgraph": "right-subgraph",
    "template_index": 2761,
    "question": "\"Where is {on harbour} of {Kryvyi Rih}, which has {tributary} is {Saksahan} ?\"",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q157137 wdt:P206 ?answer . ?answer wdt:P974 wd:Q1633893}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q157137> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P206>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P974> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1633893> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "\"Where is {on harbor} of {Kryvyi Rih}, which has {tributary} is {Saksahan} ?\"",
    "answers": [
      "Inhulets River"
    ]
  },
  {
    "NNQT_question": "What is the {end time} for {Don Bradman} has {member of political party} as {Australia national cricket team} ?",
    "uid": 31573,
    "subgraph": "statement_property",
    "template_index": 5679,
    "question": "When Don Bradman ended as member of Australia national cricket team political party?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q313591 p:P102 ?s . ?s ps:P102 wd:Q142555 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Don Bradman step away from the Australia national cricket team political party?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q313591 p:P54 ?s . ?s ps:P54 wd:Q142555 . ?s pq:P582 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {organisms known by a particular common name} that {used by} {snake locomotion} and which contains the word {snake} in their name",
    "uid": 31939,
    "subgraph": "string matching type + relation contains word",
    "template_index": 407,
    "question": "WHICH IS THE GROUP OF ORGANISMS KNOWN BY ONE PARATICULAR COMMON NAME THAT IS USED BY SNAKE LOCOMOTION THAT CONTAINS THE WORD SNAKE IN THEIR NAME",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55983715 . ?sbj wdt:P1535 wd:Q29378923 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'snake')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "WHICH IS THE Gather OF Life forms KNOWN BY ONE PARATICULAR COMMON Title That's USED BY Wind Movement THAT CONTAINS THE WORD Wind IN THEIR NAME",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55983715 . ?sbj wdt:P3512 wd:Q29378923 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'snake')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {end time} for {budō} has {spouse} as {Jacques Damala} ?",
    "uid": 31495,
    "subgraph": "statement_property",
    "template_index": 3821,
    "question": "When did budō and Jacques Damala split up?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q752021 p:P26 ?s . ?s ps:P26 wd:Q6120528 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did budō and Jacques divorce?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q4605 p:P26 ?s . ?s ps:P26 wd:Q6120528 . ?s pq:P582 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {height} and {end time} of {pole vault} has {record held} as {Igor Potapovich}",
    "uid": 32094,
    "subgraph": [],
    "template_index": 585,
    "question": "What is the pole vault height record held by Igor Potapovich and until when was the event?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 wd:Q2330636 . ?s pq:P2048 ?value1 . ?s pq:P582 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the pole vault height record held by way of Igor Potapovich and until when used to be the event?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 wd:Q2330636 . ?s pq:P2048 ?value1 . ?s pq:P276 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {spouse} of {Al Gore} that is {guest of honor} is {1970-01-01} ?",
    "uid": 31300,
    "subgraph": "statement_property",
    "template_index": 171,
    "question": "Who was Al Gore's spouse guest of honor in 1970?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q19673 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P967 ?x filter(contains(YEAR(?x),'1970')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Who was Al Gore wedding guest of honor in 1970?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q19673 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1970')) }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {SpeedSkatingNews.info speed skater ID} of {Titus Livius}",
    "uid": 30904,
    "subgraph": "center",
    "template_index": 3583,
    "question": "What is the SpeedSkatingNews.info speed skater ID for Titus Livius?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q2039 wdt:P3694 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q311289 wdt:P3694 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nominated for} of {Shaolin} that is {nominee} is {Walter Huston} ?",
    "uid": 31426,
    "subgraph": "statement_property",
    "template_index": 2345,
    "question": "For what Walter Huston nominated for Shaolin?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q24515 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q162621 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In what category did Walter Huston get nominated for Shaolin?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q251559 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q162621 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {Revised Hepburn romanization} for {Morning Musume} has {name in kana} as {モーニングむすめ} ?",
    "uid": 7403,
    "subgraph": "statement_property",
    "template_index": 3848,
    "question": "What is the Revised Hepburn romanization for Morning Musume with its name in kana モーニングむすめ?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q174291 p:P1814 ?s . ?s ps:P1814 ?x filter(contains(?x,'モーニングむすめ')) . ?s pq:P2125 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q174291> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1814> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <モーニングむすめ> .\n?statement <http://www.wikidata.org/entity/P2125> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "How do you apply a Revised Hepburn romanization for Morning Musume with its name in kana...",
    "answers": [
      "Mōningu Musume"
    ]
  },
  {
    "NNQT_question": "What is {TORA ID} of {Köpingebro}",
    "uid": 30924,
    "subgraph": "center",
    "template_index": 503,
    "question": "What is TORA ID for Köpingebro ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q176280 wdt:P4820 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q25286 wdt:P4820 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {category for files created with program} {Zuckerart} that contains the word {syrup} in their name",
    "uid": 31160,
    "subgraph": "string matching simple contains word",
    "template_index": 1005,
    "question": "WHICH IS THE ELEMENT WITH THE ZUCKERART CATEGORY FOR FILES CREATED WITH PROGRAM THAT CONTAINS WITH THE WORD SYRUP IN THER NAME",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P7861 wd:Q227790 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'syrup')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "WHICH IS THE ELEMENT WITH THE ZUCKERART CATEGORY FOR FILES CREATED WITH PROGRAM THAT CONTAINS WITH THE WORD SYRUP IN THER NAME",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q227790 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'syrup')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {spouse} of {Larry King} that is {end time} is {1967-0-0} ?",
    "uid": 5640,
    "subgraph": "statement_property",
    "template_index": 2085,
    "question": "Is the end time for the spouse of Larry King 1967-0-0?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q213430 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1967')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q213430> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P582> <1967-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Does 1967-0-0 Is the death date of Larry King wife?",
    "answers": [
      "Mickey Stuphin"
    ]
  },
  {
    "NNQT_question": "What is the {human biblical figure} for {mother} of {Jesus Christ}",
    "uid": 19920,
    "subgraph": "simple question right",
    "template_index": 266,
    "question": "Who is the mother of Jesus Christ",
    "sparql_wikidata": " select distinct ?obj where { wd:Q302 wdt:P25 ?obj . ?obj wdt:P31 wd:Q20643955 } ",
    "sparql_dbpedia18": "select distinct ?obj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q302> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P25> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj . ?obj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q20643955> } ",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the mother of Jesus Christ",
    "answers": [
      "Virgin Mary"
    ]
  },
  {
    "NNQT_question": "Give me {film} that {filming location} {Greensboro} and which that starts with {'s'}",
    "uid": 31917,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1454,
    "question": "Name a film shot in Greensboro that starts with letter S",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11424 . ?sbj wdt:P915 wd:Q49238 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "Title a film shot in Greensboro that begins with letter S",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11424 . ?sbj wdt:P915 wd:Q60 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {pre-Columbian era} that starts with {'u'}",
    "uid": 31184,
    "subgraph": "string matching simple contains word",
    "template_index": 2205,
    "question": "What are the pre-Columbian era which start with the letter s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q202390 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the pre-Columbian eras which begin with the letter s",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28171280 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Edward C. Prescott} that is {closing time} is {2004-01-01} ?",
    "uid": 31301,
    "subgraph": "statement_property",
    "template_index": 5013,
    "question": "What was award did Edward C. Prescott receive with 1-1-2004 as closing time?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q312585 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P8627 ?x filter(contains(YEAR(?x),'2004')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Edward C. Prescott received what award with January 1st, 2004 as closing time?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q312585 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2004')) }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {place of death} of {Wilhelm August Rieder}, that has {shares border with} is {Heiligenstadt} ?",
    "uid": 30456,
    "subgraph": "right-subgraph",
    "template_index": 261,
    "question": "\"Where is {death place} of {Wilhelm August Rieder}, which has {next to} is {Heiligenstadt} ?\"",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q609963 wdt:P20 ?answer . ?answer wdt:P47 wd:Q379531}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "\"Where is {death place} of {Wilhelm August Rieder}, which has {next to} is {Heiligenstadt} ?\"",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q59736 wdt:P20 ?answer . ?answer wdt:P47 wd:Q379531}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {basic form of government} are for {Grenada} ?",
    "uid": 31690,
    "subgraph": "statement_property",
    "template_index": 138,
    "question": "How many basic forms of government are there in Grenada?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q769 wdt:P122 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What are the basic forms of government in Grenada?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q858 wdt:P122 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located in time zone} of {headquarters location} of {Hearst} ?",
    "uid": 30712,
    "subgraph": "right-subgraph",
    "template_index": 409,
    "question": "Tell me the timezone of the main office of the company Hearst",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1065024 wdt:P159 ?X . ?X wdt:P421 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Let me know the timezone of the most office of the company Hearst",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q780442 wdt:P159 ?X . ?X wdt:P421 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {history of topic} and the {geography of topic} of {Melbourne} ?",
    "uid": 9997,
    "subgraph": "two intentions right subgraph",
    "template_index": 141,
    "question": "Which {history of topic} and the {geography of topic} is {Melbourne} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q3141 wdt:P2184 ?ans_1 . wd:Q3141 wdt:P2633 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q3141> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2184> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q3141> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2633> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "{Melbourne} has a {history of topic} and {geography of topic}",
    "answers": [
      "history of Melbourne",
      "geography of Melbourne"
    ]
  },
  {
    "NNQT_question": "What is {age estimated by a dating method} of {Higgs boson}",
    "uid": 30888,
    "subgraph": "center",
    "template_index": 1439,
    "question": "Which is the estimated age of Higgs boson?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q402 wdt:P7584 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q402 wdt:P1123 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {operator} {season} that contains the word {winter} in their name",
    "uid": 31202,
    "subgraph": "string matching simple contains word",
    "template_index": 3904,
    "question": "TELL ME THING HAVING SEASON AS OPERATOR WHOSE NAME HAS THE WORD WINTER IN IT.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P137 wd:Q24384 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'winter')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let Me know OBJECT HAVING SEASON AS OPERATOR WHOSE Title HAS THE WORD WINTER IN IT.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24384 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'winter')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]