[
  {
    "NNQT_question": "What is {father} of {William Jennings Bryan}, that has {occupation} is {male} ?",
    "uid": 30425,
    "subgraph": "right-subgraph",
    "template_index": 2924,
    "question": "Who is the child of William Jennings Bryan that has the occupation of male?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q205282 wdt:P22 ?answer . ?answer wdt:P106 wd:Q6581097}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the baby of William Jennings Bryan that has the occupation of male?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q205282 wdt:P22 ?answer . ?answer wdt:P21 wd:Q6581097}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {position held} of {Barca Hamilcar} that is {instance of} is {statement with Gregorian date earlier than 1584} ?",
    "uid": 31463,
    "subgraph": "statement_property",
    "template_index": 5437,
    "question": "What was the position held by Hamilcar Barca before 1584?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q185101 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P31 wd:Q26961029 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was the position held by Hamil Barca born before 1584?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q185101 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P31 wd:Q26961029 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located on linear feature} of {George Marshall}, that has {winner} is {Mikhail Gorbachev} ?",
    "uid": 30382,
    "subgraph": "right-subgraph",
    "template_index": 2430,
    "question": "What is located on linear feature of George Marshall, which winner is Mikhail Gorbachev?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q151414 wdt:P795 ?answer . ?answer wdt:P1346 wd:Q30487}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is located on linear feature of George Marshall, which champion is Mikhail Gorbachev?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q151414 wdt:P1411 ?answer . ?answer wdt:P1346 wd:Q30487}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {developer} of {proper motion}, that has {has surname} is {Halley} ?",
    "uid": 11891,
    "subgraph": "right-subgraph",
    "template_index": 95,
    "question": "Who proved the theory of Proper Motion? Their surname is Halley.",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q193223 wdt:P61 ?answer . ?answer wdt:P734 wd:Q16870415}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q193223> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P61>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P734> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q16870415> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who proved Proper Motion's theory? Halley is their surname.",
    "answers": [
      "Edmund Halley"
    ]
  },
  {
    "NNQT_question": "Give me {ring system} that starts with {'r'}",
    "uid": 24853,
    "subgraph": "string matching simple contains word",
    "template_index": 3030,
    "question": "What are the ring system  which start with the letter r",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28951811 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q28951811>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the ring systems that begin with alphabet R.",
    "answers": [
      "rings of Jupiter",
      "rings of Saturn",
      "Rings of Rhea",
      "Rings of Earth",
      "Rings of Pluto",
      "rings of Uranus",
      "rings of Neptune"
    ]
  },
  {
    "NNQT_question": "What is {sector} of {software publisher} of {Horticultural classification of tulip cultivars} ?",
    "uid": 16525,
    "subgraph": "left-subgraph",
    "template_index": 9,
    "question": "Which is the sector of the software publisher for Horticultural classification of tulip cultivars?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q18402072 wdt:P123 ?X . ?X wdt:P452 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q18402072> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P123>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P452> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which is the division of the program distributer for Agricultural classification of tulip cultivars?",
    "answers": [
      "floriculture"
    ]
  },
  {
    "NNQT_question": "What is the {Catholic order} for {semi-major axis of an orbit} of {Ignatius of Loyola}",
    "uid": 31810,
    "subgraph": "simple question right",
    "template_index": 2014,
    "question": "Ignatius of Loyola is a semi-major axis of which Catholic order?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q44281 wdt:P2233 ?obj . ?obj wdt:P31 wd:Q391009 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Ignatius of Loyola is a semi-major axis of which Catholic arrange?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q44281 wdt:P611 ?obj . ?obj wdt:P31 wd:Q391009 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {employer} are for {Edward Snowden} ?",
    "uid": 1086,
    "subgraph": "statement_property",
    "template_index": 86,
    "question": "How many employers are there for Edward Snowden?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q13424289 wdt:P108 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q13424289> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P108> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Edward Snowden worked for what number of employers?",
    "answers": [
      "6"
    ]
  },
  {
    "NNQT_question": "What is {member count} of {member of political party} of {Pedro Aguirre Cerda} ?",
    "uid": 30618,
    "subgraph": "right-subgraph",
    "template_index": 55,
    "question": "Which is the membership as a member party of Pedro Aguirre Cerda?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q845 wdt:P102 ?X . ?X wdt:P2124 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is the participation as a part party of Pedro Aguirre Cerda",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q57418 wdt:P102 ?X . ?X wdt:P2124 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {taxonomic rank} for {instance of} of {Balaenoptera musculus}",
    "uid": 31895,
    "subgraph": "simple question right",
    "template_index": 788,
    "question": "What is the taxonomic rank instance of the blue whale?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q42196 wdt:P31 ?obj . ?obj wdt:P31 wd:Q427626 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Title the taxonomic rank class of the blue whale.",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q42196 wdt:P105 ?obj . ?obj wdt:P31 wd:Q427626 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {treaty} that starts with {'t'}",
    "uid": 24280,
    "subgraph": "string matching simple contains word",
    "template_index": 2296,
    "question": "What are the treaty which start with the letter t",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131569 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q131569>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the arrangement which begin with the letter t",
    "answers": [
      "Treaty on the functioning of the European Union",
      "Treaty of New Echota",
      "Treaty of Hünkâr İskelesi",
      "Treaty of Nettuno",
      "Treaty of Dappes",
      "Treaty of Tientsin",
      "Treaty of Montevideo",
      "Treaty of Accession 2005",
      "Treaty of The Hague",
      "Treaty of Kalisz",
      "Treaty of Rapallo",
      "Treaty of Meerssen",
      "Treaty of Nagyvárad",
      "Treaty of London",
      "Treaty of Aigun",
      "Treaty of Paris",
      "Treaty of Hadiach",
      "Treaty of Moscow",
      "Treaty of 1818",
      "Treaty of Wedmore",
      "Treaty of Rastatt",
      "Treaty of friendship and alliance between the Government of Mongolia and Tibet",
      "Treaty of London",
      "Treaty of Petrópolis",
      "Treaty of Berlin"
    ]
  },
  {
    "NNQT_question": "What is the {of} for {Harley Quinn} has {present in work} as {Jacqui Verdura} ?",
    "uid": 31651,
    "subgraph": "statement_property",
    "template_index": 1516,
    "question": "In what film did Jacqui Verdura play in Harley Quinn?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q849477 p:P1441 ?s . ?s ps:P1441 wd:Q33228927 . ?s pq:P642 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Jacqui Verdura played in Harley Quinn in what movie?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q849477 p:P175 ?s . ?s ps:P175 wd:Q33228927 . ?s pq:P642 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of sports team} of {Ella Fitzgerald} and {number of matches played/races/starts}",
    "uid": 32013,
    "subgraph": [],
    "template_index": 1154,
    "question": "Tell me about member of sports team of Ella Fitzgerald and number of matches played?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q1768 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Tell me about Ella Fitzgerald's sports team member and how many matches have been played?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q219354 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {burial plot reference} for {Bjørnstjerne Bjørnson} has {place of burial} as {Vår Frelsers gravlund} ?",
    "uid": 9067,
    "subgraph": "statement_property",
    "template_index": 5512,
    "question": "Where is Bjørnstjerne Bjørnson's burial plot in Vår Frelsers gravlund?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q46405 p:P119 ?s . ?s ps:P119 wd:Q1069938 . ?s pq:P965 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q46405> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P119> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1069938> .\n?statement <http://www.wikidata.org/entity/P965> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "In Var Freslers gravlund where is Bjornstjerne Bjornson buried?",
    "answers": [
      "12290"
    ]
  },
  {
    "NNQT_question": "What is {replaced synonym} of {based on} of {smoothsort} ?",
    "uid": 30574,
    "subgraph": "left-subgraph",
    "template_index": 6,
    "question": "what is the using of the replaced synonym of smoothsort?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1714823 wdt:P144 ?X . ?X wdt:P694 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "what is the utilizing of the replaced synonym of smoothsort?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1714823 wdt:P144 ?X . ?X wdt:P2283 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {mythical character} that contains the word {zau} in their name",
    "uid": 23457,
    "subgraph": "string matching simple contains word",
    "template_index": 3060,
    "question": "What mythical character that contains the word zau in their name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4271324 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zau')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q4271324>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zau')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What legendary character that contains the word zau in their name",
    "answers": [
      "Zau"
    ]
  },
  {
    "NNQT_question": "What is {winner} of {nominated for} of {Hermann Maier} ?",
    "uid": 30711,
    "subgraph": "left-subgraph",
    "template_index": 127,
    "question": "Who gave the {titleholder} of {nomination received} of {Hermann Maier} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1956 wdt:P1411 ?X . ?X wdt:P1346 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who gave the {titleholder} of {assignment gotten} of {Hermann Maier} ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q11680 wdt:P1411 ?X . ?X wdt:P1346 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {electoral district number} are to/by {computer keyboard} ?",
    "uid": 31732,
    "subgraph": "statement_property",
    "template_index": 1503,
    "question": "How many electoral district numbers are on a computer keyboard?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P4565 wd:Q250 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "A computer keyboard has how many electoral district numbers?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P479 wd:Q250 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {military rank} are to/by {Oberstabsfeldwebel} ?",
    "uid": 31742,
    "subgraph": "statement_property",
    "template_index": 1762,
    "question": "What is the military rank of the Oberstabsfeldwebel?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P410 wd:Q2011009 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "For the Oberstabsfeldwebel, what is the military rank?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P410 wd:Q104680 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of sports team} of {Pedro Aguirre Cerda} and {number of matches played/races/starts}",
    "uid": 32031,
    "subgraph": [],
    "template_index": 763,
    "question": "Of what sports team is Pedro Aguirre Cerda a member and how many matches has he played?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q845 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Of what sports group is Pedro Aguirre Cerda a part and how numerous matches has he played?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q187198 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Kliment Voroshilov} that is {end time} is {1948-06-24} ?",
    "uid": 31454,
    "subgraph": "statement_property",
    "template_index": 3831,
    "question": "Until June 24th of 1948 what award did Kliment Voroshilov received?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q186185 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1948')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Name the award received by Kliment Voroshilov until June 24, 1948.",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q186185 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1948')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {birthdate} of {kids} of {Teodoro Obiang Nguema Mbasogo} ?",
    "uid": 15178,
    "subgraph": "right-subgraph",
    "template_index": 458,
    "question": "On what day were the children of Teodoro Obiang Nguema Mbasogo born?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q57385 wdt:P40 ?X . ?X wdt:P569 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q57385> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P40>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P569> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When are the birth dates of the kids of Teoforo Obiang Nguema Mbasogo?",
    "answers": [
      "1968-06-25T00:00:00Z",
      "1969-06-25T00:00:00Z",
      "1972-01-01T00:00:00Z",
      "1975-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "How many {base} are to/by {quadrilateral} ?",
    "uid": 2061,
    "subgraph": "statement_property",
    "template_index": 1405,
    "question": "How many bases does a quadrilateral have?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3263 wd:Q36810 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3263> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q36810 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Bases in a quadrilateral?",
    "answers": [
      "7"
    ]
  },
  {
    "NNQT_question": "What is {ICAO airline designator} of {The Walt Disney Company}",
    "uid": 30949,
    "subgraph": "center",
    "template_index": 1698,
    "question": "What is the ICAO airline designator of The Walt Disney Company?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q7414 wdt:P230 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q7414 wdt:P3115 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located on astronomical body} of {depicts} of {The Scream} ?",
    "uid": 30647,
    "subgraph": "right-subgraph",
    "template_index": 163,
    "question": "What is located on astronomical body in the landscape of The Scream?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q471379 wdt:P180 ?X . ?X wdt:P376 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is found on astronomical body within the scene of The Shout?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q471379 wdt:P180 ?X . ?X wdt:P131 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {colonial power} for {has facility} of {Lisbon}",
    "uid": 31843,
    "subgraph": "simple question right",
    "template_index": 3661,
    "question": "Which colonial power has a facility in Lisbon?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q597 wdt:P912 ?obj . ?obj wdt:P31 wd:Q20181813 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which colonial control owns a facility in Lisbon?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q597 wdt:P17 ?obj . ?obj wdt:P31 wd:Q20181813 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {public company} for {manufacturer} of {Coca-Cola}",
    "uid": 30298,
    "subgraph": "simple question left",
    "template_index": 3400,
    "question": "Which is the public company that is the manufacturer of Coca-Cola?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P176 wd:Q2813 . ?sbj wdt:P31 wd:Q891723 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is the public company that produces Coca-Cola?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1056 wd:Q2813 . ?sbj wdt:P31 wd:Q891723 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {mother} and {date of death} of {Pedro I of Brazil} has {temple name} as {Princess Januária of Brazil}",
    "uid": 32057,
    "subgraph": [],
    "template_index": 782,
    "question": "When did Pedro I's temple name Princess Januária of Brazil die, and who was her mother?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q939 p:P1785 ?s . ?s ps:P1785 wd:Q261802 . ?s pq:P25 ?value1 . ?s pq:P570 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When did the temple name of Pedro I, the Princess Januária of Brazil, die and who was her mom?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q261802 . ?s pq:P25 ?value1 . ?s pq:P570 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {chairperson} of {political coalition} of {Popular Unity} ?",
    "uid": 30729,
    "subgraph": "left-subgraph",
    "template_index": 3,
    "question": "Who is {chairperson} and {political coalition} {Popular Unity} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q21957427 wdt:P5832 ?X . ?X wdt:P488 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is { chairperson } and { political coalition } member?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q21957427 wdt:P463 ?X . ?X wdt:P488 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {World Waterfall Database ID} of {Oka River}, that has {coordinate location} is {37.0012} ?",
    "uid": 30434,
    "subgraph": "right-subgraph",
    "template_index": 9205,
    "question": "What World Waterfall Database ID of the Oka River can be found at the GPS location of 37.0012?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q172089 wdt:P3326 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'37.0012'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which Oka River World Waterfall Database ID can be found at the 37.0012 GPS location?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q172089 wdt:P974 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'37.0012'))}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located on terrain feature} of {Tangier}",
    "uid": 30828,
    "subgraph": "center",
    "template_index": 3392,
    "question": "What is located on terrain feature of Tangier?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q126148 wdt:P706 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q37319 wdt:P706 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {CBS municipality code} of {P. B. S. Pinchback}",
    "uid": 30846,
    "subgraph": "center",
    "template_index": 1897,
    "question": "What is the CBS municipality code of P. B. S. Pinchback?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q887930 wdt:P382 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q47887 wdt:P382 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {contains administrative territorial entity} of {place of death} of {Aleksandr Porkhomovskiy} ?",
    "uid": 30716,
    "subgraph": "right-subgraph",
    "template_index": 92,
    "question": "Who gave the  {has states} of {deathplace} of {Aleksandr Porkhomovskiy} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q180157 wdt:P20 ?X . ?X wdt:P150 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Aleksandr Porkhomovskiy's deathplace was authorized by who?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q2366448 wdt:P20 ?X . ?X wdt:P150 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Andrei Mironov} has {stepparent} as {Yekaterina Gradova} ?",
    "uid": 31578,
    "subgraph": "statement_property",
    "template_index": 1878,
    "question": "When did Yekaterina Gradova become stepparent of Andrei Mironov?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q469550 p:P3448 ?s . ?s ps:P3448 wd:Q4147409 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Yekaterina Gradova become Andrei Mironov stepmother?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q469550 p:P26 ?s . ?s ps:P26 wd:Q4147409 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]