[
  {
    "NNQT_question": "Give me {national sports team} that starts with {'t'}",
    "uid": 24388,
    "subgraph": "string matching simple contains word",
    "template_index": 485,
    "question": "What are the national sports team  which start with the letter t",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1194951 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1194951>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the national sports group which begin with the letter t",
    "answers": [
      "Thailand national baseball team",
      "Turkey men's national ice hockey team",
      "Tuvalu national futsal team",
      "Turkey men's national basketball team",
      "Turkey national futsal team",
      "Thailand national rugby union team",
      "Tunisia national rugby union team",
      "Tahiti national rugby union team",
      "Trinidad and Tobago national basketball team",
      "Tuvalu national basketball team",
      "Tahiti national basketball team",
      "Turkey national cricket team",
      "Turkey national rugby union team",
      "Trinidad and Tobago Fed Cup team",
      "Tunisia Fed Cup team",
      "Thailand men's national volleyball team",
      "Turkey women's national water polo team",
      "Thailand national under-20 futsal team",
      "Tunisian handball team at the 2016 Summer Olympics",
      "Thailand men's national field hockey team",
      "Turkey women's national under-18 volleyball team",
      "Turkey men's national goalball team",
      "Tajikistan national cricket team",
      "Thailand national basketball team",
      "Thailand men's national under-23 volleyball team"
    ]
  },
  {
    "NNQT_question": "What is {population} of {Corsica} that is {point in time} is {2005-01-01} ?",
    "uid": 31344,
    "subgraph": "statement_property",
    "template_index": 2902,
    "question": "How much was the population of Corsica in 2005?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q14112 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2005')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "How many people lived in Corsica in 2005?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q18677875 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2005')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {fictional profession} for {different from} of {superhero}",
    "uid": 30299,
    "subgraph": "simple question left",
    "template_index": 28,
    "question": "What is the fictional profession different from a superhero?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1889 wd:Q188784 . ?sbj wdt:P31 wd:Q17305127 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who is different from a superhero?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P461 wd:Q188784 . ?sbj wdt:P31 wd:Q17305127 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {point in time} for {Betty White} has {award received} as {Daytime Emmy Award for Outstanding Game Show Host} ?",
    "uid": 4265,
    "subgraph": "statement_property",
    "template_index": 710,
    "question": "When did Betty White win the Daytime Emmy Award for Outstanding Game Show Host?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q373895 p:P166 ?s . ?s ps:P166 wd:Q5243447 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q373895> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q5243447> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Betty White won the Daytime Emmy Award for Outstanding Game Show Host, but when was it?",
    "answers": [
      "1983-06-06T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {place of birth} of {Clement I} that is {country} is {Bosporan Kingdom} ?",
    "uid": 31458,
    "subgraph": "statement_property",
    "template_index": 4007,
    "question": "Where Clement I was born at Bosporan Kingdom?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q42887 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P17 wd:Q321371 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Give the birth location in Bosporan Kingdom of Clement I.",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q42887 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q321371 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {musical instrument} of {lyricist} of {Face to the Sky} ?",
    "uid": 17691,
    "subgraph": "left-subgraph",
    "template_index": 4183,
    "question": "Name the musical instrument used in song Face to the Sky song",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q14951082 wdt:P676 ?X . ?X wdt:P1303 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q14951082> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P676>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1303> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Title the melodic instrument utilized in tune Confront to the Sky song",
    "answers": [
      "organ",
      "piano",
      "guitar",
      "voice",
      "acoustic guitar",
      "bass guitar",
      "keyboard instrument",
      "baritone guitar",
      "electric guitar",
      "viola",
      "harpsichord",
      "Hammond organ",
      "percussion instrument",
      "synthesizer",
      "xylophone",
      "triangle",
      "mellotron",
      "harmonium",
      "marimba",
      "sampler",
      "celesta",
      "sarinda",
      "glockenspiel",
      "drum machine",
      "jingle bell",
      "cabasa",
      "clavinet",
      "electric piano",
      "electronic keyboard",
      "electric viola",
      "church organ"
    ]
  },
  {
    "NNQT_question": "Give me {subculture} that starts with {'t'}",
    "uid": 24584,
    "subgraph": "string matching simple contains word",
    "template_index": 267,
    "question": "What are the subculture which start with the letter t",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q264965 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q264965>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the subculture which begin with the letter t",
    "answers": [
      "tulpamancy",
      "Thrasher",
      "Therianthropes",
      "Tiki culture"
    ]
  },
  {
    "NNQT_question": "What is {has edition or translation} of {platform} of {Louis XV of France} ?",
    "uid": 30510,
    "subgraph": "right-subgraph",
    "template_index": 846,
    "question": "What is edition runtime for Louis XV of France?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7738 wdt:P400 ?X . ?X wdt:P747 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the Louis XV of France runtime edition?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q223341 wdt:P400 ?X . ?X wdt:P747 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Photographers' Identities Catalog ID} of {Mikhail Botvinnik}",
    "uid": 30965,
    "subgraph": "center",
    "template_index": 677,
    "question": "What is Mikhail Botvinnik's Photographers' Identities Catalog ID?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q178865 wdt:P2750 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q178865 wdt:P3867 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {has effect} of {start period} of {hypothetical protein lpg2828} ?",
    "uid": 30550,
    "subgraph": "left-subgraph",
    "template_index": 217,
    "question": "What was the result found in the start period of hypothetical protein ipg2828?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q22333459 wdt:P3415 ?X . ?X wdt:P1542 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What was the result found within the start period of theoretical protein ipg2828?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q22333459 wdt:P703 ?X . ?X wdt:P1542 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {codename} of {Unslung}",
    "uid": 30926,
    "subgraph": "center",
    "template_index": 1503,
    "question": "What is the project codename for Unslung?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q4006074 wdt:P1638 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q18168774 wdt:P1638 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {bibliography} of {PhD advisor} of {Karl Herzfeld} ?",
    "uid": 14567,
    "subgraph": "left-subgraph",
    "template_index": 29,
    "question": "What is the bibliography of the  PhD advisor to Karl Herzfeld?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q84763 wdt:P184 ?X . ?X wdt:P800 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q84763> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P184>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P800> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the bibliography of the PhD guide to Karl Herzfeld?",
    "answers": [
      "fine-structure constant",
      "Bohr-Sommerfeld atom model",
      "Sommerfeld identity",
      "Sommerfeld radiation condition",
      "Sommerfeld–Kossel displacement law",
      "Sommerfeld number",
      "Orr–Sommerfeld equation",
      "Lectures on Theoretical Physics",
      "black body"
    ]
  },
  {
    "NNQT_question": "Give me {strength sport} that contains the word {weightlifting} in their name",
    "uid": 31235,
    "subgraph": "string matching simple contains word",
    "template_index": 517,
    "question": "What are the strength sport which start with the letter weightlifting",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q337979 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'weightlifting')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the strength sport which start with the letter weightlifting",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q212434 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'weightlifting')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {for work} for {Patrick White} has {award received} as {Women's Prize for Fiction} ?",
    "uid": 31562,
    "subgraph": "statement_property",
    "template_index": 4664,
    "question": "For which work Patrick White received the Women's Prize for Fiction?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q129187 p:P166 ?s . ?s ps:P166 wd:Q18884 . ?s pq:P1686 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Patrick White received the Women's Prize for Fiction, which work did he receive it for?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q129187 p:P166 ?s . ?s ps:P166 wd:Q996 . ?s pq:P1686 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {contains administrative territorial entity} of {ancestral home} of {Pan Yue} ?",
    "uid": 30746,
    "subgraph": "left-subgraph",
    "template_index": 566,
    "question": "What administrative territorial entity was Pan Yue born in?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q6464972 wdt:P66 ?X . ?X wdt:P150 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What territorial entity was Skillet Yue born in?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q6464972 wdt:P19 ?X . ?X wdt:P150 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {relative} of {Joseph Conrad}",
    "uid": 21466,
    "subgraph": "simple question left",
    "template_index": 1812,
    "question": "Who is the {human} for {relative} of {Joseph Conrad}",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1038 wd:Q82925 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "select distinct ?subj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?subj . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1038> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q82925> . ?subj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q5> } ",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who is the { human } for Joseph Conrad's { relative }",
    "answers": [
      "Tadeusz Bobrowski",
      "Stefan Bobrowski",
      "Aniela Zagórska"
    ]
  },
  {
    "NNQT_question": "How many {lakes on river} are to/by {Ion Iliescu} ?",
    "uid": 31721,
    "subgraph": "statement_property",
    "template_index": 1484,
    "question": "How many rivers and lakes are connected to Ion Iliescu?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P469 wd:Q189575 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Can you tell me the amount of lakes are rivers attached to Ion Iliescu?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P469 wd:Q199551 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Dialnet author ID} of {Björn Otto}",
    "uid": 30907,
    "subgraph": "center",
    "template_index": 1745,
    "question": "What is Björn Otto's Dialnet author ID?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1743 wdt:P1607 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q154545 wdt:P1607 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {magnetic moment} of {tau}",
    "uid": 30919,
    "subgraph": "center",
    "template_index": 1830,
    "question": "what is magnetic moment for tau?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q188392 wdt:P2069 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q2225 wdt:P2069 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Chinese character} with the {MAX(homograph lexeme)} ?",
    "uid": 31086,
    "subgraph": "rank",
    "template_index": 133,
    "question": "Which Chinese character has the highest homograph lexeme?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q53764738 . ?ent wdt:P5402 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "Which Chinese personality has the highest homograph lexeme?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q53764738 . ?ent wdt:P5205 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {time period} are to/by {Hellenistic period} ?",
    "uid": 2393,
    "subgraph": "statement_property",
    "template_index": 1737,
    "question": "What is the period of time of the  {Hellenistic period} ?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2348 wd:Q428995 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2348> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q428995 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "The Hellenistic period is from what time period?",
    "answers": [
      "850"
    ]
  },
  {
    "NNQT_question": "What is {favorite player} of {writer} of {Think Like a Freak} ?",
    "uid": 14716,
    "subgraph": "left-subgraph",
    "template_index": 38,
    "question": "who favorite player of writer of think like a freak ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q18786735 wdt:P50 ?X . ?X wdt:P737 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q18786735> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P50>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P737> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "who favorite player of author of think like a crack ?",
    "answers": [
      "Gary Becker"
    ]
  },
  {
    "NNQT_question": "What is {stock exchange} of {Tencent} that is {ticker symbol} is {0700} ?",
    "uid": 7338,
    "subgraph": "statement_property",
    "template_index": 3783,
    "question": "What is the stock exchange for the ticker symbol 0700 in Tencent?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q860580 p:P414 ?s . ?s ps:P414 ?obj . ?s pq:P249 ?x filter(contains(?x,'0700')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q860580> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P414> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P249> <0700>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What is the the symbol for stock 0700 in Tencent?",
    "answers": [
      "Hong Kong Stock Exchange"
    ]
  },
  {
    "NNQT_question": "Give me {lost literary work} that {editor} {National Constituent Assembly} and which contains the word {citizen} in their name",
    "uid": 31915,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3511,
    "question": "What is the lost literary work published by the National Constituent Assembly that contains the word \"citizen\" in its name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1585442 . ?sbj wdt:P98 wd:Q876424 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'citizen')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What is the lost literary work distributed by the National Constituent Get together that contains the word \"citizen\" in its name",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q49848 . ?sbj wdt:P98 wd:Q876424 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'citizen')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {preserved county of Wales} for {enclave within} of {Leicester}",
    "uid": 31819,
    "subgraph": "simple question right",
    "template_index": 3249,
    "question": "What preserved counties of Wales are enclaves of Leicester?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q83065 wdt:P501 ?obj . ?obj wdt:P31 wd:Q630638 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Talking about the preserved counties of Wales, which of them are enclaves of Leicester?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q83065 wdt:P501 ?obj . ?obj wdt:P31 wd:Q180673 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {subject has role} of {prescription drug}",
    "uid": 30812,
    "subgraph": "center",
    "template_index": 3722,
    "question": "What is that has the role of prescription drug?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P2868 wd:Q1643563}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P3493 wd:Q1643563}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {inhabitants} of {death location} of {Alexander Fleming} ?",
    "uid": 15073,
    "subgraph": "right-subgraph",
    "template_index": 1703,
    "question": "What are the inhabitants of the location where Alexander Fleming died?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q37064 wdt:P20 ?X . ?X wdt:P1082 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q37064> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "In the location where Alexander Fleming died, who are the inhabitants?",
    "answers": [
      "8908081"
    ]
  },
  {
    "NNQT_question": "What is {native language} of {Vantaa} that is {object has role} is {minority language} ?",
    "uid": 31380,
    "subgraph": "statement_property",
    "template_index": 1589,
    "question": "What is the native language of Vantaa?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q127623 p:P103 ?s . ?s ps:P103 ?obj . ?s pq:P3831 wd:Q61566 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What is Vantaa's native language?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q127623 p:P37 ?s . ?s ps:P37 ?obj . ?s pq:P3831 wd:Q61566 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {reliquary} that starts with {'y'}",
    "uid": 31180,
    "subgraph": "string matching simple contains word",
    "template_index": 539,
    "question": "what are the reliquary which start with the letter y",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q722604 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "what are the reliquaries which begin with the letter y",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3305213 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {number of speakers} of {ICD-9-CM} of {Kingdom of England} ?",
    "uid": 30565,
    "subgraph": "right-subgraph",
    "template_index": 525,
    "question": "What are the speakers of the ICD-9-CM of the Kingdom of England?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q179876 wdt:P1692 ?X . ?X wdt:P1098 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What ICD-9-CM are spoken in the United Kingdom?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q179876 wdt:P2936 ?X . ?X wdt:P1098 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {statement is subject of} for {Mercedes Ruehl} has {key press} as {Academy Award for Best Supporting Actress} ?",
    "uid": 31526,
    "subgraph": "statement_property",
    "template_index": 5910,
    "question": "What Academy Award subject is Mercedes Ruehl key press as Best Supporting Actress?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q232933 p:P4998 ?s . ?s ps:P4998 wd:Q106301 . ?s pq:P805 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "As Best Supporting Actress, what Academy Award subject is Mercedes Ruehl key press?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q232933 p:P1411 ?s . ?s ps:P1411 wd:Q106301 . ?s pq:P805 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {student} of {discoverer or inventor} of {Simon the Zealot} ?",
    "uid": 30499,
    "subgraph": "right-subgraph",
    "template_index": 892,
    "question": "Who is the student that coined the Simon the Zealot?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q12871 wdt:P61 ?X . ?X wdt:P802 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who is the understudy that coined the Simon the Zealot?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q875744 wdt:P61 ?X . ?X wdt:P802 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {develops from} of {flower}",
    "uid": 31007,
    "subgraph": "center",
    "template_index": 3309,
    "question": "What is developed from flower?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q506 wdt:P3094 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q1364 wdt:P3094 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]