[
  {
    "NNQT_question": "What is {material used} of {facet of} of {tea house} ?",
    "uid": 30745,
    "subgraph": "right-subgraph",
    "template_index": 2,
    "question": "What material is the tea house made of according to the creator?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1072166 wdt:P1269 ?X . ?X wdt:P186 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "According to the creator tea house is made of which material?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1072166 wdt:P1056 ?X . ?X wdt:P186 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {short film} for {voice actor} of {Tom Hanks}",
    "uid": 30273,
    "subgraph": "simple question left",
    "template_index": 2983,
    "question": "Tom Hanks voiced which short film ?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P725 wd:Q2263 . ?sbj wdt:P31 wd:Q24862 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the short film voiced by Tom Hanks",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P725 wd:Q2263 . ?sbj wdt:P31 wd:Q229390 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {manifestation of} of {Christmas tree}, that has {day in year for periodic occurrence} is {Franklin Pierce} ?",
    "uid": 30367,
    "subgraph": "right-subgraph",
    "template_index": 73,
    "question": "What appearance of a Christmas tree happens every Franklin Pierce?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q47128 wdt:P1557 ?answer . ?answer wdt:P837 wd:Q12312}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What appearance of a Christmas tree happens each Franklin Pierce?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q47128 wdt:P1557 ?answer . ?answer wdt:P837 wd:Q2266}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Q48460} of {is the antonym of} of {virtue} ?",
    "uid": 14994,
    "subgraph": "right-subgraph",
    "template_index": 12,
    "question": "What is Q48460 of  the antonym  of virtue ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q157811 wdt:P461 ?X . ?X wdt:P1036 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q157811> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P461>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1036> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is Q48460 of the antonym of ideals ?",
    "answers": [
      "179.8"
    ]
  },
  {
    "NNQT_question": "What is {tenant} of {Windsor Castle}, that has {employment} is {postage stamp designer} ?",
    "uid": 12446,
    "subgraph": "right-subgraph",
    "template_index": 2556,
    "question": "\"Who is {tenant} of {Windsor Castle}, that has {employment} as {postage stamp designer} ?\"",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q42646 wdt:P466 ?answer . ?answer wdt:P106 wd:Q2000124}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q42646> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P466>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2000124> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "\"Who is inhabitant of Windsor Castle , that has work as postage stamp planner ?\"",
    "answers": [
      "George V"
    ]
  },
  {
    "NNQT_question": "How many {subsidiary} are for {John Jellicoe, 1st Earl Jellicoe} ?",
    "uid": 31684,
    "subgraph": "statement_property",
    "template_index": 36,
    "question": "How many subsidiaries does John Jellicoe , 1st Earl Jellicoe have?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q335028 wdt:P355 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "John Jellicoe has how many subsidiaries?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q335028 wdt:P5096 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {economic sector} that contains the word {service} in their name",
    "uid": 23882,
    "subgraph": "string matching simple contains word",
    "template_index": 2048,
    "question": "Tell me economic sector whose name has the word service in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3958441 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'service')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3958441>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'service')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know financial division whose title has the word benefit in it.",
    "answers": [
      "service sector"
    ]
  },
  {
    "NNQT_question": "What is the {court} and the {applies to jurisdiction} of {Roe_v._Wade} ?",
    "uid": 9497,
    "subgraph": "two intentions right subgraph",
    "template_index": 583,
    "question": "What is the court and application of jurisdiction of Roe v. Wade?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q300950 wdt:P4884 ?ans_1 . wd:Q300950 wdt:P1001 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q300950> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P4884> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q300950> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1001> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Which court did Roe v. Wade?",
    "answers": [
      "Supreme Court of the United States",
      "United States of America"
    ]
  },
  {
    "NNQT_question": "What is {is in the region of} of {Paroo River}, that has {divides into} is {Ku-ring-gai Council} ?",
    "uid": 12780,
    "subgraph": "right-subgraph",
    "template_index": 2020,
    "question": "What is in the region of Paroo River, that divides into Ku-ring-gai Council?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1628056 wdt:P131 ?answer . ?answer wdt:P150 wd:Q133642}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1628056> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P131>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P150> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q133642> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is within the locale of Paroo Stream, that isolates into Ku-ring-gai Committee?",
    "answers": [
      "New South Wales"
    ]
  },
  {
    "NNQT_question": "How many {postsynaptic connection} are for {Antonio José de Sucre} ?",
    "uid": 31686,
    "subgraph": "statement_property",
    "template_index": 482,
    "question": "How many postsynaptic connections are built by Antonio José de Sucre Farell?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q189779 wdt:P926 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Antionio Jose De Sucre Farell built how many postsynaptic connection?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q189779 wdt:P27 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {part of the series} of {Zauberschloß} and {followed by}",
    "uid": 32028,
    "subgraph": [],
    "template_index": 810,
    "question": "What series is Zauberschloß followed by?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q148474 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P156 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What arrangement is Zauberschloß taken after by?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q131007 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P156 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {flag} are to/by {coat of arms} ?",
    "uid": 31769,
    "subgraph": "statement_property",
    "template_index": 1120,
    "question": "how many hold the flag?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P163 wd:Q14659 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "The flag is held by how many?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P237 wd:Q14659 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {mother} of {child} of {Stephen Humphrey Bogart} ?",
    "uid": 30696,
    "subgraph": "left-subgraph",
    "template_index": 713,
    "question": "Who is {mother} of {kids} of {Stephen Humphrey Bogart} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2344560 wdt:P40 ?X . ?X wdt:P25 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is {mother} of {kids} of {Stephen Humphrey Bogart} ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q296630 wdt:P40 ?X . ?X wdt:P25 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Tokushima} for {discography} of {Jerry Lee Lewis}",
    "uid": 31775,
    "subgraph": "simple question right",
    "template_index": 2191,
    "question": "What is the complete list of Tokushima discography released by Jerry Lee Lewis?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q202729 wdt:P358 ?obj . ?obj wdt:P31 wd:Q207309 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the total list of Tokushima records discharged by Jerry Lee Lewis?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q202729 wdt:P358 ?obj . ?obj wdt:P31 wd:Q273057 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {taxon} for {taxon rank} of {Durio}",
    "uid": 31848,
    "subgraph": "simple question right",
    "template_index": 1789,
    "question": "What taxon is the taxon rank of Durio",
    "sparql_wikidata": " select distinct ?obj where { wd:Q2309085 wdt:P105 ?obj . ?obj wdt:P31 wd:Q16521 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the taxon rank of Durio",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q2309085 wdt:P427 ?obj . ?obj wdt:P31 wd:Q16521 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {host} of {sports season of league or competition} of {hypothetical protein Mb0514} ?",
    "uid": 30637,
    "subgraph": "left-subgraph",
    "template_index": 23960,
    "question": "What sports season of league or competition was found to be the host of the hypothetical protein Mb0514?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q23257938 wdt:P3450 ?X . ?X wdt:P2975 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which sports season of league or competition are the host of the hypothetical Mb0514 protein?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q23257938 wdt:P703 ?X . ?X wdt:P2975 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Douglas Adams} and {point in time}",
    "uid": 32029,
    "subgraph": [],
    "template_index": 947,
    "question": "When and what was the award received by Douglas Adams?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q42 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "When and what was the honor gotten by Douglas Adams?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q82248 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {publisher} of {Mongolia} and {place of publication}",
    "uid": 31990,
    "subgraph": [],
    "template_index": 977,
    "question": "When did publisher of Mongolia and place of publication?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q711 p:P123 ?s . ?s ps:P123 ?obj . ?s pq:P291 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "When did distributer of Mongolia and put of publication?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q173626 p:P123 ?s . ?s ps:P123 ?obj . ?s pq:P291 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {ship} with the {MIN(payload mass)} whose {manufacturer} is {Aperam South America} ?",
    "uid": 31110,
    "subgraph": "rank",
    "template_index": 671,
    "question": "What is the ship with the lowest payload mass whose manufacturer is Aperam South America?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q11446 . ?ent wdt:P4519 ?obj . ?ent wdt:P176 wd:Q138799} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Which ship made by Aperam South America has the lowest payload mass?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q11446 . ?ent wdt:P4519 ?obj . ?ent wdt:P176 wd:Q16606610} ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {GeneReviews ID} of {James Callaghan}",
    "uid": 30850,
    "subgraph": "center",
    "template_index": 2724,
    "question": "Which is the GeneReviews ID for James Callaghan?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q9576 wdt:P668 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q11081 wdt:P668 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {agent} of {in conflict} of {Hosni Mubarak} ?",
    "uid": 15159,
    "subgraph": "left-subgraph",
    "template_index": 307,
    "question": "What government was in charge of Hosni Mubarak's sentence?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q34105 wdt:P607 ?X . ?X wdt:P710 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q34105> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P607>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P710> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What government was responsible for the sentence of Hosni Mubarak?",
    "answers": [
      "United States of America",
      "France",
      "United Kingdom",
      "Kuwait",
      "Saudi Arabia",
      "Saddam Hussein",
      "Margaret Thatcher",
      "John Major",
      "George H. W. Bush",
      "Jaber al-Ahmad al-Sabah",
      "Ba'athist Iraq",
      "Egypt",
      "Iraq",
      "Israel",
      "Jordan",
      "Lebanon",
      "Syria",
      "United States of America",
      "Egypt",
      "Israel",
      "Syria",
      "Palestine Liberation Organization",
      "Moshe Dayan",
      "Israel Tal",
      "Ahmad Ismail Ali",
      "Mustafa Tlass al jahesh",
      "Haim Bar-Lev",
      "David Elazar",
      "Saad el-Shazly",
      "Yitzhak Hofi",
      "Pakistan Air Force",
      "Muhammad Abd El-Ghani El-Gamasy",
      "Ali Aslan",
      "Benny Peled",
      "Shmuel Gonen",
      "Egypt",
      "France",
      "United Kingdom",
      "Israel",
      "Egypt",
      "Cuba",
      "Israel",
      "Jordan",
      "Syria",
      "Soviet Union",
      "Palestine Liberation Organization",
      "Saudi Arabia",
      "Gamal Abdel Nasser",
      "Anwar Sadat",
      "Hussein of Jordan"
    ]
  },
  {
    "NNQT_question": "What is the {biblical episode} for {author of foreword} of {Jesus}",
    "uid": 30292,
    "subgraph": "simple question left",
    "template_index": 3201,
    "question": "Tell me about the author of foreword of Jesus Christ.",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2679 wd:Q302 . ?sbj wdt:P31 wd:Q22704077 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Let me know around the author of foreword of Jesus Christ.",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P3342 wd:Q302 . ?sbj wdt:P31 wd:Q22704077 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {physical constant} that starts with {'w'}",
    "uid": 24536,
    "subgraph": "string matching simple contains word",
    "template_index": 673,
    "question": "What are the physical constant which start with the letter w",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q173227 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q173227>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the physical consistent which begin with the letter w",
    "answers": [
      "weak mixing angle constant",
      "Wien wavelength displacement law constant"
    ]
  },
  {
    "NNQT_question": "What is {appointed by} and {end cause} of {Vladimir Lenin} has {position held} as {senatore a vita}",
    "uid": 32086,
    "subgraph": [],
    "template_index": 590,
    "question": "Name the appointment cause and the halt reason for Vladimir Lenin while serving as a senatore a vita",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q1394 p:P39 ?s . ?s ps:P39 wd:Q826589 . ?s pq:P748 ?value1 . ?s pq:P1534 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "what was the appointment cause for Vladimir Lenin while serving as a senatore a vita and what was the halt reason",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q83174 p:P39 ?s . ?s ps:P39 wd:Q826589 . ?s pq:P748 ?value1 . ?s pq:P1534 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {place of birth} of {Yevgeny Baratynsky} that is {located in the administrative territorial entity} is {ERROR1} ?",
    "uid": 5012,
    "subgraph": "statement_property",
    "template_index": 1457,
    "question": null,
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q364252 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q4221842 }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q364252> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P131> <http://wikidata.dbpedia.org/resource/Q4221842>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": [],
    "answers": [
      "Mara Manor"
    ]
  },
  {
    "NNQT_question": "What is {fuel system} of {Al Hudaydah}",
    "uid": 30775,
    "subgraph": "center",
    "template_index": 1226,
    "question": "What is the fuel system of Al Hudaydah?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1211 wd:Q270041}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1211 wd:Q12725}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {has boundary} {television series} that contains the word {zigby} in their name",
    "uid": 31159,
    "subgraph": "string matching simple contains word",
    "template_index": 913,
    "question": "Which is the element that has television series as boundary and contains the word zigby in it's name?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P4777 wd:Q5398426 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zigby')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which is the element that has tv arrangement as boundary and contains the word zigby in it's name?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5398426 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zigby')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {oath made by} of {Li Ning}",
    "uid": 30813,
    "subgraph": "center",
    "template_index": 2299,
    "question": "Which  is oath made by Li Ning ?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P543 wd:Q314032}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P545 wd:Q314032}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {taxon} for {taxonomic type} of {Durio}",
    "uid": 21443,
    "subgraph": "simple question right",
    "template_index": 1789,
    "question": "What is the type of procedure for the taxonomy of Durio",
    "sparql_wikidata": " select distinct ?obj where { wd:Q2309085 wdt:P427 ?obj . ?obj wdt:P31 wd:Q16521 } ",
    "sparql_dbpedia18": "select distinct ?obj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2309085> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P427> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj . ?obj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q16521> } ",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the sort of strategy for the scientific categorization of Durio",
    "answers": [
      "Durio zibethinus"
    ]
  },
  {
    "NNQT_question": "What is {child} of {series spin-off} of {Lou Harrison} ?",
    "uid": 30576,
    "subgraph": "right-subgraph",
    "template_index": 1995,
    "question": "Who is the son of Lou Harrison's series spin-off?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q590911 wdt:P2512 ?X . ?X wdt:P40 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Lou Harrison's series spin-off is the father to what son?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q590911 wdt:P1066 ?X . ?X wdt:P40 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {culture} of {state} of {Australian Secret Intelligence Service} ?",
    "uid": 14692,
    "subgraph": "right-subgraph",
    "template_index": 396,
    "question": "who culture of state of australian secret intelligence services ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q181694 wdt:P17 ?X . ?X wdt:P172 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q181694> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P17>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P172> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "The australian secret intelligence service has what kind of culture?",
    "answers": [
      "English people",
      "Germans",
      "Italians",
      "Indigenous Australians",
      "Irish people",
      "Scottish people",
      "Dutch",
      "Greeks",
      "Indians",
      "Australians",
      "Chinese people"
    ]
  },
  {
    "NNQT_question": "what is the {end time} for {Veronica Lake} has {spouse} as {André de Toth} ?",
    "uid": 6104,
    "subgraph": "statement_property",
    "template_index": 2549,
    "question": "When did Veronica Lake and Andre dé Toth end their relationship?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q84232 p:P26 ?s . ?s ps:P26 wd:Q518244 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q84232> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q518244> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "what did Veronica Lake and Andre dé Toth end their relationship?",
    "answers": [
      "1952-06-02T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {Austrian Parliament ID} of {Mutaz Essa Barshim}",
    "uid": 30927,
    "subgraph": "center",
    "template_index": 1955,
    "question": "Which is the Australian Parliament ID for Mutaz Essa Barshim?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1739 wdt:P2280 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q1260 wdt:P2280 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]