[
  {
    "NNQT_question": "What is {has influence} of {Anna Akhmatova}, that has {birth year} is {1799-5-26} ?",
    "uid": 13932,
    "subgraph": "right-subgraph",
    "template_index": 4670,
    "question": "Who influenced Anna Akhmatova who was born on May 26th, 1799.",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q80440 wdt:P737 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1799'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q80440> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P737>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P569> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <1799-5-26> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who impacted Anna Akhmatova who was born on May 26th, 1799.",
    "answers": [
      "Alexander Pushkin"
    ]
  },
  {
    "NNQT_question": "What is the {replaced by} for {Minamoto no Yoritomo} has {position held} as {pope} ?",
    "uid": 31490,
    "subgraph": "statement_property",
    "template_index": 4902,
    "question": "who replaced Minamoto no Yoritomo as pope?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q242800 p:P39 ?s . ?s ps:P39 wd:Q19546 . ?s pq:P1366 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Who substituted Minamoto no Yoritomo as pope?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q170502 p:P39 ?s . ?s ps:P39 wd:Q19546 . ?s pq:P1366 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {point in time} for {Michail Sholokhov} has {nominated for} as {Nobel Prize in Literature} ?",
    "uid": 5104,
    "subgraph": "statement_property",
    "template_index": 1549,
    "question": "When was Michail Sholokhov nominated for a Nobel Prize in Literature?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q42398 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q42398> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q37922> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Michail Sholokhov was nominated for Literature's Nobel Prize in what year?",
    "answers": [
      "1961-01-01T00:00:00Z",
      "1948-01-01T00:00:00Z",
      "1964-01-01T00:00:00Z",
      "1962-01-01T00:00:00Z",
      "1965-01-01T00:00:00Z",
      "1956-01-01T00:00:00Z",
      "1963-01-01T00:00:00Z",
      "1958-01-01T00:00:00Z",
      "1947-01-01T00:00:00Z",
      "1955-01-01T00:00:00Z",
      "1949-01-01T00:00:00Z",
      "1950-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {gens} of {Ben Chifley}",
    "uid": 30852,
    "subgraph": "center",
    "template_index": 3118,
    "question": "Which is the gens of Ben Chifley?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q23379 wdt:P5025 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q7170 wdt:P5025 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Thai cultural heritage ID} of {Khlong Chak Phra}",
    "uid": 30923,
    "subgraph": "center",
    "template_index": 2189,
    "question": "Which is the Thai cultural heritage ID for Khlong Chak Phra?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q13013734 wdt:P1626 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q1431800 wdt:P1626 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {position held} of {Angela Merkel} that is {start time} is {1994-11-10} ?",
    "uid": 3708,
    "subgraph": "statement_property",
    "template_index": 153,
    "question": "When position did Angela Merkel hold on November 10, 1994?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q567 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1994')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q567> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P39> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1994-11-10>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "On November 10, 1994, what was Angela Merkel's role?",
    "answers": [
      "Bundesminister",
      "member of the German Bundestag"
    ]
  },
  {
    "NNQT_question": "Give me {space velocity} that contains the word {velocity} in their name",
    "uid": 23642,
    "subgraph": "string matching simple contains word",
    "template_index": 2655,
    "question": "What are the space velocity which start with the letter velocity",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4234997 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'velocity')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q4234997>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'velocity')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the space speed which begin with the letter velocity",
    "answers": [
      "first cosmic velocity",
      "third cosmic velocity"
    ]
  },
  {
    "NNQT_question": "What is the {start time} for {Okinawa Prefecture} has {installed capacity} as {Santa Cruz Department} ?",
    "uid": 31530,
    "subgraph": "statement_property",
    "template_index": 2760,
    "question": "when did Okinawa Prefecture have the Santa Cruz Department as its installed capacity?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q766445 p:P2109 ?s . ?s ps:P2109 wd:Q235106 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When was The Santa Cruz Department wasOkinawa Prefecture installed capacity?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q766445 p:P190 ?s . ?s ps:P190 wd:Q235106 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {club manager} of {actress} of {WrestleMania III} ?",
    "uid": 15535,
    "subgraph": "left-subgraph",
    "template_index": 38,
    "question": "Who is {club manager} of {actress} of {WrestleMania III} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q50817 wdt:P161 ?X . ?X wdt:P286 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q50817> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P161>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P286> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is {club supervisor} of {on-screen character} of {WrestleMania III} ?",
    "answers": [
      "Hiro Matsuda",
      "Stu Hart",
      "Verne Gagne",
      "Hiro Matsuda",
      "Stu Hart",
      "Eddie Graham",
      "Verne Gagne"
    ]
  },
  {
    "NNQT_question": "What is {place of birth} of {curator} of {Margaret Rudd} ?",
    "uid": 30640,
    "subgraph": "left-subgraph",
    "template_index": 59,
    "question": "Which is {location born} of {curator} {Margaret Rudd} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q18576688 wdt:P1640 ?X . ?X wdt:P19 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which is {area born} of {curator} {Margaret Rudd} ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q18576688 wdt:P451 ?X . ?X wdt:P19 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {start time} and {end time} of {Haidian District} has {employer} as {Bomis}",
    "uid": 32047,
    "subgraph": [],
    "template_index": 80,
    "question": "When was Haidian District employed as Bomis and when did he leave?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q393454 p:P108 ?s . ?s ps:P108 wd:Q935818 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What was Haidian District start and end date during his employment at Bomis?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q181 p:P108 ?s . ?s ps:P108 wd:Q935818 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {population} of {country} of {Foreigner} ?",
    "uid": 30754,
    "subgraph": "right-subgraph",
    "template_index": 1088,
    "question": "what is the population of the country of Foreigner ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q275059 wdt:P17 ?X . ?X wdt:P1082 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "what is the populace of country of Outsider ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q275059 wdt:P495 ?X . ?X wdt:P1082 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {magister degree} that contains the word {philosophy} in their name",
    "uid": 31225,
    "subgraph": "string matching simple contains word",
    "template_index": 1294,
    "question": "Tell me magister degree whose name has the word philosophy in it",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q67130272 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'philosophy')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know magister degree whose title has the word reasoning in it",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23015928 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'philosophy')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Olympic sport} that starts with {'w'}",
    "uid": 24385,
    "subgraph": "string matching simple contains word",
    "template_index": 2310,
    "question": "WHAT ARE THE OLYMPIC SPORT WHICH START WITH THE LETTER W.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q212434 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q212434>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "WHAT ARE LETTER WITH THE OLYMPIC SPORT WHICH START.",
    "answers": [
      "weightlifting"
    ]
  },
  {
    "NNQT_question": "What is the {powerplant} and the {manufacturer} of {Rockwell_B-1_Lancer} ?",
    "uid": 10085,
    "subgraph": "two intentions right subgraph",
    "template_index": 240,
    "question": "What power plant and manufacturer is responsible for the Rockwell B-1 Lancer?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q218636 wdt:P516 ?ans_1 . wd:Q218636 wdt:P176 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q218636> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P516> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q218636> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P176> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What control plant and producer is capable for the Rockwell B-1 Lancer?",
    "answers": [
      "General Electric F101",
      "Boeing",
      "General Electric F101",
      "Rockwell International"
    ]
  },
  {
    "NNQT_question": "What is {employer} of {employer} of {Georg Simmel} ?",
    "uid": 30744,
    "subgraph": "right-subgraph",
    "template_index": 5214,
    "question": "who employer of employer for  georg simmel ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q76849 wdt:P108 ?X . ?X wdt:P108 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "who minister of employer for georg simmel ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q76849 wdt:P108 ?X . ?X wdt:P1075 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {work location} of {Willem de Kooning} that is {end time} is {1926-7-18} ?",
    "uid": 4186,
    "subgraph": "statement_property",
    "template_index": 631,
    "question": "Where did Willem de Kooning work on 7-18-1926?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q132305 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1926')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q132305> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P937> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P582> <1926-7-18>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "At what place worked Willem de Kooning in 1926?",
    "answers": [
      "Rotterdam"
    ]
  },
  {
    "NNQT_question": "What is {variety of form} of {National Museum of American History}",
    "uid": 30869,
    "subgraph": "center",
    "template_index": 1469,
    "question": "Which is the variety of form of the National Museum of American History?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q148584 wdt:P7481 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q148584 wdt:P3153 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {ordered by} of {Vincent Auriol}",
    "uid": 30875,
    "subgraph": "center",
    "template_index": 2296,
    "question": "What is ordered by Vincent Auriol ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q158772 wdt:P8004 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q158772 wdt:P103 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {honorific} for {notable work} of {Salman of Saudi Arabia}",
    "uid": 31888,
    "subgraph": "simple question right",
    "template_index": 1089,
    "question": "who honorific for notable work of Salman of Saudi Arabia?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q367825 wdt:P800 ?obj . ?obj wdt:P31 wd:Q1326966 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "who honorific for notable work of Salman of Saudi Arabia?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q367825 wdt:P511 ?obj . ?obj wdt:P31 wd:Q1326966 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of sports team} of {Ellyse Perry} and {region within image}",
    "uid": 32021,
    "subgraph": [],
    "template_index": 886,
    "question": "What was the region within image of Ellyse Perry when playing for which team?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q600090 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P8276 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What was Ellyse Perry's region within image when playing for which group",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q600090 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {author} and the {illustrator} of {Treasure Island} ?",
    "uid": 31984,
    "subgraph": "two intentions right subgraph",
    "template_index": 177,
    "question": "Who is the author of and who illustrated Treasure Island?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q185118 wdt:P50 ?ans_1 . wd:Q185118 wdt:P110 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Who wrote & Illustrated the book Treasure Island?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q185118 wdt:P50 ?ans_1 . wd:Q185118 wdt:P736 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {twinned administrative body} of {Western Australia} that is {start time} is {1984-10-01} ?",
    "uid": 31416,
    "subgraph": "statement_property",
    "template_index": 2196,
    "question": "What twinned administrative body of Western Australia started on October 10th, 1984?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q3206 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1984')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What paired administrative body of Western Australia started on October 10th, 1984?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q36074 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1984')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {GND ID} of {helium-4}",
    "uid": 31030,
    "subgraph": "center",
    "template_index": 658,
    "question": "Which is the GND ID of helium-4?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1151346 wdt:P227 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q1151346 wdt:P2160 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {applies to part} of {has effect} of {centrifugal force} ?",
    "uid": 30747,
    "subgraph": "right-subgraph",
    "template_index": 1,
    "question": "What is the application to part that implies centrifugal force ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q178733 wdt:P1542 ?X . ?X wdt:P518 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the application to part that infers centrifugal constrain ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q178733 wdt:P1542 ?X . ?X wdt:P2534 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {origin of the watercourse} of {Tennessee River}",
    "uid": 30818,
    "subgraph": "center",
    "template_index": 3672,
    "question": "Which is the origin of the watercourse for Tennesse River?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P885 wd:Q193737}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P974 wd:Q193737}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {this taxon is source of} of {David Letterman}",
    "uid": 30785,
    "subgraph": "center",
    "template_index": 1006,
    "question": "David Letterman is source of what?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1672 wd:Q217298}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P162 wd:Q217298}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Hobby-Eberly Telescope} has {significant event} as {construction} ?",
    "uid": 31543,
    "subgraph": "statement_property",
    "template_index": 1413,
    "question": "What is the significant role played by Hobby-Eberly Telescope in the field of Construction?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q139605 p:P793 ?s . ?s ps:P793 wd:Q385378 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Which was the important role that was played by Hobby-Eberly Telescope in the field of Construction?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q652252 p:P793 ?s . ?s ps:P793 wd:Q385378 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {country} of {Adelaide} that is {start time} is {1836-12-28} ?",
    "uid": 7746,
    "subgraph": "statement_property",
    "template_index": 4191,
    "question": "In what country was Adelaide founded on 12-28-1836?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q5112 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1836')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q5112> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P17> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1836-12-28>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "On 12-28-1836, in what county was Adelaide founded?",
    "answers": [
      "United Kingdom of Great Britain and Ireland"
    ]
  },
  {
    "NNQT_question": "What is the {sibling} and the {child} of {Eve Alda} ?",
    "uid": 31976,
    "subgraph": "two intentions right subgraph",
    "template_index": 35,
    "question": "Who are the children and siblings of Eve Alda?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q22996966 wdt:P3373 ?ans_1 . wd:Q22996966 wdt:P40 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Name the immediate family of Eve Alda.",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q310394 wdt:P3373 ?ans_1 . wd:Q310394 wdt:P40 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {total fertility rate} of {Trinidad and Tobago} that is {determination method} is {Baoding} ?",
    "uid": 31289,
    "subgraph": "statement_property",
    "template_index": 5234,
    "question": "What is total fertility rate of Trinidad and Tobago that is determination method is Baoding ?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q754 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P459 wd:Q58584 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What is Trinidad and Tobago's fertility's rate estimated with Baoding method?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q754 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P459 wd:Q791801 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {cola} that starts with {'p'}",
    "uid": 24488,
    "subgraph": "string matching simple contains word",
    "template_index": 631,
    "question": "which cola starts with the letter p",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q134041 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q134041>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "which cola begins with the letter p",
    "answers": [
      "Pepsi",
      "Parsi Cola",
      "Pepsi Perfect",
      "Pepsi True"
    ]
  },
  {
    "NNQT_question": "How many {member of the crew of} are for {John Jellicoe, 1st Earl Jellicoe} ?",
    "uid": 1036,
    "subgraph": "statement_property",
    "template_index": 36,
    "question": "How many members of the crew are there for John Jellicoe , 1st Earl Jellicoe?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q335028 wdt:P5096 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q335028> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P5096> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "John Jellicoe has how many crew members?",
    "answers": [
      "16"
    ]
  },
  {
    "NNQT_question": "What is the {statement is subject of} for {Aaron Kwok} has {award received} as {Burlington} ?",
    "uid": 31491,
    "subgraph": "statement_property",
    "template_index": 1447,
    "question": "When did Aaron Kwok receive the award for Burlington?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q16872 p:P166 ?s . ?s ps:P166 wd:Q31058 . ?s pq:P805 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "In which year did Aaron Kwok receive the Burlington award?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q16872 p:P166 ?s . ?s ps:P166 wd:Q17500591 . ?s pq:P805 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {field of work} of {spouse} of {Anjimile Oponyo} ?",
    "uid": 30709,
    "subgraph": "left-subgraph",
    "template_index": 11,
    "question": "Who is {field} {partners} of {Anjimile Oponyo} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q4765818 wdt:P26 ?X . ?X wdt:P101 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Anjimile Oponyo has who as field partners?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q7323937 wdt:P26 ?X . ?X wdt:P101 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]