[
  {
    "NNQT_question": "What is the {deity} for {depicted by} of {Crucifixion of Jesus}",
    "uid": 30337,
    "subgraph": "simple question left",
    "template_index": 340,
    "question": "What deity depicted the crucifixion of Christ?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1299 wd:Q51636 . ?sbj wdt:P31 wd:Q178885 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "The crucifixion of Jesus was depicted by what deity?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P793 wd:Q51636 . ?sbj wdt:P31 wd:Q178885 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {age of candidacy} of {Syria}",
    "uid": 31004,
    "subgraph": "center",
    "template_index": 1046,
    "question": "Which is the age of candidacy for Syria?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q858 wdt:P2998 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q884 wdt:P2998 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {owner} of {player of} of {Milt Palacio} ?",
    "uid": 17277,
    "subgraph": "left-subgraph",
    "template_index": 330,
    "question": "who is owner of player for Milt Palacio ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2449958 wdt:P54 ?X . ?X wdt:P127 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2449958> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P54>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P127> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "who is proprietor of player for Milt Palacio ?",
    "answers": [
      "Maple Leaf Sports & Entertainment",
      "Lance Stephenson",
      "Robert Sarver"
    ]
  },
  {
    "NNQT_question": "What is {languages spoken, written or signed} of {sibling} of {Elizabeth of Bosnia} ?",
    "uid": 30695,
    "subgraph": "right-subgraph",
    "template_index": 2370,
    "question": "What is the spoken language of Elizabeth of Bosnia?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q231166 wdt:P3373 ?X . ?X wdt:P1412 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the talked dialect of Elizabeth of Bosnia?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q53449 wdt:P3373 ?X . ?X wdt:P1412 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {point in time} for {Supernatural} has {award received} as {Favorite Pop/Rock Album} ?",
    "uid": 7378,
    "subgraph": "statement_property",
    "template_index": 3823,
    "question": "When did Supernatural win the Favorite Pop/Rock Album award?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q819127 p:P166 ?s . ?s ps:P166 wd:Q19858080 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q819127> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q19858080> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "On what date did Supernatural win the Favorite Pop/Rock Album grant?",
    "answers": [
      "2000-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "How many {exclave of} are to/by {Ulaanbaatar} ?",
    "uid": 31724,
    "subgraph": "statement_property",
    "template_index": 1694,
    "question": "How many numbers of exclave for the  {Ulaanbaatar} ?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P500 wd:Q23430 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "How many exclaves does Ulaanbaatar have?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P500 wd:Q227 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located on terrain feature} of {Greater Antilles}, that has {linear thermal expansion coefficient} is {North America} ?",
    "uid": 30386,
    "subgraph": "right-subgraph",
    "template_index": 42,
    "question": "What is on geographical feature of Greater Antilles whose linear thermal expansion coefficient is North America ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q128011 wdt:P706 ?answer . ?answer wdt:P5672 wd:Q49}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the geography of the Greater Antilles with North America as linear thermal expansion coefficient?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q128011 wdt:P706 ?answer . ?answer wdt:P30 wd:Q49}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {habitat} of {found in taxon} of {Khosrow II} ?",
    "uid": 30502,
    "subgraph": "left-subgraph",
    "template_index": 32125,
    "question": "what is Khosrow II habitat of found in species?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q212732 wdt:P703 ?X . ?X wdt:P2974 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which species is Khosrow II found in?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q22226273 wdt:P703 ?X . ?X wdt:P2974 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {part of} {time of the day} that contains the word {morning} in their name",
    "uid": 31209,
    "subgraph": "string matching simple contains word",
    "template_index": 183,
    "question": "which part of the time of the day contains the word morning in their name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P361 wd:Q1260524 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'morning')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "which part of the time of the day contains the word morning in their title",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1260524 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'morning')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {age of majority} of {allegiance} of {Gladwyn Jebb} ?",
    "uid": 30705,
    "subgraph": "right-subgraph",
    "template_index": 5066,
    "question": "What is the majority age of those who are loyal to Gladwyn Jebb?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1275 wdt:P945 ?X . ?X wdt:P2997 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Of those who are loyal to Gladwyn Jebb, what is the majority age?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q188783 wdt:P945 ?X . ?X wdt:P2997 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {posthumous name} of {Virgil} that is {writing system} is {traditional Chinese characters} ?",
    "uid": 31419,
    "subgraph": "statement_property",
    "template_index": 4543,
    "question": "What is the posthumous name of Virgil in the writing system of traditional Chinese characters?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1398 p:P1786 ?s . ?s ps:P1786 ?obj . ?s pq:P282 wd:Q178528 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Utilizing the writing system of traditional Chinese characters what is the posthumous name of Virgil?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q9701 p:P1786 ?s . ?s ps:P1786 ?obj . ?s pq:P282 wd:Q178528 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {choreographer} of {Scott Moir}",
    "uid": 30340,
    "subgraph": "simple question left",
    "template_index": 1947,
    "question": "Who is the choreographer of Scott Moir?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1809 wd:Q440940 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who is Scott Moir's choreographer?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1327 wd:Q440940 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {operator} and the {manufacturer} of {CP-121 Tracker} ?",
    "uid": 31980,
    "subgraph": "two intentions right subgraph",
    "template_index": 409,
    "question": "Who is the operator and builder of the CP-121 Tracker?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q18070145 wdt:P137 ?ans_1 . wd:Q18070145 wdt:P176 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Who built and operated the CP-121 Tracker?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q736765 wdt:P137 ?ans_1 . wd:Q736765 wdt:P176 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of sports team} of {George Washington} that is {start time} is {1893-01-01} ?",
    "uid": 31410,
    "subgraph": "statement_property",
    "template_index": 1403,
    "question": "What member of the George Washington sports team joined in 1893 ?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q23 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1893')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "which member of sports joined George Washington joined in 1893?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q2757835 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1893')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {IRC channel} of {Claudette Colbert} that is {statement is subject of} is {8th Academy Awards} ?",
    "uid": 31395,
    "subgraph": "statement_property",
    "template_index": 2473,
    "question": "What was Claudette Colbert IRC channel in the 8th Academy Awards?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q203819 p:P1613 ?s . ?s ps:P1613 ?obj . ?s pq:P805 wd:Q132080 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was Claudette Colbert IRC channel within the 8th Institute Grants?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q203819 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q132080 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {William Ramsay} has {nominated for} as {August Wilhelm von Hofmann Medal} ?",
    "uid": 31623,
    "subgraph": "statement_property",
    "template_index": 1028,
    "question": "When was William Ramsay nominated for a August Wilhelm von Hofmann Medal?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q950726 p:P1411 ?s . ?s ps:P1411 wd:Q15116950 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "During which year was William Ramsay nomited for the August Wilhelm von Hofmann Medal?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q950726 p:P1411 ?s . ?s ps:P1411 wd:Q44585 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {inception} of {New Zealand} that is {end time} is {1947-11-25} ?",
    "uid": 31450,
    "subgraph": "statement_property",
    "template_index": 4231,
    "question": "What inception happened in New Zealand on 11/25/1947?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q664 p:P571 ?s . ?s ps:P571 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1947')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which inception transpired on 11/25/1947 in New Zealand?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q664 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1947')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {sister town} of {deathplace} of {Hafsa bint Umar} ?",
    "uid": 14952,
    "subgraph": "right-subgraph",
    "template_index": 1052,
    "question": "What is the Sister City of the final resting place of Hafsa bint Umar?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q263791 wdt:P20 ?X . ?X wdt:P190 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q263791> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the Sister City of the last resting spot of Hafsa bint Umar?",
    "answers": [
      "Mecca"
    ]
  },
  {
    "NNQT_question": "What is the {Leitkultur} for {location} of {Bilbao}",
    "uid": 31826,
    "subgraph": "simple question right",
    "template_index": 1393,
    "question": "Which is the Leitkultur for the location of Bilbao?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q8692 wdt:P276 ?obj . ?obj wdt:P31 wd:Q450461 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which is the Leitkultur for the area of Bilbao?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q8692 wdt:P276 ?obj . ?obj wdt:P31 wd:Q2736168 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {retrieved} of {coffee} that is {language of work or name} is {Georgian} ?",
    "uid": 31313,
    "subgraph": "statement_property",
    "template_index": 5199,
    "question": "How do you retrieve coffee in the Georgian language?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q8486 p:P813 ?s . ?s ps:P813 ?obj . ?s pq:P407 wd:Q8108 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Using the Georgian language how does one retrieve coffee?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q8486 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q8108 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {diplomatic relation} and the {continent} of {Bengaluru} ?",
    "uid": 31986,
    "subgraph": "two intentions right subgraph",
    "template_index": 180,
    "question": "What is the diplomatic relation of the Bangalore?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q1355 wdt:P530 ?ans_1 . wd:Q1355 wdt:P30 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Where is the diplomatic relation of Banglore?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q1355 wdt:P17 ?ans_1 . wd:Q1355 wdt:P30 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Soyuz TM-2} with the {MAX(periapsis)} ?",
    "uid": 31088,
    "subgraph": "rank",
    "template_index": 1,
    "question": "Which Soyuz TM-2 has the largest periapsis?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q738200 . ?ent wdt:P2244 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "What Soyuz TM-2 has the largest periapis?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q2637056 . ?ent wdt:P2244 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {seiyu} of {Last Exile}, that has {place of residence} is {St. Petersburg} ?",
    "uid": 13898,
    "subgraph": "right-subgraph",
    "template_index": 1833,
    "question": "What is it?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1052846 wdt:P725 ?answer . ?answer wdt:P551 wd:Q49236}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1052846> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P725>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P551> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q49236> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is it?",
    "answers": [
      "Joshua Seth"
    ]
  },
  {
    "NNQT_question": "What is {trunk prefix} of {shooting location} of {Seven Samurai} ?",
    "uid": 17760,
    "subgraph": "right-subgraph",
    "template_index": 3521,
    "question": "What is the trunk prefix of the shooting location Seven Samurai?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q189540 wdt:P915 ?X . ?X wdt:P3238 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q189540> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P915>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3238> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the trunk prefix of the shooting area Seven Samurai?",
    "answers": [
      "0"
    ]
  },
  {
    "NNQT_question": "Give me {day} that starts with {'m'}",
    "uid": 31237,
    "subgraph": "string matching simple contains word",
    "template_index": 2129,
    "question": "What is a day that starts with the letter m.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q573 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What's a day with letter m beginning.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1260524 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {WikiSkripta ID} are for {acromegaly} ?",
    "uid": 31718,
    "subgraph": "statement_property",
    "template_index": 31,
    "question": "How many WikiSkripta IDs are acromegaly?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q189580 wdt:P3471 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What are the number of acromegaly WikiSkripta IDs?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q189580 wdt:P673 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Qurayyat} for {located on terrain feature} of {classical antiquity}",
    "uid": 31817,
    "subgraph": "simple question right",
    "template_index": 1996,
    "question": "Which Qurayyat did the classical antiquity cover?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q486761 wdt:P706 ?obj . ?obj wdt:P31 wd:Q28716272 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which Qurayyat did the classical relic cover?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q486761 wdt:P706 ?obj . ?obj wdt:P31 wd:Q19953632 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {court} and the {applies to jurisdiction} of {R. v. Sharpe} ?",
    "uid": 31958,
    "subgraph": "two intentions right subgraph",
    "template_index": 583,
    "question": "What is the court and application of jurisdiction of R. v. Sharpe?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q281600 wdt:P4884 ?ans_1 . wd:Q281600 wdt:P1001 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Which court did R. v. Sharpe?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q300950 wdt:P4884 ?ans_1 . wd:Q300950 wdt:P1001 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {university} for {parent organization} of {London School of Hygiene & Tropical Medicine}",
    "uid": 30278,
    "subgraph": "simple question left",
    "template_index": 650,
    "question": "What is the parent university of London School of Hygiene & Tropical Medicine?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P749 wd:Q1126189 . ?sbj wdt:P31 wd:Q3918 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "London School of Hygiene & Tropical Medicine stemmed off of which previously established university?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P749 wd:Q217741 . ?sbj wdt:P31 wd:Q3918 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {HHOF.com NHL player ID} of {Tom Watson}",
    "uid": 30960,
    "subgraph": "center",
    "template_index": 3491,
    "question": "What is {HHOF.com NHL player ID} for {Tom Watson} ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q532111 wdt:P3567 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q532111 wdt:P4461 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of the deme} of {Väinö Linna} that is {point in time} is {1984-01-01} ?",
    "uid": 31377,
    "subgraph": "statement_property",
    "template_index": 2312,
    "question": "What member of the deme did Väinö Linna have in 1984?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q311037 p:P2462 ?s . ?s ps:P2462 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1984')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was Väinö Linna's member of the deme in 1984?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q311037 p:P1050 ?s . ?s ps:P1050 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1984')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {discoverer or inventor} of {antimony}",
    "uid": 31827,
    "subgraph": "simple question right",
    "template_index": 1628,
    "question": "Who discovered the antimony?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q1099 wdt:P61 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who found the antimony?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q618 wdt:P61 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {dyad} that contains the word {yan} in their name",
    "uid": 23858,
    "subgraph": "string matching simple contains word",
    "template_index": 1031,
    "question": "Tell me dyed whose name has the word yan in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29431432 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yan')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q29431432>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yan')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know colored whose title has the word yan in it.",
    "answers": [
      "yin and yang"
    ]
  },
  {
    "NNQT_question": "What is {award received} of {Madonna} that is {point in time} is {1974-01-01} ?",
    "uid": 31424,
    "subgraph": "statement_property",
    "template_index": 4719,
    "question": "What award did Madonna receive in 1974?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1744 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1974')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What honor did Madonna's efforts earned him?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q148109 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1974')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {illustrator} are to/by {E. H. Shepard} ?",
    "uid": 2162,
    "subgraph": "statement_property",
    "template_index": 1506,
    "question": "How many illustrations are there by E. H. Shepard?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P110 wd:Q382031 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P110> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q382031 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "In regards to E.H. Shepard, how many illustrations are there?",
    "answers": [
      "5"
    ]
  },
  {
    "NNQT_question": "What is the {film} for {screenwriter} of {Amanda Bynes}",
    "uid": 30341,
    "subgraph": "simple question left",
    "template_index": 3500,
    "question": "Which film has Amanda Bynes as screenwriter?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P58 wd:Q212002 . ?sbj wdt:P31 wd:Q11424 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me the film with Amanda Bynes as screenwriter",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P161 wd:Q212002 . ?sbj wdt:P31 wd:Q11424 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]