[
  {
    "NNQT_question": "What is {practiced by} of {statement is subject of} of {language shift} ?",
    "uid": 30599,
    "subgraph": "right-subgraph",
    "template_index": 21,
    "question": "What drives the subject of the language shift statement",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q266961 wdt:P805 ?X . ?X wdt:P3095 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What drives the subject of the language shift statement",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q524648 wdt:P805 ?X . ?X wdt:P3095 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {rotary cannon} that {designed by} {Dillon Aero} and which that starts with {'m'}",
    "uid": 31930,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2539,
    "question": "What rotary cannon did Dillon Aero design that starts with the letter \"m\"?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1966482 . ?sbj wdt:P287 wd:Q5276922 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "What rotary cannon did Dillon Aero graph that starts with the letter \"m\"?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1966482 . ?sbj wdt:P287 wd:Q54173 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {deathplace} of {Gediminas}, that has {twin town} is {Irkutsk} ?",
    "uid": 13798,
    "subgraph": "right-subgraph",
    "template_index": 1803,
    "question": "Where is the deathplace of Gediminas, whose twin town is Irkutsk?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q244852 wdt:P20 ?answer . ?answer wdt:P190 wd:Q6576}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q244852> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q6576> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Where is the deathplace of Gediminas, whose twin town is Irkutsk?",
    "answers": [
      "Vilnius"
    ]
  },
  {
    "NNQT_question": "How many {activating neurotransmitter} are to/by {γ-aminobutyric acid} ?",
    "uid": 1824,
    "subgraph": "statement_property",
    "template_index": 1168,
    "question": "how many activated neurotransmitters are in y-aminobutyric acid?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P928 wd:Q210021 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P928> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q210021 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "y-aminobutyric acid has activated neurotransmitters, how many?",
    "answers": [
      "4"
    ]
  },
  {
    "NNQT_question": "Give me {heptalogy} that {fictional universe described in} {Harry Potter universe} and which contains the word {harry} in their name",
    "uid": 31936,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3943,
    "question": "Tell me the heptalogy that is a fictional universe described in Harry Potter universe and contains the word harry in it's name?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q614101 . ?sbj wdt:P1445 wd:Q5410773 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'harry')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Let me know the heptalogy that is an anecdotal universe cited in Harry Potter universe and contains the word harry in it's name?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q614101 . ?sbj wdt:P1434 wd:Q5410773 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'harry')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {temperature} of {located in or next to body of water} of {Cape Peninsula} ?",
    "uid": 30588,
    "subgraph": "right-subgraph",
    "template_index": 452,
    "question": "What is {temperature} {on river} of {Cape Peninsula} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q748494 wdt:P206 ?X . ?X wdt:P2076 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the { temperature } of { Cape Peninsula } on the river?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q12837 wdt:P206 ?X . ?X wdt:P2076 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {contains administrative territorial entity} of {South Holland}, that has {shares border with} is {Streefkerk} ?",
    "uid": 30472,
    "subgraph": "right-subgraph",
    "template_index": 2129,
    "question": "WHERE AMONG THE DIVISIONS OF SOUTH HOLLAND SHARES BORDER WITH STREEFKERK",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q694 wdt:P150 ?answer . ?answer wdt:P47 wd:Q959585}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "WHERE THE SOUTH HOLLAND DIVISIONS SHARES BORDER WITH STREEFKERK",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q694 wdt:P150 ?answer . ?answer wdt:P1383 wd:Q959585}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {unemployment rate} of {participant} of {Lochnagar mine} ?",
    "uid": 30623,
    "subgraph": "right-subgraph",
    "template_index": 6285,
    "question": "What is the unemployment rate of the candidate on the Lochnagar mine?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q24739 wdt:P710 ?X . ?X wdt:P1198 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the unemployment rate of Lochnagar mine?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q23908696 wdt:P710 ?X . ?X wdt:P1198 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Thomas Cromwell} for {diplomatic relation} of {African Union}",
    "uid": 31778,
    "subgraph": "simple question right",
    "template_index": 242,
    "question": "What Thomas Cromwell is the current leader of the African Union ?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q7159 wdt:P530 ?obj . ?obj wdt:P31 wd:Q294435 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What Thomas Cromwell leads the African Union?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q7159 wdt:P530 ?obj . ?obj wdt:P31 wd:Q3624078 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Ernest Renan} has {place of death} as {Hungarian Academy of Sciences} ?",
    "uid": 31583,
    "subgraph": "statement_property",
    "template_index": 5091,
    "question": "When did Ernest Renan die at the Hungarian Academy of Sciences?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q157155 p:P20 ?s . ?s ps:P20 wd:Q265058 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "On what date did Ernest Renan die at the Hungarian Academy of Sciences?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q157155 p:P463 ?s . ?s ps:P463 wd:Q265058 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {product or material produced} of {Tamoil}",
    "uid": 31008,
    "subgraph": "center",
    "template_index": 2109,
    "question": "What material is produced by Tamoil?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q706793 wdt:P1056 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q319642 wdt:P1056 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {TDD number} of {Álvaro Siza Vieira} that is {point in time} is {1988-01-01} ?",
    "uid": 31392,
    "subgraph": "statement_property",
    "template_index": 3411,
    "question": "What TDD number did Alvaro Siza Vieira receive in 1988?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q251365 p:P8659 ?s . ?s ps:P8659 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1988')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was Alvaro Siza Viera's TDD number in 1988?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q251365 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1988')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {product or material produced} of {papermaking}, that has {supercharger} is {bleach} ?",
    "uid": 30387,
    "subgraph": "right-subgraph",
    "template_index": 99,
    "question": "What is the product of papermaking which supercharger is bleach?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q335415 wdt:P1056 ?answer . ?answer wdt:P1210 wd:Q11587}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the papermaking product with bleach as supercharger?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q335415 wdt:P1056 ?answer . ?answer wdt:P186 wd:Q11587}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Greta Garbo} that is {start time} is {1954-01-01} ?",
    "uid": 31455,
    "subgraph": "statement_property",
    "template_index": 5658,
    "question": "Name the award received by Greta Garbo from the year 1954?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q5443 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1954')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "From 1954, what was the award received by Greta Garbo?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q5443 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1954')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {operating area} are for {1000 km Zeltweg} ?",
    "uid": 31688,
    "subgraph": "statement_property",
    "template_index": 550,
    "question": "Where is the operating area for 1000 km Zeltweg?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q164805 wdt:P2541 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "1000 km Zeltweg operates where?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q855988 wdt:P2541 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {point in time} for {Trichomonas vaginalis} has {award received} as {ERROR1} ?",
    "uid": 8521,
    "subgraph": "statement_property",
    "template_index": 4966,
    "question": null,
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q132595 p:P166 ?s . ?s ps:P166 wd:Q1310157 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q132595> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1310157> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": [],
    "answers": [
      "2016-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {signed language} of {sculptor} of {Z3} ?",
    "uid": 15716,
    "subgraph": "right-subgraph",
    "template_index": 57,
    "question": "What language does the sculptor of Z3 write in?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q222419 wdt:P170 ?X . ?X wdt:P1412 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q222419> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P170>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1412> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the language used for writing sculptor of Z3?",
    "answers": [
      "German",
      "German"
    ]
  },
  {
    "NNQT_question": "What is {award received} of {Álvaro Siza Vieira} that is {point in time} is {1988-0-0} ?",
    "uid": 6966,
    "subgraph": "statement_property",
    "template_index": 3411,
    "question": "What award did Alvaro Siza Vieira receive in 1988?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q251365 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1988')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q251365> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1988-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was Alvaro Siza Viera awarded in 1988?",
    "answers": [
      "Alvar Aalto Medal",
      "European Union Prize for Contemporary Architecture"
    ]
  },
  {
    "NNQT_question": "What is {architect} of {home venue} of {Julius Nepos} ?",
    "uid": 30503,
    "subgraph": "left-subgraph",
    "template_index": 3,
    "question": "who architecture firm of home field of Julius Nepos?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q103860 wdt:P115 ?X . ?X wdt:P84 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "who engineering firm of domestic field of Julius Nepos?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q16845909 wdt:P115 ?X . ?X wdt:P84 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {award} for {military branch} of {Mary Tyler Moore}",
    "uid": 31795,
    "subgraph": "simple question right",
    "template_index": 1144,
    "question": "What award was the military branch of Mary Tyler Moore ?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q41342 wdt:P241 ?obj . ?obj wdt:P31 wd:Q618779 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What grant was the military branch of Mary Tyler Moore ?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q41342 wdt:P166 ?obj . ?obj wdt:P31 wd:Q618779 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {subclass of} {subculture} that starts with {'t'}",
    "uid": 31246,
    "subgraph": "string matching simple contains word",
    "template_index": 267,
    "question": "What are the subclass of subculture which start with the letter t",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P279 wd:Q264965 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the subclass of subculture which begin with the letter t",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q264965 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {academic thesis} of {Louise Bourgeois} that is {end time} is {1938-01-01} ?",
    "uid": 31379,
    "subgraph": "statement_property",
    "template_index": 1302,
    "question": "Where was Louise Bourgeois academic thesis in the year 1938?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q159409 p:P1026 ?s . ?s ps:P1026 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1938')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Where was Louise Bourgeois academic thesis in the year 1938?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q159409 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1938')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {group 16} with the {MAX(electronegativity)} ?",
    "uid": 31090,
    "subgraph": "rank",
    "template_index": 205,
    "question": "Tell me the name of a group 16 with the most electronegativity",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q104567 . ?ent wdt:P1108 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "Let me know the name of a group 16 with the foremost electronegativity",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q19600 . ?ent wdt:P1108 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {father} of {mother} of {William Petty} ?",
    "uid": 30698,
    "subgraph": "left-subgraph",
    "template_index": 21,
    "question": "Who gave the{son of} of {son of} of {William Petty} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q278699 wdt:P25 ?X . ?X wdt:P22 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who gave Kerry's son { son } of { William Petty }?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q8009095 wdt:P25 ?X . ?X wdt:P22 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {timezone} of {death location} of {Sallust} ?",
    "uid": 14368,
    "subgraph": "right-subgraph",
    "template_index": 254,
    "question": "What is the timezone of the place Sallust died?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7170 wdt:P20 ?X . ?X wdt:P421 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7170> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P421> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the timezone of the put Sallust died?",
    "answers": [
      "UTC+01:00",
      "UTC+02:00"
    ]
  },
  {
    "NNQT_question": "Give me {use} {use} that starts with {'t'}",
    "uid": 31248,
    "subgraph": "string matching simple contains word",
    "template_index": 3015,
    "question": "tell me about use of use starts with t",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P366 wd:Q1724915 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "let me know approximately use of utilize begins with t",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1724915 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {DORIS ID} of {Eumetazoa}",
    "uid": 30935,
    "subgraph": "center",
    "template_index": 2764,
    "question": "Which is DORIS ID for Eumetazoa?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q5174 wdt:P4630 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q192095 wdt:P4630 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {culture} of {place of burial} of {Clement XI} ?",
    "uid": 30757,
    "subgraph": "right-subgraph",
    "template_index": 216,
    "question": "WHAT IS CIVILISATION OF PLACE OF BURIAL OF CLEMENT XI?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q129967 wdt:P119 ?X . ?X wdt:P2596 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is Clement XI's civilization's place of burial?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q129967 wdt:P937 ?X . ?X wdt:P2596 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {KINENOTE person ID} of {François Mitterrand}",
    "uid": 30932,
    "subgraph": "center",
    "template_index": 944,
    "question": "What is KINENOTE person ID for François Mitterrand ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q2038 wdt:P3305 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q106255 wdt:P3305 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {place of burial} of {title of chess person} of {Church of St Peter} ?",
    "uid": 30659,
    "subgraph": "left-subgraph",
    "template_index": 4109,
    "question": "Where is the resting place of title of chess person of the Church of St Peter?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q17528903 wdt:P2962 ?X . ?X wdt:P119 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "At what location is the resting place of title of chess person of the Church of St Peter?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q17528903 wdt:P825 ?X . ?X wdt:P119 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {student of} and {academic degree} of {Robert J. Shiller} has {educated at} as {Massachusetts Institute of Technology}",
    "uid": 32071,
    "subgraph": [],
    "template_index": 5,
    "question": "Who was the teacher of Robert J. Shiller and what degree does he received from Massachusetts Institute of Technology?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q338151 p:P69 ?s . ?s ps:P69 wd:Q49108 . ?s pq:P1066 ?value1 . ?s pq:P512 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What were Robert J. Shiller's degree and teacher at Massachusetts Institute of Technology?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q338151 p:P69 ?s . ?s ps:P69 wd:Q49108 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Valeri Polyakov} that is {point in time} is {2011-4-12} ?",
    "uid": 4687,
    "subgraph": "statement_property",
    "template_index": 1132,
    "question": "What award was received by Valeri Polyakov on April 4, 2011?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q317792 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q317792> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2011-4-12>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was the award Valeri received on April 4th 2011",
    "answers": [
      "Medal \"For Merit in Space Exploration\"",
      "Medal \"For Merit in Space Exploration\""
    ]
  },
  {
    "NNQT_question": "What is the {instance of} for {Virgil} has {said to be the same as} as {Jean Seul de Méluret} ?",
    "uid": 31615,
    "subgraph": "statement_property",
    "template_index": 1729,
    "question": "In what instances has Virgil been compared to Jean Seul de Méluret?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q1398 p:P460 ?s . ?s ps:P460 wd:Q21028930 . ?s pq:P31 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "In what occurrences has Virgil been compared to Jean Seul de Méluret?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q173481 p:P460 ?s . ?s ps:P460 wd:Q21028930 . ?s pq:P31 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {package management system} of {Windows 10}",
    "uid": 31036,
    "subgraph": "center",
    "template_index": 1760,
    "question": "What is Windows 10 package management system?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q18168774 wdt:P3033 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q18168774 wdt:P4387 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {A. R. Rahman} has {street address} as {IIFA Award for Best Music Director} ?",
    "uid": 31579,
    "subgraph": "statement_property",
    "template_index": 919,
    "question": "When did A.R. Rahman have IIFA Award for Best Music Director street address?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q108560 p:P6375 ?s . ?s ps:P6375 wd:Q492560 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "A.R. Rahman had the IIFA Award for Best Music Director street address in what year?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q108560 p:P166 ?s . ?s ps:P166 wd:Q492560 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {voltage} of {Archbasilica of St. John Lateran}",
    "uid": 30873,
    "subgraph": "center",
    "template_index": 3241,
    "question": "Which is the voltage of Archbasilica of St. John Lateran?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q84090 wdt:P2436 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q84090 wdt:P2971 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  }
]