[
  {
    "NNQT_question": "What is the {human} for {student of} of {Francis Bacon}",
    "uid": 30333,
    "subgraph": "simple question left",
    "template_index": 663,
    "question": "Which person was student of Francis Bacon?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1066 wd:Q37388 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me who was Francis Bacon's student",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P802 wd:Q37388 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Tartus} for {office held by head of state} of {pope}",
    "uid": 30239,
    "subgraph": "simple question left",
    "template_index": 1757,
    "question": "What is a Tartus for office held by the pope's head of state?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1906 wd:Q19546 . ?sbj wdt:P31 wd:Q174916 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What could be a Tartus for office held by the pope's head of state?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1906 wd:Q19546 . ?sbj wdt:P31 wd:Q3624078 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {denomination} of {Durrani Empire}, that has {history} is {history of Islam} ?",
    "uid": 12074,
    "subgraph": "right-subgraph",
    "template_index": 83,
    "question": "What denomination in the Durrani Empire has a history in Islam?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q467627 wdt:P140 ?answer . ?answer wdt:P2184 wd:Q642379}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q467627> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P140>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2184> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q642379> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What group within the Durrani Realm features a history in Islam?",
    "answers": [
      "Islam"
    ]
  },
  {
    "NNQT_question": "What is the {film} for {costume designer} of {Baz Luhrmann}",
    "uid": 30343,
    "subgraph": "simple question left",
    "template_index": 1612,
    "question": "What movie has Baz Luhrmann as costume designer?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2515 wd:Q250545 . ?sbj wdt:P31 wd:Q11424 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "In what movie Baz Luhrmann is the costume designer?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P57 wd:Q250545 . ?sbj wdt:P31 wd:Q11424 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {George Clooney} has {newspaper format} as {Indiana Film Journalists Association Award for Best Actor} ?",
    "uid": 31590,
    "subgraph": "statement_property",
    "template_index": 1083,
    "question": "When did George Cloooney have the Indiana Film Journalists Association Award for Best Actor newspaper format?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q23844 p:P3912 ?s . ?s ps:P3912 wd:Q16058281 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "In what year, did George Clooney have the Indiana Film Journalists Association Award for Best Actor newspaper format?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q23844 p:P166 ?s . ?s ps:P166 wd:Q16058281 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Sarvepalli Radhakrishnan} that contains the word {umhlanga} in their name",
    "uid": 31149,
    "subgraph": "string matching simple contains word",
    "template_index": 3797,
    "question": "tell me Sarvepalli Radhakrishnan whose name has the word umhlanga in it",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q156349 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'umhlanga')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me the Sarvepalli Radhakrishnan in which the word umhlanga is named",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2627975 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'umhlanga')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {feature film} that starts with {'t'}",
    "uid": 24417,
    "subgraph": "string matching simple contains word",
    "template_index": 2853,
    "question": "What are feature film which start with the letter t",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24869 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q24869>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are include film which begin with the letter t",
    "answers": [
      "The Three Musketeers",
      "The Island at the Top of the World",
      "The Rocketeer",
      "The Fifth Day of Peace",
      "Tron: Legacy",
      "The Legend of Lobo",
      "The Princess Diaries",
      "Tom Thumb",
      "The Five Man Army",
      "The Secret of the Magic Gourd",
      "The Missouri Traveler",
      "To Want to Fly",
      "The Lone Ranger",
      "That Darn Cat",
      "The Watcher in the Woods",
      "The Great Locomotive Chase",
      "The Fabulous World of Jules Verne",
      "The Apple Dumpling Gang",
      "The Book of Masters",
      "The Shaggy Dog",
      "The Anarchist's Wife",
      "The Search for Santa Paws",
      "The Parent Trap",
      "The Cat from Outer Space",
      "The Haunted Mansion"
    ]
  },
  {
    "NNQT_question": "Give me {format as a regular expression} {kinship} that contains the word {uncle} in their name",
    "uid": 31175,
    "subgraph": "string matching simple contains word",
    "template_index": 2743,
    "question": "Tell me kinship format as a regular expression whose name has the word uncle in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P1793 wd:Q171318 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'uncle')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know family relationship format as a regular expression whose title has the word uncle in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q171318 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'uncle')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {rector} of {Vancouver}",
    "uid": 31842,
    "subgraph": "simple question right",
    "template_index": 1178,
    "question": "who is the rector of Vancouver?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q24639 wdt:P1075 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "who is the rector of Vancouver?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q24639 wdt:P6 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {DSM-5 classification} of {cul-de-jatte}",
    "uid": 31020,
    "subgraph": "center",
    "template_index": 3008,
    "question": "Which is the DSM-5 of cul-de-jatte?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q91249320 wdt:P1930 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q181923 wdt:P1930 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {position held} of {Alexander Severus} that is {replaced by} is {Émile Loubet} ?",
    "uid": 31349,
    "subgraph": "statement_property",
    "template_index": 1087,
    "question": "What position did Alexander Severus hold before he was replaced by Émile Loubet?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1769 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q169502 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What position did Emile Loubet replace Alexander Severus in?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q296076 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q169502 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {drafted by} of {Pavlodar}",
    "uid": 30837,
    "subgraph": "center",
    "template_index": 1164,
    "question": "What did Pavlodar draft?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q486282 wdt:P647 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q311280 wdt:P647 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {family} for {chivalric order} of {Joseph}",
    "uid": 31837,
    "subgraph": "simple question right",
    "template_index": 521,
    "question": "Joseph belongs to what chivalric order?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q128267 wdt:P550 ?obj . ?obj wdt:P31 wd:Q8436 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Whose chivalric order does Joseph belong to?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q128267 wdt:P53 ?obj . ?obj wdt:P31 wd:Q8436 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {composer} of {Missa Solemnis}, that has {mother} is {Rizhao} ?",
    "uid": 30352,
    "subgraph": "right-subgraph",
    "template_index": 178,
    "question": "Who is the composer of Missa Solemnis that has mother Rizhao?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q723790 wdt:P86 ?answer . ?answer wdt:P25 wd:Q373101}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the composer of Missa Solemnis that is son of Rizhao?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q723790 wdt:P86 ?answer . ?answer wdt:P25 wd:Q14507972}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {central bank/issuer} of {total exports} of {Kingdom of Hawaiʻi} ?",
    "uid": 30639,
    "subgraph": "left-subgraph",
    "template_index": 87,
    "question": "The Kingdom of Hawaii utilizes the base total exports of which central bank?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q156418 wdt:P2135 ?X . ?X wdt:P562 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "The Kingdom of Hawaii utilizes the base money of which central bank?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q156418 wdt:P38 ?X . ?X wdt:P562 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {applies to part} for {New Hampshire} has {located in time zone} as {Mountain Time Zone} ?",
    "uid": 31619,
    "subgraph": "statement_property",
    "template_index": 1587,
    "question": "What part of New Hampshire is located in the Mountain Time Zone?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q759 p:P421 ?s . ?s ps:P421 wd:Q3134980 . ?s pq:P518 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Give me the part of New Hampshire that is located in the Mountain Time Zone.",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q1207 p:P421 ?s . ?s ps:P421 wd:Q3134980 . ?s pq:P518 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {mother} and the {spouse} of {cutter} ?",
    "uid": 31947,
    "subgraph": "two intentions right subgraph",
    "template_index": 37,
    "question": "Who is the mother and husband of cutter?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q5196933 wdt:P25 ?ans_1 . wd:Q5196933 wdt:P26 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Who are cutter's parents?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q106942 wdt:P25 ?ans_1 . wd:Q106942 wdt:P26 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Danila Kozlovsky} that is {point in time} is {2017-0-0} ?",
    "uid": 8396,
    "subgraph": "statement_property",
    "template_index": 4841,
    "question": "What award did Danila Kozlovsky receive in 2017?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q3015088 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2017')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q3015088> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2017-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What award did Danila Kozlovsky get in 2017?",
    "answers": [
      "Golden Mask"
    ]
  },
  {
    "NNQT_question": "What is {point in time} of {day of week} of {Easter} ?",
    "uid": 30636,
    "subgraph": "right-subgraph",
    "template_index": 1178,
    "question": "What is the time of the day of week of Easter?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q21196 wdt:P2894 ?X . ?X wdt:P585 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "In the week of Easter, what is the time of day?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q21196 wdt:P837 ?X . ?X wdt:P585 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {depicts} {colossal statue} that contains the word {statue} in their name",
    "uid": 31247,
    "subgraph": "string matching simple contains word",
    "template_index": 585,
    "question": "Tell me the elment with a depicted colossal statue whose name has the word statue in it",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P180 wd:Q1779653 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'statue')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know thing with a depicted colossal statue whose title has the word statue in it",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1779653 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'statue')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {career} of {tutor} of {Andreas Vesalius} ?",
    "uid": 15432,
    "subgraph": "right-subgraph",
    "template_index": 1439,
    "question": "What is tutor Andreas Vesalius' career?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q170267 wdt:P1066 ?X . ?X wdt:P106 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q170267> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1066>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who is the tutor of Andreas Vesalius?",
    "answers": [
      "anatomist",
      "medical historian",
      "astronomer",
      "physician",
      "mathematician",
      "anatomist",
      "physician",
      "professor",
      "anatomist",
      "physician writer",
      "university teacher",
      "anatomist"
    ]
  },
  {
    "NNQT_question": "What is the {secondary note} for {Pierre de Fermat} has {academic degree} as {Bachelor of Laws} ?",
    "uid": 31520,
    "subgraph": "statement_property",
    "template_index": 5235,
    "question": "Tell me the secondary note for Pierre de Fermat has academic degree as Bachelor of Laws?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q75655 p:P512 ?s . ?s ps:P512 wd:Q798137 . ?s pq:P7601 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "The secondary note Pierre de Fermat studied for academic degree in Bachelor or Laws?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q75655 p:P512 ?s . ?s ps:P512 wd:Q798137 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {capital of} of {applies to name of item} of {Innokenty Smoktunovsky} ?",
    "uid": 30567,
    "subgraph": "right-subgraph",
    "template_index": 1234,
    "question": "who county seat applies to Innokenty smoktunovsky name?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q380250 wdt:P5168 ?X . ?X wdt:P1376 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What name applies to Innokenty smoktunovsky county seat?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q380250 wdt:P20 ?X . ?X wdt:P1376 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is <World Heritage Tentative List ID> of <University of Tehran> ?",
    "uid": 26456,
    "subgraph": "center",
    "template_index": 753,
    "question": "what is the world heritage Tentative liste ID of  Univirsity of Tahran",
    "sparql_wikidata": "select distinct ?answer where { wd:Q737835 wdt:P4171 ?answer}",
    "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q737835> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P4171> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "answers": [
      "6201"
    ]
  },
  {
    "NNQT_question": "What is {head coach} of {CETS number} of {WrestleMania III} ?",
    "uid": 30645,
    "subgraph": "left-subgraph",
    "template_index": 38,
    "question": "Who is {club manager} of {CETS number} of {WrestleMania III} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q50817 wdt:P3968 ?X . ?X wdt:P286 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is {club supervisor} of {CETS number} of {WrestleMania III} ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q50817 wdt:P161 ?X . ?X wdt:P286 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {location of death} of {John Dowland}, that has {zipcode} is {BR} ?",
    "uid": 11920,
    "subgraph": "right-subgraph",
    "template_index": 2400,
    "question": "Where is the location of death of John Dowland whose zipcode is BR?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q207355 wdt:P20 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'BR'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q207355> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P281> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <BR> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Where is the area of passing of John Dowland whose zipcode is BR?",
    "answers": [
      "London"
    ]
  },
  {
    "NNQT_question": "What is {diplomatic relation} of {country of citizenship} of {Virgil} ?",
    "uid": 30591,
    "subgraph": "right-subgraph",
    "template_index": 4566,
    "question": "What are Virgil's national diplomatic relations?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1398 wdt:P27 ?X . ?X wdt:P530 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are Virgil's national discretionary relations?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q711391 wdt:P27 ?X . ?X wdt:P530 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {political ideology} are for {German Democratic Republic} ?",
    "uid": 31696,
    "subgraph": "statement_property",
    "template_index": 65,
    "question": "How many political ideologies did {German Democratic Republic} have?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q16957 wdt:P1142 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "The German Democratic Republic was based on how many political ideologies?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q16957 wdt:P6 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {type of quantum particle} with the {MAX(has contributing factor)} ?",
    "uid": 31078,
    "subgraph": "rank",
    "template_index": 371,
    "question": "which type of quantum particle has highest contributing factor?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q22675015 . ?ent wdt:P1479 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "What quantum particle has the highest contributing factor?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q22675015 . ?ent wdt:P2222 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {rector} of {Frederick William III of Prussia}",
    "uid": 30810,
    "subgraph": "center",
    "template_index": 1773,
    "question": "who is rector of Frederick William III of Prussia ?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1075 wd:Q37134}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1075 wd:Q57103}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {performer} are to/by {Angers} ?",
    "uid": 31726,
    "subgraph": "statement_property",
    "template_index": 1680,
    "question": "how many performances are by Angers?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P175 wd:Q38380 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Angers played how many live shows?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P175 wd:Q5928 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Sarajevo} has {twinned administrative body} as {Duluth} ?",
    "uid": 31485,
    "subgraph": "statement_property",
    "template_index": 5882,
    "question": "What is the beginning of Sarajevo's twinning with Duluth?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q11194 p:P190 ?s . ?s ps:P190 wd:Q485708 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When was the start of Sarajevo's twinning with Duluth?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q11194 p:P190 ?s . ?s ps:P190 wd:Q2274046 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {FIPS 55-3 (locations in the US)} of {Gelsenkirchen}",
    "uid": 30920,
    "subgraph": "center",
    "template_index": 2533,
    "question": "Which is the FIPS 55-3 (locations in the US) of Gelsenkirchen?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q2765 wdt:P774 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q43301 wdt:P774 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located in the administrative territorial entity} of {Imereti} and {end time}",
    "uid": 32015,
    "subgraph": [],
    "template_index": 1508,
    "question": "Who is in the administrative territorial entity of Imereti and when is the end time?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q200045 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P582 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Who is within the authoritative regional substance of Imereti and when is the conclusion time?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q994 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P582 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {using} of {remake of} of {smoothsort} ?",
    "uid": 17315,
    "subgraph": "left-subgraph",
    "template_index": 6,
    "question": "what is the using of the remake of smoothsort?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1714823 wdt:P144 ?X . ?X wdt:P2283 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1714823> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P144>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2283> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "what is the utilizing of the change of smoothsort?",
    "answers": [
      "array data structure"
    ]
  }
]