[
  {
    "NNQT_question": "What is the {country of citizenship} and the {printed by} of {Kelly Clarkson} ?",
    "uid": 31954,
    "subgraph": "two intentions right subgraph",
    "template_index": 518,
    "question": "Who printed Kelly Clarkson and where is she a citizen?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q483507 wdt:P27 ?ans_1 . wd:Q483507 wdt:P872 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "is Kelly Clarkson a citizen and she was printed by whom?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q483507 wdt:P27 ?ans_1 . wd:Q483507 wdt:P106 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {kinship} that contains the word {uncle} in their name",
    "uid": 23454,
    "subgraph": "string matching simple contains word",
    "template_index": 2743,
    "question": "Tell me kinship whose name has the word uncle in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q171318 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'uncle')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q171318>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'uncle')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know family relationship whose title has the word uncle in it.",
    "answers": [
      "uncle",
      "great-granduncle",
      "maternal uncle or aunt",
      "paternal uncle or aunt",
      "18th great-granduncle",
      "19th great-granduncle",
      "17th great-granduncle",
      "21st great-granduncle",
      "20th great-granduncle",
      "23rd great-granduncle",
      "22nd great-granduncle",
      "25th great-granduncle",
      "24th great-granduncle",
      "27th great-granduncle",
      "26th great-granduncle",
      "30th great-granduncle",
      "28th great-granduncle",
      "29th great-granduncle",
      "32nd great-granduncle",
      "31st great-granduncle",
      "34th great-granduncle",
      "33rd great-granduncle",
      "36th great-granduncle",
      "35th great-granduncle",
      "38th great-granduncle"
    ]
  },
  {
    "NNQT_question": "What is {field of this work} of {work} of {José Luis Rodríguez Zapatero} ?",
    "uid": 15976,
    "subgraph": "right-subgraph",
    "template_index": 1548,
    "question": "In what field of work does José Luis Rodríguez Zapatero work in?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q41395 wdt:P106 ?X . ?X wdt:P425 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q41395> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P425> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "In what discipline of work does José Luis Rodríguez Zapatero work in?",
    "answers": [
      "politics",
      "executive branch"
    ]
  },
  {
    "NNQT_question": "What is the {monastery} for {hair color} of {Russian Orthodox Church}",
    "uid": 31798,
    "subgraph": "simple question right",
    "template_index": 1367,
    "question": "Mention the hair color monastery of the Russian Orthodox Church monastery.",
    "sparql_wikidata": " select distinct ?obj where { wd:Q60995 wdt:P1884 ?obj . ?obj wdt:P31 wd:Q44613 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Say the hair color monastery of the Russian Standard Church monastery.",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q60995 wdt:P159 ?obj . ?obj wdt:P31 wd:Q44613 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {produced sound} of {Maldives} that is {point in time} is {1967-01-01} ?",
    "uid": 31299,
    "subgraph": "statement_property",
    "template_index": 1756,
    "question": "What was the produced sound of the Maldives in 1967?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q826 p:P4733 ?s . ?s ps:P4733 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1967')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was the produced sound in the Maldives in 1967?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q826 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1967')) }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {father} of {spouse} of {Belfast} ?",
    "uid": 30496,
    "subgraph": "left-subgraph",
    "template_index": 8,
    "question": "Who is the father of Belfast's husband?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q10686 wdt:P26 ?X . ?X wdt:P22 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the name of Belfast's husband's father?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q169794 wdt:P26 ?X . ?X wdt:P22 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Olga Tokarczuk} that is {point in time} is {2015-0-0} ?",
    "uid": 5550,
    "subgraph": "statement_property",
    "template_index": 1995,
    "question": "What award did Olga Tokarczuk receive in 2015?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q254032 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2015')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q254032> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2015-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Olga Tokarczuk was the winner of what award in 2015?",
    "answers": [
      "Brückepreis",
      "Nike Award"
    ]
  },
  {
    "NNQT_question": "What is the {protein synthesis inhibitors} for {significant drug interaction} of {erythromycin}",
    "uid": 31871,
    "subgraph": "simple question right",
    "template_index": 1924,
    "question": "What is the protein synthesis inhibitors of erythromycin when interacting with a significant drug?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q213511 wdt:P769 ?obj . ?obj wdt:P31 wd:Q7251505 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Title the protein synthesis inhibitors used for significant drug interactions with erythromycin.",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q213511 wdt:P769 ?obj . ?obj wdt:P31 wd:Q11173 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Greek deity} that starts with {'z'}",
    "uid": 24127,
    "subgraph": "string matching simple contains word",
    "template_index": 1996,
    "question": "What are the Greek deity which start with the letter Z",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22989102 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q22989102>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the Greek divinity which begin with the letter Z",
    "answers": [
      "Zeus",
      "Zelus",
      "Zagreus"
    ]
  },
  {
    "NNQT_question": "What is {station class} of {nitrous oxide} that is {solvent} is {water} ?",
    "uid": 31310,
    "subgraph": "statement_property",
    "template_index": 2803,
    "question": "What is { station class } of { nitrous oxide } { solvent } is { water }?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q905750 p:P5606 ?s . ?s ps:P5606 ?obj . ?s pq:P2178 wd:Q283 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What is { station class } of { nitrous oxide } { dissolvable } is { water }?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q905750 p:P2177 ?s . ?s ps:P2177 ?obj . ?s pq:P2178 wd:Q283 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {titleholder} of {nomination received} of {Jennifer Capriati} ?",
    "uid": 15372,
    "subgraph": "left-subgraph",
    "template_index": 127,
    "question": "Who gave the {titleholder} of {nomination received} of {Jennifer Capriati} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q11680 wdt:P1411 ?X . ?X wdt:P1346 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q11680> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1346> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who gave the {titleholder} of {assignment gotten} of {Jennifer Capriati} ?",
    "answers": [
      "Félix Sánchez",
      "Hermann Maier",
      "Lance Armstrong",
      "Rafael Nadal",
      "Serena Williams",
      "Jennifer Capriati",
      "Kim Clijsters",
      "Vitaliy Klitschko",
      "Martina Hingis",
      "Valentino Rossi",
      "Alex Zanardi",
      "Goran Ivanišević",
      "Paula Radcliffe",
      "Ronaldo",
      "Darren Clarke",
      "Vivian Cheruiyot",
      "Jessica B. Hill",
      "Yelena Isinbayeva",
      "Lindsey Vonn",
      "Janica Kostelić",
      "Serena Williams",
      "Jennifer Capriati",
      "Justine Henin",
      "Missy Franklin",
      "Marion Jones",
      "Kelly Holmes",
      "Annika Sörenstam",
      "Cathy Freeman",
      "Genzebe Dibaba",
      "Lance Armstrong",
      "Jennifer Capriati",
      "Kim Clijsters",
      "Michael Jordan",
      "Dan Marino",
      "Russell Westbrook",
      "Dara Torres",
      "Bethany Hamilton",
      "Evander Holyfield",
      "Mario Lemieux",
      "Adrian Peterson",
      "Roger Clemens",
      "Tedy Bruschi",
      "Josh Hamilton",
      "Matthew Stafford",
      "Andrés Galarraga",
      "Dave Winfield",
      "Rob Gronkowski",
      "Eric Davis",
      "Tommy Maddox",
      "Mark Fields"
    ]
  },
  {
    "NNQT_question": "How many {architect} are for {St. Peter's Basilica} ?",
    "uid": 1610,
    "subgraph": "statement_property",
    "template_index": 610,
    "question": "How many architects worked on the St. Peter's Basilica?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q12512 wdt:P84 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q12512> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P84> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What is the total number of architects that worked on St Peter's Basilica?",
    "answers": [
      "13"
    ]
  },
  {
    "NNQT_question": "What is {posthumous name} of {follows} of {Romance Revisited: The Love Songs of Jose Mari Chan} ?",
    "uid": 30654,
    "subgraph": "left-subgraph",
    "template_index": 1,
    "question": "What is the posthumous name of \"Sentiment Returned to: The Tunes of Jose Mari Chan\" predecessor?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q12508854 wdt:P155 ?X . ?X wdt:P1786 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is \"Romance Revisited: The Songs of Jose Mari Chan\" predecessor posthumous name?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q12508854 wdt:P155 ?X . ?X wdt:P175 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {position held} of {Martin Van Buren} that is {owner of} is {Edward Livingston} ?",
    "uid": 31325,
    "subgraph": "statement_property",
    "template_index": 2954,
    "question": "Edward Livingston was owned by Martin Van Buren in what postion?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q11820 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1830 wd:Q544396 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Edward Livingston was possessed by Martin Van Buren in what postion?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q11820 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q544396 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {footedness} of {Jonas Salk}",
    "uid": 31811,
    "subgraph": "simple question right",
    "template_index": 1654,
    "question": "Who was Jonas Salk's footedness?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q200101 wdt:P8006 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who was Jonas Salk's footedness?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q200101 wdt:P185 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {place of death} of {John Nevil Maskelyne}, that has {different from} is {Buenos Aires} ?",
    "uid": 30474,
    "subgraph": "right-subgraph",
    "template_index": 1526,
    "question": "What city different from Buenos Aires did John Nevil Maskelyne die in?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q965961 wdt:P20 ?answer . ?answer wdt:P1889 wd:Q1486}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What city different from Buenos Aires did John Nevil Maskelyne die in?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q965961 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1486}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {has sons} of {brother} of {Atahualpa} ?",
    "uid": 14871,
    "subgraph": "left-subgraph",
    "template_index": 31,
    "question": "Which brother of Atahualpa has sons?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q179577 wdt:P3373 ?X . ?X wdt:P40 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q179577> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3373>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P40> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which sibling of Atahualpa has children?",
    "answers": [
      "Maytanchi",
      "Túpac Amara",
      "Titu Cusi",
      "Sayri Túpac",
      "Francisca Pizarro Yupanqui"
    ]
  },
  {
    "NNQT_question": "What is {educated at} of {Mexicali} and {academic major}",
    "uid": 31997,
    "subgraph": [],
    "template_index": 1127,
    "question": "Where and what did Mexicali study?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q199440 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What was Mexicali's field of study and where did she study it?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q272637 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nominated for} of {Simferopol} that is {point in time} is {1977-01-01} ?",
    "uid": 31286,
    "subgraph": "statement_property",
    "template_index": 5800,
    "question": "Simferopol was nominated for what at what time?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q19566 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1977')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "When was Simferopol nominated and for what?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q359552 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1977')) }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {subject has role} and the {location of discovery} of {Iodine} ?",
    "uid": 9930,
    "subgraph": "two intentions right subgraph",
    "template_index": 531,
    "question": "Which the {subject has role} and the {location of discovery} of {Iodine} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q1103 wdt:P2868 ?ans_1 . wd:Q1103 wdt:P189 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1103> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2868> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1103> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P189> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What does iodine do and where was it discovered?",
    "answers": [
      "Paris",
      "trace metal",
      "Paris",
      "local anti-infective agent"
    ]
  },
  {
    "NNQT_question": "What is {father} of {spouse} of {Giovanni Boccaccio} ?",
    "uid": 30589,
    "subgraph": "left-subgraph",
    "template_index": 119,
    "question": "Who is the child of Giovanni Boccaccio's life partner?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1402 wdt:P26 ?X . ?X wdt:P22 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is the child of Giovanni Boccaccio's life partner?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1986025 wdt:P26 ?X . ?X wdt:P22 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {position held} of {James Bryant Conant} that is {replaces} is {Nathan M. Pusey} ?",
    "uid": 31461,
    "subgraph": "statement_property",
    "template_index": 4245,
    "question": "Nathan M. Pusey was replaced by James Bryant Conant in what position?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q49355 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q1772795 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "For what purpose James Bryant Conant was replaced by Nathan M. Pusey?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q49355 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q1772795 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {comedic television series} for {voice actor} of {Phil LaMarr}",
    "uid": 30321,
    "subgraph": "simple question left",
    "template_index": 3974,
    "question": "What comedic television series does Phil LaMarr voice in?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P725 wd:Q356541 . ?sbj wdt:P31 wd:Q22812458 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "In what comedic television series is Phil LaMarr one of the voice actors?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P725 wd:Q356541 . ?sbj wdt:P31 wd:Q581714 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {total fertility rate} of {Slovakia} that is {periapsis date} is {estimation process} ?",
    "uid": 31309,
    "subgraph": "statement_property",
    "template_index": 1652,
    "question": "What is the rate of Slovakia fertility which periapsis date is estimation process?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q214 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P2285 wd:Q791801 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Slovakian fertility is at what rate with a periapsis date of estimation process?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q214 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P459 wd:Q791801 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {category combines topics} of {culture} of {Hadrian's Wall} ?",
    "uid": 30735,
    "subgraph": "right-subgraph",
    "template_index": 487,
    "question": "Which categories combines topics are associated with the civilisation of Hadrian's Wall?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q57357 wdt:P2596 ?X . ?X wdt:P971 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which categories combines topics are related with the civilisation of Hadrian's Divider?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q57357 wdt:P2596 ?X . ?X wdt:P1792 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {social media followers} of {Democratic Party} that is {based on heuristic} is {party identification} ?",
    "uid": 31440,
    "subgraph": "statement_property",
    "template_index": 1571,
    "question": "How many people self-identify as Democrats social media followers?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q29552 p:P8687 ?s . ?s ps:P8687 ?obj . ?s pq:P887 wd:Q7141040 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Give me the number of people self-identify as Democrats social media followers?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q29552 p:P2124 ?s . ?s ps:P2124 ?obj . ?s pq:P887 wd:Q7141040 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {physical quantity} of {millimetre}, that has {symbol} is {L} ?",
    "uid": 11822,
    "subgraph": "right-subgraph",
    "template_index": 2,
    "question": "The physical quantity of a millimetre is represented by the symbol L. Which is it?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q174789 wdt:P111 ?answer . ?answer wdt:P416 ?x FILTER(contains(?x,'L'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q174789> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P111>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P416> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <L> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "The symbol L represents the physical quantity of a millimetre. Which one is that?",
    "answers": [
      "length"
    ]
  },
  {
    "NNQT_question": "Give me {guide book} that contains the word {ארץ} in their name",
    "uid": 23602,
    "subgraph": "string matching simple contains word",
    "template_index": 859,
    "question": "Tell me fictional detective whose name has the word sam in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223638 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ארץ')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q223638>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ארץ')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me a fictional detective whose name includes the word sam.",
    "answers": [
      "מדריך ארץ ישראל"
    ]
  },
  {
    "NNQT_question": "What is {subsidiary} of {Giphy username} of {Carabao} ?",
    "uid": 30662,
    "subgraph": "right-subgraph",
    "template_index": 26,
    "question": "Who is the parent company of the Giphy username of Carabao?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1035286 wdt:P4013 ?X . ?X wdt:P355 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which parent company owns the Giphy username of Carabao?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1035286 wdt:P264 ?X . ?X wdt:P355 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Harmonized System Code} {superhero} that contains the word {wolfsbane} in their name",
    "uid": 31205,
    "subgraph": "string matching simple contains word",
    "template_index": 3011,
    "question": "Tell me thing with superhero Harmonized System Code that contains the word wolfsbane in their name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P5471 wd:Q188784 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wolfsbane')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know element with superhero Harmonized System Code that contains the word wolfsbane in their title",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188784 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wolfsbane')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {opposite of} of {depicts} of {The Buffoon el Primo} ?",
    "uid": 30608,
    "subgraph": "left-subgraph",
    "template_index": 4476,
    "question": "Which is antonym of painting of The Buffoon el Primo?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q729194 wdt:P180 ?X . ?X wdt:P461 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Give the antonym of the painting of The Buffoon el Primo.",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q3889219 wdt:P180 ?X . ?X wdt:P461 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]