[
  {
    "NNQT_question": "What is {population} of {Maluku Islands} that is {point in time} is {1988-01-01} ?",
    "uid": 31407,
    "subgraph": "statement_property",
    "template_index": 5673,
    "question": "What was the population of Maluku Islands on 0-0-1988?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q3827 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1988')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was the population of Maluku Islands in 1988?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q23635 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1988')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {biogeochemical cycle} that contains the word {cycle} in their name",
    "uid": 23692,
    "subgraph": "string matching simple contains word",
    "template_index": 1254,
    "question": "Tell me biogeochemical cycle whose name has the word cycle in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q846303 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cycle')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q846303>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cycle')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me about the biogeochemical cycle whose name contains the word cycle.",
    "answers": [
      "Earth water cycle",
      "carbon cycle",
      "phosphorus cycle",
      "oxygen cycle",
      "manganese cycle",
      "fluorine cycle",
      "copper cycle",
      "vanadium cycle",
      "aluminum cycle",
      "lithium cycle",
      "boron cycle",
      "arsenic cycle",
      "bromine cycle",
      "cadmium cycle",
      "chlorine cycle",
      "chromium cycle",
      "iron cycle",
      "selenium cycle",
      "calcium cycle",
      "silicon cycle",
      "rock cycle",
      "sulfur cycle",
      "hydrogen cycle",
      "mercury cycle"
    ]
  },
  {
    "NNQT_question": "What is the {creative work} for {different from} of {HTML5}",
    "uid": 30332,
    "subgraph": "simple question left",
    "template_index": 131,
    "question": "Which creative works is different from HTML5?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1889 wd:Q2053 . ?sbj wdt:P31 wd:Q17537576 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are some examples of creative works different from HTML5?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P747 wd:Q2053 . ?sbj wdt:P31 wd:Q17537576 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {has grammatical person} of {language read} of {George Michael} ?",
    "uid": 15964,
    "subgraph": "right-subgraph",
    "template_index": 314,
    "question": "Who speaks the same language of George Michael?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q130311 wdt:P1412 ?X . ?X wdt:P5110 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q130311> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1412>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P5110> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "In reference to George Michael, who are the people who speak the same language as him?",
    "answers": [
      "first-person singular",
      "first-person plural",
      "second-person singular",
      "second-person plural",
      "third-person plural",
      "third-person masculine singular",
      "third-person feminine singular",
      "third-person neuter singular"
    ]
  },
  {
    "NNQT_question": "How many {terminus} are to/by {Vienna} ?",
    "uid": 1695,
    "subgraph": "statement_property",
    "template_index": 1039,
    "question": "How many terminus are in Vienna",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P559 wd:Q1741 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P559> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q1741 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "how many vienna in terminus",
    "answers": [
      "5"
    ]
  },
  {
    "NNQT_question": "What is {significant event} of {conflict} of {Hosni Mubarak} ?",
    "uid": 30742,
    "subgraph": "left-subgraph",
    "template_index": 307,
    "question": "What significant event was in charge of Hosni Mubarak's sentence?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q34105 wdt:P607 ?X . ?X wdt:P793 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What significant event was responsible for the sentence of Hosni Mubarak?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q34105 wdt:P607 ?X . ?X wdt:P710 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {history of a country or state} that {surface roughness} {Israel} and which that starts with {'h'}",
    "uid": 31922,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2614,
    "question": "Name a country with Israel as surface roughness that starts with letter H",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17544377 . ?sbj wdt:P7083 wd:Q801 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "Name a country with Israel surface roughness starting with letter H",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17544377 . ?sbj wdt:P1269 wd:Q801 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {glucan} with the {MAX(minimum explosive concentration)} ?",
    "uid": 31094,
    "subgraph": "rank",
    "template_index": 136,
    "question": "What is the element belonging to glucan class and with highest minimum explosive concentration?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P279 wd:Q416796 . ?ent wdt:P2204 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "Considering elements belonging to glucan class, which one has the most minimum explosive concentration?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q416796 . ?ent wdt:P2204 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {online dictionary} that {Erdős number} {John Simpson} and which contains the word {dictionary} in their name",
    "uid": 31921,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1996,
    "question": "Name an online dictionary with a Erdős number of John Simpson that contains the word \"dictionnary\" in its name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3327521 . ?sbj wdt:P2021 wd:Q6257950 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'dictionary')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Name an on line dictionary with John Simpson as Erdős number that includes the phrase \"dictionnary\" in its name",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3327521 . ?sbj wdt:P50 wd:Q6257950 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'dictionary')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {Pleiades ID} are for {Sioux Falls} ?",
    "uid": 31713,
    "subgraph": "statement_property",
    "template_index": 561,
    "question": "What are the Pleiades IDs for Sioux Falls?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q131335 wdt:P1584 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Give me the Pleiades IDs for Sioux Falls.",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q131335 wdt:P281 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {EIDR content ID} of {The Broken Coin}",
    "uid": 30916,
    "subgraph": "center",
    "template_index": 456,
    "question": "Which is the EIDR identifier of The Broken Coin?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q24732 wdt:P2704 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q11621 wdt:P2704 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {position angle} and the {location} of {Pacific War} ?",
    "uid": 31953,
    "subgraph": "two intentions right subgraph",
    "template_index": 14,
    "question": "Which is the {position angle} and the {location} of {Pacific_War} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q184425 wdt:P2211 ?ans_1 . wd:Q184425 wdt:P276 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What was the position angle of the pacific war and where did it take place?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q184425 wdt:P710 ?ans_1 . wd:Q184425 wdt:P276 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located in or next to body of water} of {Kryvyi Rih}, that has {tributary} is {Heze} ?",
    "uid": 30366,
    "subgraph": "right-subgraph",
    "template_index": 2761,
    "question": "What is located near Kryvyi Rih, which tributary is Heze?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q157137 wdt:P206 ?answer . ?answer wdt:P974 wd:Q332753}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name the object located near Kryvyi Rih that has Heze as tributary",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q157137 wdt:P206 ?answer . ?answer wdt:P974 wd:Q1633893}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {child} of {Pompey} that is {mother} is {Cape Verde} ?",
    "uid": 31280,
    "subgraph": "statement_property",
    "template_index": 5350,
    "question": "Who is the child of Pompey and the mother, Cape Verde?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q125414 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P25 wd:Q1011 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What kid did Pompey and Cape Verde have?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q125414 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P25 wd:Q273616 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {tabular case data} of {isopropyl alcohol}",
    "uid": 30879,
    "subgraph": "center",
    "template_index": 3520,
    "question": "What is the tabular case data for isopropyl alcohol?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q16392 wdt:P8204 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q16392 wdt:P2072 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {speaker} are to/by {Cédric Goubet} ?",
    "uid": 31759,
    "subgraph": "statement_property",
    "template_index": 1593,
    "question": "Who is the speaker Cédric Goubet?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P823 wd:Q3009896 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Tell me about speaker Cédric Goubet.",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P823 wd:Q329 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {facet of} {history of a country or state} that starts with {'h'}",
    "uid": 31254,
    "subgraph": "string matching simple contains word",
    "template_index": 2729,
    "question": "Tell me the facet of history of a country or state that starts with the letter h",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P1269 wd:Q17544377 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Reveal  me the facet of history of a country or state that starts with the letter h",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17544377 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {colossal statue} that contains the word {statue} in their name",
    "uid": 23784,
    "subgraph": "string matching simple contains word",
    "template_index": 585,
    "question": "Tell me colossal statue whose name has the word statue in it",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1779653 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'statue')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1779653>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'statue')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know colossal statue whose title has the word statue in it",
    "answers": [
      "Statue of Zeus at Olympia",
      "Genghis Khan Equestrian Statue",
      "Colossal Statue of Shapur I",
      "Peter the Great Statue",
      "Dilapidated Bundela temple with a colossal statue of Tirthankar called linga with two short inscriptions",
      "Statue of Chao Mae Kuan Im",
      "Colossal statue of Shri Hanuman",
      "Buddha Statue of Hyderabad",
      "Maligawila Buddha statue",
      "Statue of Ramesses II",
      "Avukana Buddha statue",
      "Gommateshwara statue",
      "Great Buddha Statue of Baguashan",
      "Dhyana Buddha statue",
      "Mao Zedong Statue",
      "Peace Statue",
      "Statue of Erechtheus",
      "Statue of Dizang",
      "Tianen Maitreya statue"
    ]
  },
  {
    "NNQT_question": "What is {award received} of {Shimon Peres} and {replaces}",
    "uid": 32039,
    "subgraph": [],
    "template_index": 516,
    "question": "Shimon Peres won what award and who did he replace?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q57410 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1365 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Shimon Peres won what grant and who did he replace?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q57410 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Revised Hepburn romanization} for {Pocket Girls} has {name in kana} as {モーニングむすめ} ?",
    "uid": 31625,
    "subgraph": "statement_property",
    "template_index": 3848,
    "question": "What is the Revised Hepburn romanization for Pocket Girls with its name in kana モーニングむすめ?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q97656993 p:P1814 ?s . ?s ps:P1814 ?x filter(contains(?x,'モーニングむすめ')) . ?s pq:P2125 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "How do you apply a Revised Hepburn romanization for Pocket Girls with its name in kana...",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q174291 p:P1814 ?s . ?s ps:P1814 ?x filter(contains(?x,'モーニングむすめ')) . ?s pq:P2125 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {child} of {sibling} of {Huayna Capac} ?",
    "uid": 30686,
    "subgraph": "left-subgraph",
    "template_index": 31,
    "question": "Which brother of Huayna Capac has sons?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q311433 wdt:P3373 ?X . ?X wdt:P40 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which sibling of Huayna Capac has children?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q179577 wdt:P3373 ?X . ?X wdt:P40 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {present in work} of {based on} of {Iquitos} ?",
    "uid": 30511,
    "subgraph": "left-subgraph",
    "template_index": 9,
    "question": "Who gave the {is shown in} of {based upon} of {Iquitos} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q193289 wdt:P144 ?X . ?X wdt:P1441 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who gave the {is appeared in} of {based upon} of {Iquitos} ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q774772 wdt:P144 ?X . ?X wdt:P1441 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {religion} of {father} of {Ibn Hajar al-Asqalani} ?",
    "uid": 30520,
    "subgraph": "right-subgraph",
    "template_index": 252,
    "question": "What is the religious affiliation of Ibn Hajar al-Asqalani's child?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q471116 wdt:P22 ?X . ?X wdt:P140 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the spiritual affiliation of Ibn Hajar al-Asqalani's child?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q14974 wdt:P22 ?X . ?X wdt:P140 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Vittorio De Sica} has {nominated for} as {Roger Williams} ?",
    "uid": 31488,
    "subgraph": "statement_property",
    "template_index": 1080,
    "question": "When was Vittorio De Sica nominated for a Roger Williams?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q53004 p:P1411 ?s . ?s ps:P1411 wd:Q391591 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When was Vittoria De Sica nominated for Roger Williams?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q53004 p:P1411 ?s . ?s ps:P1411 wd:Q106291 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {surface played on} of {Chow Yun-fat}",
    "uid": 30262,
    "subgraph": "simple question left",
    "template_index": 1094,
    "question": "Who is the human surface played on Chow Yun-fat?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P765 wd:Q181425 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the human surface played on Chow Yun-fat",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P451 wd:Q181425 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {significant event} of {Laser Interferometer Gravitational-Wave Observatory} that is {start time} is {1994-0-0} ?",
    "uid": 5696,
    "subgraph": "statement_property",
    "template_index": 2141,
    "question": "What is the significant event held in the beginning of Laser Interferometer Gravitational-Wave Observatory in 1994",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q255371 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1994')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q255371> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P793> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1994-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What happened in 1994 at the start of the Observatory?",
    "answers": [
      "construction"
    ]
  },
  {
    "NNQT_question": "What is {commodity} of {built by} of {HH-60 Jayhawk} ?",
    "uid": 17726,
    "subgraph": "left-subgraph",
    "template_index": 1855,
    "question": "What was the HH-60 Jayhawk developed from?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1892024 wdt:P176 ?X . ?X wdt:P1056 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1892024> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P176>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1056> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What was the HH-60 Jayhawk created from?",
    "answers": [
      "helicopter"
    ]
  },
  {
    "NNQT_question": "What is {date of death} of {Leonardo Bonacci} that is {earliest date} is {1240-0-0} ?",
    "uid": 7990,
    "subgraph": "statement_property",
    "template_index": 4435,
    "question": "What was Leonardo Bonacci's date of death in the year 1240?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q8763 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1319 ?x filter(contains(YEAR(?x),'1240')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q8763> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P570> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P1319> <1240-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "On what date did Leonardo Bonacci die in 1240?",
    "answers": [
      "1240-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "Give me {glass transition temperature} {branch of science} that starts with {'v'}",
    "uid": 31204,
    "subgraph": "string matching simple contains word",
    "template_index": 2649,
    "question": "What object with a glass transition temperature of branch of science starts with the letter \"v\"?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P5670 wd:Q2465832 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What element having a glass transition temperature of department of science begins with the letter \"v\"?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2465832 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {position} for {fax number} of {Jacinda Ardern}",
    "uid": 30257,
    "subgraph": "simple question left",
    "template_index": 666,
    "question": "What is Jacinda Ardern's fax number position?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2900 wd:Q3606816 . ?sbj wdt:P31 wd:Q4164871 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What fax number position does Jacinda Ardern's serve?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1308 wd:Q3606816 . ?sbj wdt:P31 wd:Q4164871 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {publisher} of {The Murder of Roger Ackroyd}, that has {work period (start)} is {1920-01-01} ?",
    "uid": 30424,
    "subgraph": "right-subgraph",
    "template_index": 2217,
    "question": "Who is the publisher of \"The Murder of Roger Ackroyd\", which has been active since 1920-0-0?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q224078 wdt:P123 ?answer . ?answer wdt:P2031 ?x FILTER(contains(YEAR(?x),'1920'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the publisher of \"The Murder of Roger Ackroyd\", which has been energetic when you consider that 1920-0-0?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q224078 wdt:P50 ?answer . ?answer wdt:P2031 ?x FILTER(contains(YEAR(?x),'1920'))}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {authority} of {sport} of {Cyclops} ?",
    "uid": 30596,
    "subgraph": "right-subgraph",
    "template_index": 9,
    "question": "Who is {executive authority} of {play} {Cyclops} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q5198978 wdt:P641 ?X . ?X wdt:P797 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is Cyclops sport authority?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q2000617 wdt:P641 ?X . ?X wdt:P797 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Women's Sports Foundation ID} of {George Washington}",
    "uid": 31000,
    "subgraph": "center",
    "template_index": 1425,
    "question": "What is the Women's Sports Foundation ID for George Washington?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q23 wdt:P4377 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q2406028 wdt:P4377 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {solvent} for {normalized Unicode character} of {water}",
    "uid": 30305,
    "subgraph": "simple question left",
    "template_index": 645,
    "question": "What is the solvent of water normalized Unicode character?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P5591 wd:Q283 . ?sbj wdt:P31 wd:Q146505 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the solvent that is water normalized Unicode character",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1557 wd:Q283 . ?sbj wdt:P31 wd:Q146505 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]