[
  {
    "NNQT_question": "What is {nominated for} of {Robert Donat} that is {Microsoft MVP profile ID} is {Goodbye, Mr. Chips} ?",
    "uid": 31394,
    "subgraph": "statement_property",
    "template_index": 2547,
    "question": "What was Robert Donat nominated for with Microsoft MVP profile ID of Goodbye, Mr. Chips?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q116983 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P9125 wd:Q43228 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which award was nominated to Robert Donat with Microsoft MVP profile ID of Goodbye, Mr. Chips?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q116983 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q43228 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Entomologists of the World ID} of {Danaus plexippus}",
    "uid": 30951,
    "subgraph": "center",
    "template_index": 3813,
    "question": "Which is Entomologists of the World ID for Danaus plexippus?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q212398 wdt:P5370 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q212398 wdt:P1744 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {historical region} for {part of} of {classical antiquity}",
    "uid": 31890,
    "subgraph": "simple question right",
    "template_index": 2338,
    "question": "Which is the historical region part of the classical antiquity?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q486761 wdt:P361 ?obj . ?obj wdt:P31 wd:Q1620908 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name the historical entity part of the ancient antiquity.",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q486761 wdt:P706 ?obj . ?obj wdt:P31 wd:Q1620908 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {contains administrative territorial entity} of {Lower Saxony}, that has {choral conductor} is {Maade} ?",
    "uid": 30389,
    "subgraph": "right-subgraph",
    "template_index": 8364,
    "question": "What are the territorial entities of Lower Saxony that have Maade as choral conductor?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1197 wdt:P150 ?answer . ?answer wdt:P5024 wd:Q1882240}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the Lower Saxony places with Maade as choral conductor?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1197 wdt:P150 ?answer . ?answer wdt:P206 wd:Q1882240}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {markup language} for {has edition or translation} of {HyperText Markup Language}",
    "uid": 30314,
    "subgraph": "simple question left",
    "template_index": 3096,
    "question": "What markup language is HyperText Markup Language based on?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P747 wd:Q62626012 . ?sbj wdt:P31 wd:Q37045 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me what markup language is HyperText Markup Language based on",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P747 wd:Q2053 . ?sbj wdt:P31 wd:Q37045 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {imprint} for {employer} of {50 Cent}",
    "uid": 31886,
    "subgraph": "simple question right",
    "template_index": 678,
    "question": "What is the employer that 50 Cent belongs to called",
    "sparql_wikidata": " select distinct ?obj where { wd:Q6060 wdt:P108 ?obj . ?obj wdt:P31 wd:Q2608849 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the employer that 50 Cent has a place to called",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q6060 wdt:P264 ?obj . ?obj wdt:P31 wd:Q2608849 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {municipal archive} for {archives at} of {Uriage-les-Bains}",
    "uid": 31829,
    "subgraph": "simple question right",
    "template_index": 466,
    "question": "Who is the {municipal archive} for {archives at} of {Uriage-les-Bains}",
    "sparql_wikidata": " select distinct ?obj where { wd:Q3552293 wdt:P485 ?obj . ?obj wdt:P31 wd:Q604177 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Where are the archives of Uriage-les-Bains?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q1017 wdt:P485 ?obj . ?obj wdt:P31 wd:Q604177 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Harlan Ellison} that is {for work} is {Life Hutch} ?",
    "uid": 31429,
    "subgraph": "statement_property",
    "template_index": 5050,
    "question": "What is award received of Harlan Ellison that is  work is Life Hutch ?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q311253 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q19481993 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Life Hutch creator, Harlan Ellison, received what award for the work?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q311253 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q4540312 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {author of afterword} of {Thutmose I}",
    "uid": 30774,
    "subgraph": "center",
    "template_index": 2405,
    "question": "Which is the author of afterword of Thutmose I?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P2680 wd:Q157962}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P2680 wd:Q57085}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {population} of {residence} of {Willy Brandt} ?",
    "uid": 30752,
    "subgraph": "right-subgraph",
    "template_index": 140,
    "question": "How many inhabitants does Willy Brandt's residence have?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2514 wdt:P551 ?X . ?X wdt:P1082 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Give me the number of inhabitants of Willy Brandt's residence.",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q2514 wdt:P937 ?X . ?X wdt:P1082 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {educated at} of {Reese Hoffa} and {academic major}",
    "uid": 32014,
    "subgraph": [],
    "template_index": 684,
    "question": "Where and what did Reese Hoffa study?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q1760 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Where and what did Reese Hoffa ponder?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q465700 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {history of a country or state} that {facet of} {Israel} and which that starts with {'h'}",
    "uid": 25503,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2614,
    "question": "Name a country related to Israel that starts with letter H",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17544377 . ?sbj wdt:P1269 wd:Q801 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q17544377>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1269> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q801>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "Name a Israel - related country starting with letter H",
    "answers": [
      "history of Israel"
    ]
  },
  {
    "NNQT_question": "What is {place of death} of {Joseph Lister, 1st Baron Lister} that is {start time} is {1902-01-01} ?",
    "uid": 31381,
    "subgraph": "statement_property",
    "template_index": 3204,
    "question": "Tell me the place of death by Joseph Lister, 1st Baron Lister in the year 1902 and thereafter.",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q155768 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1902')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was Joseph Lister, 1st Baron Lister place of death from 1902 onward?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q155768 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1902')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {statement is subject of} for {Joseph Stalin} has {nominated for} as {Academy Award for Best Actress} ?",
    "uid": 31555,
    "subgraph": "statement_property",
    "template_index": 2849,
    "question": "What were the statements when Joseph Stalin got nominated for the Academy Award for Best Actress?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q855 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P805 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What statements were made when Joseph Stalin was nominated for Best Actress?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q159778 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P805 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {conflict} of {Alfred Dreyfus}, that has {location} is {Palestine} ?",
    "uid": 30409,
    "subgraph": "right-subgraph",
    "template_index": 423,
    "question": "What is the conflict in Palestine that involved Alfred Dreyfus?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q171826 wdt:P607 ?answer . ?answer wdt:P276 wd:Q23792}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Alfred Dreyfus participated in what war in Palestine?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q171826 wdt:P607 ?answer . ?answer wdt:P276 wd:Q55643}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Luther city} that contains the word {worms} in their name",
    "uid": 23511,
    "subgraph": "string matching simple contains word",
    "template_index": 1912,
    "question": "Name a Luther city that contain the word \"worms \" in its name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1547289 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'worms')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1547289>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'worms')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name a Luther town in its name containing the word \"worms\"",
    "answers": [
      "Worms"
    ]
  },
  {
    "NNQT_question": "How many {archives at} are for {Nanchang} ?",
    "uid": 31674,
    "subgraph": "statement_property",
    "template_index": 467,
    "question": "How many of the archives are for Nanchang?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q171943 wdt:P485 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Out of the archives, which are for Nanchang?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q11641 wdt:P485 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {ethnic group} of {country} of {martial arts} ?",
    "uid": 30526,
    "subgraph": "right-subgraph",
    "template_index": 396,
    "question": "who culture of state of martial arts ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q11417 wdt:P17 ?X . ?X wdt:P172 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Martial arts has what kind of culture?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q181694 wdt:P17 ?X . ?X wdt:P172 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {notation} of {implies} of {centrifugal force} ?",
    "uid": 14676,
    "subgraph": "right-subgraph",
    "template_index": 1,
    "question": "What is the notation that implies centrifugal force ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q178733 wdt:P1542 ?X . ?X wdt:P2534 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q178733> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1542>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2534> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the documentation that infers centrifugal constrain ?",
    "answers": [
      "math>"
    ]
  },
  {
    "NNQT_question": "What is the {sovereign state} for {official language} of {Romanian Sign Language}",
    "uid": 30318,
    "subgraph": "simple question left",
    "template_index": 413,
    "question": "Romanian Sign Language is the official language of what sovereign state?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P37 wd:Q7362575 . ?sbj wdt:P31 wd:Q3624078 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the state which official language is Romanian Sign Language",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P37 wd:Q7913 . ?sbj wdt:P31 wd:Q3624078 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {educated at} of {Melinda Gates} and {of}",
    "uid": 32037,
    "subgraph": [],
    "template_index": 484,
    "question": "When did educated at of Melinda Gates and of what?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q463877 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P642 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "When did educated at of Melinda Gates and of what?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q463877 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {doctoral advisor} are to/by {Thomas Hobbes} ?",
    "uid": 31765,
    "subgraph": "statement_property",
    "template_index": 1306,
    "question": "Thomas Hobbes was doctoral advisor of how many people?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P184 wd:Q37621 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "How many people had Thomas Hobbes as doctoral advisor?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P737 wd:Q37621 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {by-product} of {manufacturer} of {MH-60 Jayhawk} ?",
    "uid": 30666,
    "subgraph": "left-subgraph",
    "template_index": 1855,
    "question": "What was the HH-60 Jayhawk manufacturer by-product?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1892024 wdt:P176 ?X . ?X wdt:P2821 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What was the HH-60 Jayhawk producer by-product?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1892024 wdt:P176 ?X . ?X wdt:P1056 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Le Havre} with the {MIN(population)} whose {located in time zone} is {UTC+01:00} ?",
    "uid": 31099,
    "subgraph": "rank",
    "template_index": 627,
    "question": "What is the Le Havre with the lowest population whose located in time zone is UTC+01:00?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q42810 . ?ent wdt:P1082 ?obj . ?ent wdt:P421 wd:Q6655} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "What is the smallest Le Havre in time zone UTC+01:00?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q484170 . ?ent wdt:P1082 ?obj . ?ent wdt:P421 wd:Q6655} ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {owned by} and the {named after} of {Disneyland} ?",
    "uid": 9999,
    "subgraph": "two intentions right subgraph",
    "template_index": 576,
    "question": "Who owns Disneyland and who is it named after?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q181185 wdt:P127 ?ans_1 . wd:Q181185 wdt:P138 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q181185> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P127> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q181185> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P138> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Where did Disneyland get its name and who is the current owner?",
    "answers": [
      "Walt Disney",
      "The Walt Disney Company",
      "Walt Disney",
      "Disney Parks, Experiences and Products",
      "Walt Disney",
      "Disneyland, Inc."
    ]
  },
  {
    "NNQT_question": "What is the {end time} for {Reinhard Heydrich} has {occupation} as {President of Interpol} ?",
    "uid": 31641,
    "subgraph": "statement_property",
    "template_index": 1024,
    "question": "When did Reinhard Heydrich stop having the President of Interpol as occupation?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q60039 p:P106 ?s . ?s ps:P106 wd:Q19698214 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "In what year did Reinhard Heydrich step down as the President of Interpol occupation?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q60039 p:P39 ?s . ?s ps:P39 wd:Q19698214 . ?s pq:P582 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {KEPN ID} of {New York City}",
    "uid": 30993,
    "subgraph": "center",
    "template_index": 1043,
    "question": "What is KEPN ID for New York City ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q60 wdt:P3639 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q126269 wdt:P3639 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {sister city} of {born in} of {Zakhar Oskotsky} ?",
    "uid": 15426,
    "subgraph": "left-subgraph",
    "template_index": 29905,
    "question": "What sister city was born in of Zakhar Oskotsky?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q4338004 wdt:P19 ?X . ?X wdt:P190 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q4338004> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which sister city in Zakhar Oskotsky was born?",
    "answers": [
      "Santiago de Cuba",
      "Reinickendorf",
      "Qingdao",
      "Aqaba",
      "Sousse",
      "Limassol",
      "Bizerte",
      "Mikkeli",
      "Kotka",
      "Nesebar",
      "Rishon LeZion",
      "Jeddah",
      "Stockholm Municipality",
      "City of Melbourne",
      "Kaunas",
      "Los Angeles",
      "Alexandria",
      "Paris",
      "Vilnius",
      "Tashkent",
      "Warsaw",
      "Istanbul",
      "Lyon",
      "Plovdiv",
      "Sofia",
      "Milan",
      "Turin",
      "Oslo",
      "Venice",
      "Krasnoyarsk",
      "Beijing",
      "Tbilisi",
      "Maribor",
      "Hamburg",
      "Prague",
      "Mumbai",
      "Montevideo",
      "Zagreb",
      "Genoa",
      "Bordeaux",
      "Buenos Aires",
      "Barcelona",
      "Nur-Sultan",
      "Havana",
      "Dresden",
      "Helsinki",
      "Reykjavík",
      "Tallinn",
      "Riga",
      "Budapest"
    ]
  },
  {
    "NNQT_question": "What is {place of death} of {John Dowland}, that has {continent} is {BR} ?",
    "uid": 30486,
    "subgraph": "right-subgraph",
    "template_index": 2400,
    "question": "Where is the location of death of John Dowland whose continent is BR?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q207355 wdt:P20 ?answer . ?answer wdt:P30 ?x FILTER(contains(?x,'BR'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Where is the area of passing of John Dowland whose continent is BR?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q207355 wdt:P20 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'BR'))}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {magnetic ordering} of {Aruba} that is {instance of} is {emoji regional indicator sequence} ?",
    "uid": 31320,
    "subgraph": "statement_property",
    "template_index": 2040,
    "question": "What is the magnetic ordering for the Aruba flag emoji?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q21203 p:P922 ?s . ?s ps:P922 ?obj . ?s pq:P31 wd:Q28840786 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What is magnetic ordering for the Aruba flag emoji?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q21203 p:P1813 ?s . ?s ps:P1813 ?obj . ?s pq:P31 wd:Q28840786 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {child} of {Seiji Ozawa} that is {start time} is {1962-01-01} ?",
    "uid": 31462,
    "subgraph": "statement_property",
    "template_index": 2413,
    "question": "What Seiji Ozawa child was born in the year 1962?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q313649 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1962')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1962, what Seiji Ozawa child was born?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q313649 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1962')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Seneca} and {point in time}",
    "uid": 32010,
    "subgraph": [],
    "template_index": 1463,
    "question": "Which award did Seneca receive?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q2054 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Seneca received which award?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q128121 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {symptoms} of {gonorrhea}, that has {drug used for treatment} is {dopamine} ?",
    "uid": 30413,
    "subgraph": "right-subgraph",
    "template_index": 165,
    "question": "What are the signs of gonorrhea which can be treated with Dopamine?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q101896 wdt:P780 ?answer . ?answer wdt:P2176 wd:Q170304}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the symptoms of gonorrhea which can be dealt with with Dopamine?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q83319 wdt:P780 ?answer . ?answer wdt:P2176 wd:Q170304}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {organizer} and the {sport} of {Super_Bowl} ?",
    "uid": 10166,
    "subgraph": "two intentions right subgraph",
    "template_index": 501,
    "question": "What is the organize sport of Super_Bowl ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q32096 wdt:P664 ?ans_1 . wd:Q32096 wdt:P641 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q32096> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P664> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q32096> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P641> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "The Super Bowl is part of which sports organization?",
    "answers": [
      "National Football League",
      "American football"
    ]
  },
  {
    "NNQT_question": "What is {Africultures person ID} of {Andrei Rublev}",
    "uid": 31011,
    "subgraph": "center",
    "template_index": 1578,
    "question": "What is the Africultures person ID for Andrei Rublev?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q838 wdt:P4514 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q216813 wdt:P4514 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]