[
  {
    "NNQT_question": "What is {elected in} and {end cause} of {Harold Macmillan} has {position held} as {Anwar Ibrahim}",
    "uid": 32046,
    "subgraph": [],
    "template_index": 234,
    "question": "What position was held by Harold Macmillan in the Anwar Ibrahim, when was he elected, and why did he leave?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q128985 p:P39 ?s . ?s ps:P39 wd:Q299574 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Harold Macmillian of the Anwar Ibrahim held which position starting from what date and then left for what reason?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q128985 p:P39 ?s . ?s ps:P39 wd:Q41582587 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {educated at} of {Pedro Aguirre Cerda} that is {end time} is {1930-01-01} ?",
    "uid": 31358,
    "subgraph": "statement_property",
    "template_index": 5871,
    "question": "Where was Pedro Aguirre Cerda educated at in 1930?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q845 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1930')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What school did Pedro Aguirre Cerda attend in 1930?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q11641 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1930')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Konstantinos VII} has {award received} as {Triple Crown Trophy} ?",
    "uid": 31478,
    "subgraph": "statement_property",
    "template_index": 1520,
    "question": "When did Konstantinos VII receive the Triple Crown Trophy?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q41608 p:P166 ?s . ?s ps:P166 wd:Q7843370 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "On what date was Triple Crown Trophy given to Konstantinos VII?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q1151926 p:P166 ?s . ?s ps:P166 wd:Q7843370 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {candidacy in election} of {Rigsdagen}",
    "uid": 30791,
    "subgraph": "center",
    "template_index": 3716,
    "question": "Who is the candidacy in election for Rigsdagen?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P3602 wd:Q3493553}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P3602 wd:Q11268}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {architect} and the {heritage designation} of {Hwaseong} ?",
    "uid": 31948,
    "subgraph": "two intentions right subgraph",
    "template_index": 262,
    "question": "What is Hwaseong, Gyeonggi's architect and heritage designation?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q42160 wdt:P84 ?ans_1 . wd:Q42160 wdt:P1435 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Tell me the architect and heritage designation of Hwaseong.",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q62408 wdt:P84 ?ans_1 . wd:Q62408 wdt:P1435 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {native language} are for {Oscar Wilde} ?",
    "uid": 31714,
    "subgraph": "statement_property",
    "template_index": 123,
    "question": "How many native languages did Oscar Wilde speak, write, or sign?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q30875 wdt:P103 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Oscar Wilde spoke, wrote, or signed in how many various native languages?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q30875 wdt:P1412 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Marie Curie} that is {point in time} is {1911-1-1} ?",
    "uid": 6259,
    "subgraph": "statement_property",
    "template_index": 2704,
    "question": "What award did Marie Curie receive in 1911?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q7186 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1911')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7186> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1911-1-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1911 what award did Marie Curie receive?",
    "answers": [
      "Nobel Prize in Chemistry"
    ]
  },
  {
    "NNQT_question": "What is {gender of a scientific name of a genus} of {Hakeem Olajuwon}",
    "uid": 30863,
    "subgraph": "center",
    "template_index": 3036,
    "question": "Which is the gender of the scientific name of Hakeem Olajuwon?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q273256 wdt:P2433 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q273256 wdt:P2685 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {sibling} of {cast member} of {We Live in Public} ?",
    "uid": 30601,
    "subgraph": "left-subgraph",
    "template_index": 63,
    "question": "Who is the brother of the actress We Live in Public?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q372 wdt:P161 ?X . ?X wdt:P3373 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the name of We Live in Public's brother?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q3417235 wdt:P161 ?X . ?X wdt:P3373 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {route of administration} of {consequence} of {cyclohexane} ?",
    "uid": 17890,
    "subgraph": "right-subgraph",
    "template_index": 61,
    "question": "Who gave the{route of administration} of {consequence} of {cyclohexane} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q211433 wdt:P1542 ?X . ?X wdt:P636 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q211433> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1542>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P636> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who gave the { administration route } of the { cyclohexane } consistency?",
    "answers": [
      "ingestion",
      "skin absorption",
      "inhalation administration",
      "eye contact"
    ]
  },
  {
    "NNQT_question": "What is {bore} of {Model 35}",
    "uid": 31013,
    "subgraph": "center",
    "template_index": 3572,
    "question": "Which is the bore of Model 35?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1241424 wdt:P2556 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q37116 wdt:P2556 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {after a work by} of {Jacques Villeret}",
    "uid": 30808,
    "subgraph": "center",
    "template_index": 3580,
    "question": "Which is after a work by Jacques Villeret?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1877 wd:Q267244}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1877 wd:Q3067991}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Virgil} has {residence} as {New York City} ?",
    "uid": 31627,
    "subgraph": "statement_property",
    "template_index": 2800,
    "question": "When did Virgil move to New York City?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q1398 p:P551 ?s . ?s ps:P551 wd:Q60 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Tell me when Virgil moved to the Big Apple.",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q258662 p:P551 ?s . ?s ps:P551 wd:Q60 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {member of} and the {chairperson} of {BP} ?",
    "uid": 9752,
    "subgraph": "two intentions right subgraph",
    "template_index": 204,
    "question": "Who are the members of BP and their chairperson?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q152057 wdt:P463 ?ans_1 . wd:Q152057 wdt:P488 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q152057> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P463> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q152057> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P488> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Who are the British Petroleum board members and who is the chair?",
    "answers": [
      "Diversity Charter",
      "Helge Lund",
      "Diversity Charter",
      "Carl-Henric Svanberg"
    ]
  },
  {
    "NNQT_question": "What is the {human} for {page at OSTIS Belarus Wiki} of {Johnny Cash}",
    "uid": 30263,
    "subgraph": "simple question left",
    "template_index": 1260,
    "question": "Who is Johnny Cash's page at OSTIS Belarus Wiki?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2490 wd:Q42775 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who's the page at OSTIS Belarus Wiki of Johnny Cash?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P3448 wd:Q42775 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {e-mail address} of {George Washington}",
    "uid": 30990,
    "subgraph": "center",
    "template_index": 195,
    "question": "What is e-mail of George Washington ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q23 wdt:P968 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q49941 wdt:P968 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {location of creation} of {offal}",
    "uid": 30968,
    "subgraph": "center",
    "template_index": 3688,
    "question": "Which is the location of creation of offal?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q157484 wdt:P1071 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q157484 wdt:P2822 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {child} of {Isabella I of Castile} and {time of spacecraft landing}",
    "uid": 32019,
    "subgraph": [],
    "template_index": 859,
    "question": "Who is the child of Isabella I of Castile and what was the time of spacecraft landing?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q45859 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P620 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Who is the child of Isabella I of Castile and what was the spacecraft landing time?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q45859 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P569 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {single} that contains the word {way} in their name",
    "uid": 23200,
    "subgraph": "string matching simple contains word",
    "template_index": 2869,
    "question": "What are the single which start with the letter way",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q134556 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'way')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q134556>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'way')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "WHAT IS SINGLE WHICH START WITH THE LETTER WAY",
    "answers": [
      "By the Way",
      "Runaway",
      "Up out the Way",
      "Don't Take Away My Heart",
      "Not That Far Away",
      "Changed the Way You Kiss Me",
      "Always Look on the Bright Side of Life",
      "Born This Way",
      "Running Away",
      "Love the Way You Lie",
      "One Way or Another",
      "The Way We Were",
      "I Belong to You/How Many Ways",
      "Just the Way You Are",
      "(I'm Always Touched by Your) Presence",
      "Working on the Highway",
      "A Million Light Years Away",
      "Under the Westway",
      "Runaway",
      "Working My Way Back to You",
      "That's the Way Love Goes",
      "Can't Take That Away (Mariah’s Theme)",
      "Good Luck My Way",
      "Miles Away",
      "Get Outta My Way"
    ]
  },
  {
    "NNQT_question": "What is {nominated for} of {Gone with the Wind} that is {nominee} is {François Villon} ?",
    "uid": 31336,
    "subgraph": "statement_property",
    "template_index": 460,
    "question": "What was François Villon from Gone with the Wind nominated for?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q2875 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q849 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In what category did François Villon receive a nomination for Gone with the Wind?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q2875 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q367614 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {facet of} of {Śūnyatā}, that has {studied by} is {astronomy} ?",
    "uid": 30415,
    "subgraph": "right-subgraph",
    "template_index": 9,
    "question": "Which is the subject in Sunyata having science,that studies about astronomy?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q546054 wdt:P1269 ?answer . ?answer wdt:P2579 wd:Q333}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which is the subject in Sunyata having science,that thinks about around astronomy thinks about?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q546054 wdt:P1269 ?answer . ?answer wdt:P2579 wd:Q1000976}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Chinese dynasty} for {replaces} of {Song dynasty}",
    "uid": 31865,
    "subgraph": "simple question right",
    "template_index": 1662,
    "question": "What Chinese dynasty followed the Song dynasty?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q7462 wdt:P1365 ?obj . ?obj wdt:P31 wd:Q12857432 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What was the Chinese dynasty after the Song called?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q7313 wdt:P1365 ?obj . ?obj wdt:P31 wd:Q12857432 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {non-metropolitan county} for {decreased expression in} of {Hampshire}",
    "uid": 30260,
    "subgraph": "simple question left",
    "template_index": 2496,
    "question": "What is the non-metropolitan county that decreases expression in Hampshire?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1910 wd:Q23204 . ?sbj wdt:P31 wd:Q769603 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the non-metropolitan county that decreases expression in Hampshire",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P47 wd:Q23204 . ?sbj wdt:P31 wd:Q769603 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {religion} of {influenced by} of {Kupang} ?",
    "uid": 30525,
    "subgraph": "left-subgraph",
    "template_index": 7,
    "question": "Where {faith} {has influence} on {Kupang} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q14155 wdt:P737 ?X . ?X wdt:P140 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Where {confidence} {has impact} on {Kupang} ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1744 wdt:P737 ?X . ?X wdt:P140 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {chief executive officer} of {educated at} of {Virgil Thomson} ?",
    "uid": 30650,
    "subgraph": "right-subgraph",
    "template_index": 5867,
    "question": "What chief executive officer did Virgil Thomson attend?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q544485 wdt:P69 ?X . ?X wdt:P169 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Where did Virgil Thomson attend chief executive officer?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q544485 wdt:P69 ?X . ?X wdt:P355 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {award received} and the {author} of {Ur-Nammu} ?",
    "uid": 31945,
    "subgraph": "two intentions right subgraph",
    "template_index": 74,
    "question": "Who is the author of the Ur-Nammu and what award did they receive?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q297417 wdt:P166 ?ans_1 . wd:Q297417 wdt:P50 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Who wrote the Ur-Nammu, and what award were they given?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q128444 wdt:P166 ?ans_1 . wd:Q128444 wdt:P50 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {convicted of} of {presenter} of {Paris Hilton's British Best Friend} ?",
    "uid": 30691,
    "subgraph": "left-subgraph",
    "template_index": 771,
    "question": "Who is guilty for Paris Hilton's British Best Friend being presented?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q4347282 wdt:P371 ?X . ?X wdt:P1399 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is blameworthy for Paris Hilton's British Best Friend being presented?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1513736 wdt:P371 ?X . ?X wdt:P1399 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {end time} for {Wes Craven} has {spouse} as {Jonathan Craven} ?",
    "uid": 31614,
    "subgraph": "statement_property",
    "template_index": 496,
    "question": "When did Wes Craven divorce Jonathan Craven?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q223992 p:P26 ?s . ?s ps:P26 wd:Q1703133 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Wes Craven and  Jonathan Craven get separated?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q223992 p:P26 ?s . ?s ps:P26 wd:Q20894422 . ?s pq:P582 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {inventory number} for {Jonathan Franzen} has {award received} as {National Book Award for Fiction} ?",
    "uid": 31644,
    "subgraph": "statement_property",
    "template_index": 4470,
    "question": "What was the inventory number of Jonathan Franzen for the reception of the National Book Award for Fiction?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q316607 p:P166 ?s . ?s ps:P166 wd:Q3873144 . ?s pq:P217 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was the inventory number of Jonathan Franzen for the winning of the National Book Award for Fiction?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q316607 p:P166 ?s . ?s ps:P166 wd:Q3873144 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {start time} for {La Plata} has {named after} as {Eva Perón} ?",
    "uid": 8894,
    "subgraph": "statement_property",
    "template_index": 5339,
    "question": "When does La Plata?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q44059 p:P138 ?s . ?s ps:P138 wd:Q40933 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q44059> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P138> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q40933> .\n?statement <http://www.wikidata.org/entity/P580> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "La Plata is when?",
    "answers": [
      "1952-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is the {written work} for {has edition or translation} of {Jai alai}",
    "uid": 30227,
    "subgraph": "simple question left",
    "template_index": 2082,
    "question": "What is the written work with an edition or a translation of Jai ali?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P747 wd:Q1193361 . ?sbj wdt:P31 wd:Q47461344 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the written work with an edition or a translation of Jai ali",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P747 wd:Q29334 . ?sbj wdt:P31 wd:Q47461344 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {place with town rights and privileges} that {list of monuments} {listed objects in Salzburg} and which contains the word {salzburg} in their name",
    "uid": 25252,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3136,
    "question": "Name the listed Salzburg town monuments containing the word Salzburg in their name.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13539802 . ?sbj wdt:P1456 wd:Q1188436 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'salzburg')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q13539802>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1456> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1188436>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'salzburg')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Name the recorded Salzburg town landmarks containing the word Salzburg in their name.",
    "answers": [
      "Salzburg"
    ]
  },
  {
    "NNQT_question": "What is {BioLib taxon ID} of {lion}",
    "uid": 30999,
    "subgraph": "center",
    "template_index": 2617,
    "question": "Which is the BioLib ID for lion?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q140 wdt:P838 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q242464 wdt:P838 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Rafael José Urdaneta Farías} that starts with {'o'}",
    "uid": 31151,
    "subgraph": "string matching simple contains word",
    "template_index": 2601,
    "question": "What are the Rafael Urdaneta which start with the letter o",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q471325 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'o')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which Rafael Urdaneta  stars with the letter o?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q645883 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'o')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {follows} of {Hypertext Transfer Protocol}",
    "uid": 30814,
    "subgraph": "center",
    "template_index": 3651,
    "question": "What is that follows Hypertext Transfer Protocol (HTTP)?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P155 wd:Q8777}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1547 wd:Q8777}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {has facility} of {biologist}",
    "uid": 30772,
    "subgraph": "center",
    "template_index": 711,
    "question": "Which is the facility of the biologist?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P912 wd:Q864503}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P912 wd:Q57346}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  }
]