[
  {
    "NNQT_question": "Give me {has quality} {single} that contains the word {way} in their name",
    "uid": 31253,
    "subgraph": "string matching simple contains word",
    "template_index": 2869,
    "question": "What are the element with single as quality which start with the letter way",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P1552 wd:Q134556 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'way')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "WHAT IS OBJECT WITH SINGLE AS QUALITY WHICH START WITH THE LETTER WAY",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q134556 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'way')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {colony of the Russian empire} for {twinned administrative body} of {Mumbai}",
    "uid": 31825,
    "subgraph": "simple question right",
    "template_index": 1309,
    "question": "What is the name of the administrative body for the colony of the Russian empire of Mumbai",
    "sparql_wikidata": " select distinct ?obj where { wd:Q1156 wdt:P190 ?obj . ?obj wdt:P31 wd:Q4373615 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the administrative body's name for Mumbai colony of the Russian empire?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q1156 wdt:P190 ?obj . ?obj wdt:P31 wd:Q5119 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {political party} that contains the word {veritas} in their name",
    "uid": 23827,
    "subgraph": "string matching simple contains word",
    "template_index": 1724,
    "question": "Tell me political party whose name has the word veritas in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7278 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'veritas')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q7278>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'veritas')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me political party whose title has the word veritas in it.",
    "answers": [
      "Veritas"
    ]
  },
  {
    "NNQT_question": "What is the {human} for {basic reproduction number} of {Futebol Clube do Porto}",
    "uid": 31797,
    "subgraph": "simple question right",
    "template_index": 1312,
    "question": "Who is the basic reproduction number of F.C. Porto?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q128446 wdt:P3492 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the basic reproduction number of F.C. Porto?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q128446 wdt:P634 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Chinese dynasty} for {Skype username} of {Yuan Empire}",
    "uid": 31806,
    "subgraph": "simple question right",
    "template_index": 1818,
    "question": "What Chinese dynasty is a Skype username of the Yuan dynasty?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q7313 wdt:P2893 ?obj . ?obj wdt:P31 wd:Q12857432 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What dynasty has been used as a Skype username of the Yuan in China?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q7313 wdt:P1366 ?obj . ?obj wdt:P31 wd:Q12857432 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {shares border with} are to/by {Haifa} ?",
    "uid": 31757,
    "subgraph": "statement_property",
    "template_index": 1226,
    "question": "How many share borders are with the {Haifa} ?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P47 wd:Q41621 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "What makes up the borders of Haifa?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P47 wd:Q1721 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {posttranslational modification} {national sports team} that starts with {'t'}",
    "uid": 31169,
    "subgraph": "string matching simple contains word",
    "template_index": 485,
    "question": "What are the elements with a posttranslational modification property of national sports team  which start with the letter t",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P1917 wd:Q1194951 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the things with a posttranslational modification property of national sports group which begin with the letter t",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1194951 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {place of birth} of {Raffaele Calace}, that has {head of government} is {Januarius} ?",
    "uid": 30479,
    "subgraph": "right-subgraph",
    "template_index": 425,
    "question": "What is the birth place of Raffaele Calace, whose head of government is Januarius?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1344676 wdt:P19 ?answer . ?answer wdt:P6 wd:Q315312}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the birth put of Raffaele Calace, whose head of government is Januarius?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1344676 wdt:P19 ?answer . ?answer wdt:P417 wd:Q315312}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {member of} and the {chairperson} of {Netscape Communications Corporation} ?",
    "uid": 31962,
    "subgraph": "two intentions right subgraph",
    "template_index": 204,
    "question": "Who are the members of Netscape Communications Corporation and their chairperson?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q210057 wdt:P463 ?ans_1 . wd:Q210057 wdt:P488 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Who are the Netscape Communications Corporation board members and who is the chair?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q152057 wdt:P463 ?ans_1 . wd:Q152057 wdt:P488 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Virgil} that is {point in time} is {1964-01-01} ?",
    "uid": 31404,
    "subgraph": "statement_property",
    "template_index": 4027,
    "question": "What award did Virgil recieve in 1964?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1398 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1964')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1964, Virgil won which award?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q395205 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1964')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {inhabitants} of {nationality} of {Leopold von Sacher-Masoch} ?",
    "uid": 14322,
    "subgraph": "right-subgraph",
    "template_index": 2748,
    "question": "What is {inhabitants} {nationality} of {Leopold von Sacher-Masoch} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q78474 wdt:P27 ?X . ?X wdt:P1082 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q78474> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P27>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is {inhabitants} {nationality} of {Leopold von Sacher-Masoch} ?",
    "answers": [
      "8809212"
    ]
  },
  {
    "NNQT_question": "What is {drug used for treatment} of {studies} of {ophthalmology} ?",
    "uid": 30622,
    "subgraph": "right-subgraph",
    "template_index": 9,
    "question": "What is prescribed drug of academic field of ophthalmology?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q161437 wdt:P2578 ?X . ?X wdt:P2176 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "The academic field of ophthalmology prescribes what drug?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q162555 wdt:P2578 ?X . ?X wdt:P2176 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {aircraft model} for {disjoint union of} of {Airbus A321-100}",
    "uid": 31866,
    "subgraph": "simple question right",
    "template_index": 3710,
    "question": "What is the union for Airbus A321-100s?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q15629185 wdt:P2738 ?obj . ?obj wdt:P31 wd:Q15056995 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the union for Airbus A321-100s?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q6475 wdt:P2738 ?obj . ?obj wdt:P31 wd:Q15056995 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {is located in} of {landscape of} of {The Scream} ?",
    "uid": 15380,
    "subgraph": "right-subgraph",
    "template_index": 163,
    "question": "What is located in the landscape of The Scream?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q471379 wdt:P180 ?X . ?X wdt:P131 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q471379> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P180>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P131> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is found within the scene of The Shout?",
    "answers": [
      "Akershus"
    ]
  },
  {
    "NNQT_question": "What is the {start time} for {Schwarzwald} has {country} as {Greece} ?",
    "uid": 31551,
    "subgraph": "statement_property",
    "template_index": 1138,
    "question": "When was Schwarzwald founded?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q7039 p:P17 ?s . ?s ps:P17 wd:Q41 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "In what year was Schwarzwald founded?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q1524 p:P17 ?s . ?s ps:P17 wd:Q41 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {capital of} are for {Paris} ?",
    "uid": 1629,
    "subgraph": "statement_property",
    "template_index": 629,
    "question": "What's the capital of Paris?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q90 wdt:P1376 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q90> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1376> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Referring to Paris, what is the capital?",
    "answers": [
      "2"
    ]
  },
  {
    "NNQT_question": "What is {student of} of {Strabo} that is {sourcing circumstances} is {Cuju} ?",
    "uid": 31285,
    "subgraph": "statement_property",
    "template_index": 3698,
    "question": "Who was cuju thought to be a student of Strabo?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q45936 p:P1066 ?s . ?s ps:P1066 ?obj . ?s pq:P1480 wd:Q138208 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Strabo's student was cuju known as who?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q45936 p:P1066 ?s . ?s ps:P1066 ?obj . ?s pq:P1480 wd:Q18122778 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {sacred language} for {follows} of {Faroese}",
    "uid": 30272,
    "subgraph": "simple question left",
    "template_index": 134,
    "question": "What is the sacred language of Faroese?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P155 wd:Q25258 . ?sbj wdt:P31 wd:Q839470 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the sacred language spoken in Faroese",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P155 wd:Q35497 . ?sbj wdt:P31 wd:Q839470 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {together with} for {Chris Rock} has {award received} as {Lunt-Fontanne Award for Ensemble Excellence} ?",
    "uid": 3581,
    "subgraph": "statement_property",
    "template_index": 26,
    "question": "Who was the person with Chris Rock when he was awarded the Lunt-Fontanne Award for Ensemble Excellence?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q4109 p:P166 ?s . ?s ps:P166 wd:Q28007406 . ?s pq:P1706 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q4109> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q28007406> .\n?statement <http://www.wikidata.org/entity/P1706> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Who was with Chris Rock when the Lunt-Fontanne Award for Ensemble Excellence was awarded to him?",
    "answers": [
      "Annabella Sciorra",
      "Bobby Cannavale",
      "Elizabeth Rodriguez",
      "Yul Vazquez"
    ]
  },
  {
    "NNQT_question": "What is the {glass transition temperature} for {Clovis I} has {position held} as {king of Franks} ?",
    "uid": 31577,
    "subgraph": "statement_property",
    "template_index": 4585,
    "question": "What was glass transition temperature of Clovis I as King of France?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q82339 p:P39 ?s . ?s ps:P39 wd:Q22923081 . ?s pq:P5670 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Which was the glass transition temperature of King Clovis I of France?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q82339 p:P39 ?s . ?s ps:P39 wd:Q22923081 . ?s pq:P1366 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {given name} of {John Foster Dulles}, that has {port} is {Latin script} ?",
    "uid": 30385,
    "subgraph": "right-subgraph",
    "template_index": 2532,
    "question": "What is name of John Foster Dulles which port is Latin script?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q223677 wdt:P735 ?answer . ?answer wdt:P1641 wd:Q8229}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is identify of John Foster Dulles which port is Latin script?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q223677 wdt:P735 ?answer . ?answer wdt:P282 wd:Q8229}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {position held} of {Raymond Poincaré} that is {replaces} is {Jacques Bainville} ?",
    "uid": 31441,
    "subgraph": "statement_property",
    "template_index": 5807,
    "question": "What position did Raymond Poincare hold replacing Jacques Bainville?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q191974 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q966894 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which position did Raymond Poincare hold replacing Jacques Bainville ?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q191974 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q966894 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {two-part episode} for {image} of {The X-Files}",
    "uid": 30300,
    "subgraph": "simple question left",
    "template_index": 1575,
    "question": "Which is the two-part episode image for the series The X-Files?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P18 wd:Q2744 . ?sbj wdt:P31 wd:Q21664088 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the two-part episode image for the series The X-Files",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P179 wd:Q2744 . ?sbj wdt:P31 wd:Q21664088 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nominated for} of {Pedro Aguirre Cerda} that is {statement is subject of} is {37th Academy Awards} ?",
    "uid": 31420,
    "subgraph": "statement_property",
    "template_index": 5838,
    "question": "What awarded Pedro Aguirre Cerda was nominated for at 37th Academy Awards?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q845 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917138 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which award was Pedro Aguirre Cerda nominated for at the 37th Academy Awards?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q177984 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917138 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {country} of {Wiesbaden} that is {start time} is {1871-1-18} ?",
    "uid": 3954,
    "subgraph": "statement_property",
    "template_index": 399,
    "question": "What country was started in the year 1871 in Wiesbaden?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1721 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1871')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1721> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P17> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1871-1-18>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1871 what country was started in Wiesbaden?",
    "answers": [
      "German Empire"
    ]
  },
  {
    "NNQT_question": "What is {political ideology} of {member of} of {Michel Pouzol} ?",
    "uid": 30733,
    "subgraph": "left-subgraph",
    "template_index": 29836,
    "question": "What is political ideology of member of party of Michel Pouzol ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3310625 wdt:P463 ?X . ?X wdt:P1142 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is political philosophy of part of party of Michel Pouzol ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q3310625 wdt:P102 ?X . ?X wdt:P1142 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {father} of {replaces} of {Guangzhou} ?",
    "uid": 30513,
    "subgraph": "left-subgraph",
    "template_index": 4,
    "question": "Who is the son of Guangzhou?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q16572 wdt:P1365 ?X . ?X wdt:P22 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is the child of Guangzhou?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q17853991 wdt:P1365 ?X . ?X wdt:P22 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {discoverer or inventor of} of {major event} of {Nick Faldo} ?",
    "uid": 17099,
    "subgraph": "left-subgraph",
    "template_index": 329,
    "question": "What did Nick Faldo discover or invent?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q531520 wdt:P793 ?X . ?X wdt:P61 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q531520> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P793>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P61> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which was the discovery or invention of Nick Faldo?",
    "answers": [
      "The Guardian",
      "Le Monde",
      "Al-Alam News Network",
      "Yle",
      "Süddeutsche Zeitung",
      "Novaya Gazeta",
      "15 min",
      "Norddeutscher Rundfunk",
      "Westdeutscher Rundfunk",
      "Sveriges Television",
      "Haaretz",
      "24 Chasa",
      "Österreichischer Rundfunk",
      "L'Espresso",
      "Politiken",
      "Daily Monitor",
      "Aftenposten",
      "Canadian Broadcasting Corporation",
      "The Namibian",
      "Het Financieele Dagblad",
      "Le Soir",
      "Le Matin",
      "Univision",
      "Gazeta Wyborcza",
      "Kyodo News",
      "Australian Broadcasting Corporation",
      "Mmegi",
      "El Comercio",
      "El Universo",
      "El trece",
      "Toronto Star",
      "RedeTV!",
      "The Irish Times",
      "DR",
      "La Sexta",
      "De Tijd",
      "Panorama",
      "Expresso",
      "Falter",
      "Tunis Afrique Presse",
      "La Nación",
      "O Estado de São Paulo",
      "The McClatchy Company",
      "Miami Herald",
      "Daily Nation",
      "Universo Online",
      "Trouw",
      "Kyiv Post",
      "La Prensa",
      "The Australian Financial Review"
    ]
  },
  {
    "NNQT_question": "What is {cover art by} of {George Martin}",
    "uid": 30804,
    "subgraph": "center",
    "template_index": 956,
    "question": "What is cover artist for George Martin ?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P736 wd:Q191819}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P736 wd:Q504611}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {costume designer} are to/by {Kingdom of Castile} ?",
    "uid": 31751,
    "subgraph": "statement_property",
    "template_index": 1239,
    "question": "How many costume designers are there in the Kingdom of Castile?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2515 wd:Q179293 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Which is the number of costume designers in the Kingdom of Castile?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P710 wd:Q179293 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {creators} of {language of the original work} of {Star Trek Into Darkness} ?",
    "uid": 15773,
    "subgraph": "left-subgraph",
    "template_index": 7,
    "question": "Who is {creators} of {language of the original work} {Star Trek Into Darkness} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q171711 wdt:P364 ?X . ?X wdt:P170 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q171711> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P364>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P170> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who were the creators for the language of the original work of Star Trek Into Darkness?",
    "answers": [
      "Marc Okrand"
    ]
  },
  {
    "NNQT_question": "What is {contains administrative territorial entity} of {Trentino} that is {start time} is {2015-01-01} ?",
    "uid": 31339,
    "subgraph": "statement_property",
    "template_index": 1206,
    "question": "What district of Trentino originated in 2015?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q103719381 p:P150 ?s . ?s ps:P150 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2015')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Name the district of Trentino created in 2015?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q1256 p:P150 ?s . ?s ps:P150 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2015')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {sauce} for {country of origin} of {Yekaterinburg}",
    "uid": 30234,
    "subgraph": "simple question left",
    "template_index": 3253,
    "question": "Which is the sauce that originated in Yekaterinburg?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P495 wd:Q887 . ?sbj wdt:P31 wd:Q178359 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the sauce that originated in Yekaterinburg",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P495 wd:Q18097 . ?sbj wdt:P31 wd:Q178359 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {safety classification and labelling} of {undecane} that is {NFPA Fire} is {0} ?",
    "uid": 31334,
    "subgraph": "statement_property",
    "template_index": 504,
    "question": "What is { safety classification and labeling } of { undecane } that is { NFPA Fire } is { 0 }?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q150731 p:P4952 ?s . ?s ps:P4952 ?obj . ?s pq:P994 ?x filter(contains(?x,'0')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "what safety classification and labeling of undecane exists?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q288266 p:P4952 ?s . ?s ps:P4952 ?obj . ?s pq:P994 ?x filter(contains(?x,'0')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]