[
  {
    "NNQT_question": "What is {position held} of {John Tyler} that is {property scope} is {William Henry Harrison} ?",
    "uid": 31317,
    "subgraph": "statement_property",
    "template_index": 4046,
    "question": "At what role was John Tyler property scope of William Henry Harrison?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q11881 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P5314 wd:Q11869 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In what position did John Tyler played while being property scope of Henry Harrison?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q11881 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q11869 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {drug used for treatment} of {has cause} of {Lake Placid} ?",
    "uid": 30517,
    "subgraph": "right-subgraph",
    "template_index": 352,
    "question": "What is being treated in an individual with Lake Placid, New York?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q192700 wdt:P828 ?X . ?X wdt:P2176 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is being handled in an person with Lake Placid, New York?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q184559 wdt:P828 ?X . ?X wdt:P2176 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Joko garbi} that starts with {'p'}",
    "uid": 31138,
    "subgraph": "string matching simple contains word",
    "template_index": 631,
    "question": "which joko garbi starts with the letter p",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56148890 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "which joko garbi begins with the letter p",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q134041 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {JMA Seismic Intensity Scale} {thoracic disease} that contains the word {syndrome} in their name",
    "uid": 31166,
    "subgraph": "string matching simple contains word",
    "template_index": 869,
    "question": "tell me about the element with a JMA Seismic Intensity Scale level of thoracic disease that contains the word syndrome in their name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P5386 wd:Q18553676 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'syndrome')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "let me know around the object with a JMA Seismic Intensity Scale level of thoracic malady that contains the word disorder in their name",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18553676 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'syndrome')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {D-type asteroid} with the {MAX(mean anomaly)} ?",
    "uid": 31082,
    "subgraph": "rank",
    "template_index": 229,
    "question": "Which D-type asteroid has the highest mean of anomalies?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q1814074 . ?ent wdt:P2325 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "Which D-type asteroid has the highest mean of anomalies?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q2449475 . ?ent wdt:P2325 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {human population} of {birth place} of {Konstantin Khabensky} ?",
    "uid": 15064,
    "subgraph": "right-subgraph",
    "template_index": 4975,
    "question": "Tell me the Human population and birthplace of konstantin khabensky?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q558666 wdt:P19 ?X . ?X wdt:P1082 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q558666> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "I would like the know in the birthplace of Konstatin khabensy the Human population.",
    "answers": [
      "5351935"
    ]
  },
  {
    "NNQT_question": "What is {Dewey Decimal Classification} of {measured physical quantity} of {metric Horsepower} ?",
    "uid": 30559,
    "subgraph": "right-subgraph",
    "template_index": 14,
    "question": "Which Dewey Decimal Classification do I use to measure horsepower ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q160857 wdt:P111 ?X . ?X wdt:P8359 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What Dewey Decimal Classification should I use to measure horsepower?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q160857 wdt:P111 ?X . ?X wdt:P2534 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {founded by} of {location} of {The Expulsion of Heliodorus from the Temple} ?",
    "uid": 30689,
    "subgraph": "left-subgraph",
    "template_index": 239,
    "question": "What is the founder of the located in of The Expulsion of Heliodorus from the Temple ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2294201 wdt:P276 ?X . ?X wdt:P112 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is the founder of the location of The Expulsion of Heliodorus from the Temple?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q2715152 wdt:P276 ?X . ?X wdt:P112 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {trunk prefix} of {filming location} of {Flight from Ashiya} ?",
    "uid": 30702,
    "subgraph": "right-subgraph",
    "template_index": 3521,
    "question": "What is the trunk prefix of the shooting location Flight from Ashiya?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q25506 wdt:P915 ?X . ?X wdt:P3238 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the trunk prefix of the shooting area Flight from Ashiya?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q189540 wdt:P915 ?X . ?X wdt:P3238 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {chemical structure} are for {oxytocin} ?",
    "uid": 1112,
    "subgraph": "statement_property",
    "template_index": 112,
    "question": "How much chemical structure are for oxytocin?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q169960 wdt:P117 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q169960> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P117> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What is the checmical structure ofr oxytocin?",
    "answers": [
      "3"
    ]
  },
  {
    "NNQT_question": "what is the {end time} for {Pablo Picasso} has {partner} as {Fernande Olivier} ?",
    "uid": 5715,
    "subgraph": "statement_property",
    "template_index": 2160,
    "question": "When was Pablo Picasso's partnership with Fernade Oliver over?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q5593 p:P451 ?s . ?s ps:P451 wd:Q453775 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q5593> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P451> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q453775> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "On what date did Pablo Picasso end his partnership with Fernade Oliver?",
    "answers": [
      "1912-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "Give me {followed by} {cosmic velocity} that contains the word {velocity} in their name",
    "uid": 31258,
    "subgraph": "string matching simple contains word",
    "template_index": 2655,
    "question": "What are the element followed by space velocity which start with the letter velocity",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P156 wd:Q4234997 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'velocity')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the object followed by space speed which begin with the letter velocity",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4234997 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'velocity')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {hurdler} for {contributed to creative work} of {Sasha Grey}",
    "uid": 31787,
    "subgraph": "simple question right",
    "template_index": 1226,
    "question": "Mention the hurdler related work highlighting the work of Sasha Grey.",
    "sparql_wikidata": " select distinct ?obj where { wd:Q2709 wdt:P3919 ?obj . ?obj wdt:P31 wd:Q13724897 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Say the hurdler related work highlighting the work of Sasha Grey.",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q2709 wdt:P3919 ?obj . ?obj wdt:P31 wd:Q9212979 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {owned by} of {production company} of {Artificer} ?",
    "uid": 30529,
    "subgraph": "left-subgraph",
    "template_index": 8678,
    "question": "Who is the owner of the theatre company that made 'Artificer'?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2865776 wdt:P272 ?X . ?X wdt:P127 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is the proprietor of the theatre corporation that made 'Artificer'?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q21184208 wdt:P272 ?X . ?X wdt:P127 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {YouTube channel ID} of {Lafia}",
    "uid": 30823,
    "subgraph": "center",
    "template_index": 3895,
    "question": "Which is the YouTube channel ID for Lafia?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1023721 wdt:P2397 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q4235 wdt:P2397 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {taxon} for {endemic to} of {Cactaceae}",
    "uid": 31839,
    "subgraph": "simple question right",
    "template_index": 1902,
    "question": "What is the taxon endemic to Cactaceae?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q14560 wdt:P183 ?obj . ?obj wdt:P31 wd:Q16521 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What taxon is endemic to Cactaceae?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q14560 wdt:P427 ?obj . ?obj wdt:P31 wd:Q16521 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Hume Cronyn} that is {point in time} is {1964-0-0} ?",
    "uid": 7582,
    "subgraph": "statement_property",
    "template_index": 4027,
    "question": "What award did Hume Cronyn recieve in 1964?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q395205 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1964')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q395205> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1964-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1964, Hume Cronyn won which award?",
    "answers": [
      "Tony Award for Best Featured Actor in a Play"
    ]
  },
  {
    "NNQT_question": "What is {position held} of {Mahathir Mohamad} that is {start time} is {2018-5-10} ?",
    "uid": 5293,
    "subgraph": "statement_property",
    "template_index": 1738,
    "question": "What position did Mahathir Mohamad hold starting 2018-5-10?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q181383 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2018')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q181383> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P39> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <2018-5-10>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 2018-5-10, what position did Mahathir Mohamad hold?",
    "answers": [
      "Prime Minister of Malaysia"
    ]
  },
  {
    "NNQT_question": "What is {educated at} of {Seneca} that is {academic major} is {Latin} ?",
    "uid": 31341,
    "subgraph": "statement_property",
    "template_index": 3721,
    "question": "Where did Seneca major in Latin?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q2054 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 wd:Q397 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "At what location did Seneca major in Latin?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q170373 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 wd:Q397 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Billboard artist ID} of {Björn Otto}",
    "uid": 30906,
    "subgraph": "center",
    "template_index": 3097,
    "question": "Which is the Billboard artist ID for Björn Otto?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1743 wdt:P4208 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q119069 wdt:P4208 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {end time} for {Ana Kasparian} has {sex or gender} as {California State University, Northridge} ?",
    "uid": 31576,
    "subgraph": "statement_property",
    "template_index": 980,
    "question": "When did Ana Kasparian have California State University, Northridge sex?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q19661 p:P21 ?s . ?s ps:P21 wd:Q1026939 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Ana Kasparian have California State University, Northridge gender?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q19661 p:P69 ?s . ?s ps:P69 wd:Q1026939 . ?s pq:P582 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {chairperson} of {Revolutionary Communist League} and {follows}",
    "uid": 32009,
    "subgraph": [],
    "template_index": 1184,
    "question": "Who is the chairperson of the Revolutionary Communist League and who are his followers?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q3133199 p:P488 ?s . ?s ps:P488 ?obj . ?s pq:P155 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Who is the chairperson of the Revolutionary Communist League and who are his supporters?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q17427 p:P488 ?s . ?s ps:P488 ?obj . ?s pq:P155 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {trend} of {role model} of {Buckminster Fuller} ?",
    "uid": 14767,
    "subgraph": "left-subgraph",
    "template_index": 373,
    "question": "WHO IS THE TREND ROLE MODEL OF BUCKMINSTER FULLER?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q102289 wdt:P737 ?X . ?X wdt:P135 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q102289> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P737>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P135> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "WHO IS THE Slant Part Show OF BUCKMINSTER More full?",
    "answers": [
      "analytic philosophy",
      "free-thought",
      "Western philosophy"
    ]
  },
  {
    "NNQT_question": "What is the {announcement date} for {Godfrey of Bouillon} has {noble title} as {Defender of the Holy Sepulchre} ?",
    "uid": 31596,
    "subgraph": "statement_property",
    "template_index": 1669,
    "question": "What was the announcement date of assignment of Defender of the Holy Sepulchre noble title to Godfrey of Bouillon?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q76721 p:P97 ?s . ?s ps:P97 wd:Q2874492 . ?s pq:P6949 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When was announced the assignment of Defender of the Holy Sepulchre noble title to Godfrey of Bouillon",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q76721 p:P97 ?s . ?s ps:P97 wd:Q2874492 . ?s pq:P582 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {diplomatic crisis} for {total revenue} of {Russian Orthodox Church}",
    "uid": 31802,
    "subgraph": "simple question right",
    "template_index": 3828,
    "question": "What diplomatic crisis lead to the total revenue of the Russian Orthodox Church?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q60995 wdt:P2139 ?obj . ?obj wdt:P31 wd:Q5791104 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What political emergency lead to the total revenue of the Russian Conventional Church?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q60995 wdt:P793 ?obj . ?obj wdt:P31 wd:Q5791104 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {position held} of {John Jay} that is {primary destinations} is {William Carmichael} ?",
    "uid": 31319,
    "subgraph": "statement_property",
    "template_index": 3597,
    "question": "What position was William Carmichael primary destination of John Jay?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q310847 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1302 wd:Q8006569 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "When William Carmichael was primary destination of John Jay, what position did Jay hold?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q310847 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q8006569 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of sports team} of {Rinus Michels} and {drafted by}",
    "uid": 32023,
    "subgraph": [],
    "template_index": 1485,
    "question": "Tell me about member of sports team of Rinus Michels and the person who drafted him?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q2154479 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P647 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Tell me about member of sports crew of Rinus Michels and the individual who drafted him?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q2154479 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Swedish municipality code} of {Torreón}",
    "uid": 30977,
    "subgraph": "center",
    "template_index": 3853,
    "question": "Which is the Swedish municipality code for Torreón?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q386991 wdt:P525 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q386991 wdt:P1976 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {separation process} that {discoverer or inventor} {Zosimos of Panopolis} and which contains the word {distillation} in their name",
    "uid": 25200,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2100,
    "question": "What separation process did Zosimos of Panopolis invent with the word \"distillation\" in its name?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q898987 . ?sbj wdt:P61 wd:Q226868 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'distillation')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q898987>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P61> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q226868>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'distillation')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What separation process did Zosimos of Panopolis invent with the word \"distillation\" in its name?",
    "answers": [
      "distillation"
    ]
  },
  {
    "NNQT_question": "What is the {sovereign state} with the {MIN(date of the first one)} whose {member of} is {International Finance Corporation} ?",
    "uid": 31103,
    "subgraph": "rank",
    "template_index": 669,
    "question": "What sovereign state belonging to the International Finance Corporation has the lowest date of the first one?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q3624078 . ?ent wdt:P7124 ?obj . ?ent wdt:P463 wd:Q656801} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Name the sovereign state belonging to the IFC that has the lowest date of the first one.",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q3624078 . ?ent wdt:P1198 ?obj . ?ent wdt:P463 wd:Q656801} ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {studies} of {Gateway to Research organisation ID} of {Zdzisław Szymański} ?",
    "uid": 30655,
    "subgraph": "left-subgraph",
    "template_index": 297,
    "question": "Which is the Gateway to Research organisation ID of Zdzisław Szymański?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q9389874 wdt:P8501 ?X . ?X wdt:P2578 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which is the Gateway to Research organisation ID of Zdzisław Szymański?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q9389874 wdt:P101 ?X . ?X wdt:P2578 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Ken Thompson} that is {point in time} is {1983-1-1} ?",
    "uid": 8479,
    "subgraph": "statement_property",
    "template_index": 4924,
    "question": "What award did Ken Thompson receive on January 1st, 1983?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1107006 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1983')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1107006> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1983-1-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "On January 1st, 1983, Ken Thompson received what award?",
    "answers": [
      "Turing Award",
      "ACM Software System Award"
    ]
  },
  {
    "NNQT_question": "What is {portrait of} of {pendant to} of {Woman Drinking Wine} ?",
    "uid": 15815,
    "subgraph": "left-subgraph",
    "template_index": 287,
    "question": "What portrait has the Woman Drinking Wine wearing a pendant?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q32995247 wdt:P1639 ?X . ?X wdt:P180 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q32995247> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1639>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P180> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which picture presents the woman wearing a pendant drinking wine?",
    "answers": [
      "woman",
      "writing",
      "bed",
      "letter"
    ]
  },
  {
    "NNQT_question": "What is {ancestral home} of {Ōtsu}",
    "uid": 30970,
    "subgraph": "center",
    "template_index": 2267,
    "question": "What is the ancestral home of Ōtsu ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q202907 wdt:P66 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q202907 wdt:P1376 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]