[
  {
    "NNQT_question": "What is the {MSX} with the {MAX(clock speed)} whose {manufacturer} is {Radofin} ?",
    "uid": 31132,
    "subgraph": "rank",
    "template_index": 347,
    "question": "Which MSX manufactured by Radofin has the fastest clock speed?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q853547 . ?ent wdt:P2149 ?obj . ?ent wdt:P176 wd:Q3928891 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Out of all the MSXa manufactured by Radofin, which has the overall fastest clock speed?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q853547 . ?ent wdt:P2149 ?obj . ?ent wdt:P178 wd:Q3928891 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {used by} of {notation} of {Joséphine de Beauharnais} ?",
    "uid": 30509,
    "subgraph": "right-subgraph",
    "template_index": 5,
    "question": "Which is {played as} of {symbol} of {Joséphine de Beauharnais} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q171480 wdt:P913 ?X . ?X wdt:P1535 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is {played as} of {image} of {Joséphine de Beauharnais} ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q28113351 wdt:P913 ?X . ?X wdt:P1535 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Crown agency} with the {MIN(collection or exhibition size)} whose {instance of} is {Crown agency} ?",
    "uid": 31112,
    "subgraph": "rank",
    "template_index": 506,
    "question": "Can you say which Crown agency has the smallest collection?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q5189476 . ?ent wdt:P1436 ?obj . ?ent wdt:P31 wd:Q5189476} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Which Crown agency has the smallest collection?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q22806 . ?ent wdt:P1436 ?obj . ?ent wdt:P31 wd:Q22806} ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {elected in} for {Angela Lansbury} has {award received} as {Tony Award for Best Actress in a Musical} ?",
    "uid": 31595,
    "subgraph": "statement_property",
    "template_index": 3118,
    "question": "Where was Angela Lansbury elected in to receive a Tony Award for Best Actress in a Musical ?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q206856 p:P166 ?s . ?s ps:P166 wd:Q1537996 . ?s pq:P2715 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Where was Angela Lansbury elected in when a Tony Award for Best Actress in a Musical was granted to her?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q206856 p:P166 ?s . ?s ps:P166 wd:Q1537996 . ?s pq:P805 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {is child of} of {William Jennings Bryan}, that has {biological sex} is {male} ?",
    "uid": 13362,
    "subgraph": "right-subgraph",
    "template_index": 2924,
    "question": "Who is the child of William Jennings Bryan that has the biological sex of male?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q205282 wdt:P22 ?answer . ?answer wdt:P21 wd:Q6581097}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q205282> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P22>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P21> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q6581097> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the baby of William Jennings Bryan that has the biological intercourse of male?",
    "answers": [
      "Silas Bryan"
    ]
  },
  {
    "NNQT_question": "What is {executive producer} of {The Apprentice}, that has {investigated by} is {Robert Trump} ?",
    "uid": 30383,
    "subgraph": "right-subgraph",
    "template_index": 65,
    "question": "Who is the showrunner of The Apprentice, who also has been investigated by Robert Trump?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q863122 wdt:P1431 ?answer . ?answer wdt:P1840 wd:Q28748031}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the showrunner of The Apprentice, who additionally has been investigated by Robert Trump?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q863122 wdt:P1431 ?answer . ?answer wdt:P3373 wd:Q28748031}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {holds position} of {Martin McGuinness}, that has {prequel of} is {Member of the 55th Parliament of the United Kingdom} ?",
    "uid": 13990,
    "subgraph": "right-subgraph",
    "template_index": 2059,
    "question": "\"What is {holds position} of {Martin McGuinness}, which has {prequel of} is {Member of the 55th Parliament of the United Kingdom} ?\"",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q57689 wdt:P39 ?answer . ?answer wdt:P156 wd:Q35494253}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q57689> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P39>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P156> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q35494253> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "\"What is {holds position} of {Martin McGuinness}, which has {prequel of} is {Part of the 55th Parliament of the Joined together Kingdom} ?\"",
    "answers": [
      "Member of the 54th Parliament of the United Kingdom"
    ]
  },
  {
    "NNQT_question": "What is the {material used} and the {approved by} of {Mojito} ?",
    "uid": 10141,
    "subgraph": "two intentions right subgraph",
    "template_index": 427,
    "question": "What is the material used and approved by Mojito?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q487338 wdt:P186 ?ans_1 . wd:Q487338 wdt:P790 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q487338> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P186> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q487338> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P790> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What is the material used and accredited by means of Mojito?",
    "answers": [
      "International Bartenders Association",
      "sugar",
      "International Bartenders Association",
      "lime",
      "International Bartenders Association",
      "carbonated water",
      "International Bartenders Association",
      "ice cube",
      "International Bartenders Association",
      "collins glass",
      "International Bartenders Association",
      "lime juice",
      "International Bartenders Association",
      "white rum",
      "International Bartenders Association",
      "lemon slice",
      "International Bartenders Association",
      "mint sprig",
      "International Bartenders Association",
      "mint leaf"
    ]
  },
  {
    "NNQT_question": "What is {award received} of {Theophanu} that is {point in time} is {2017-01-01} ?",
    "uid": 31267,
    "subgraph": "statement_property",
    "template_index": 4841,
    "question": "What award did Theophanu receive in 2017?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q464081 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2017')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What award did Theophanu get in 2017?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q3015088 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2017')) }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nominated for} of {Virgil} that is {point in time} is {1919-01-01} ?",
    "uid": 31412,
    "subgraph": "statement_property",
    "template_index": 170,
    "question": "What was Virgil nominated for in 1919?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1398 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1919')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was Virgil designated for in 1919?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q206446 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1919')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {place of birth} of {Greg Rutherford} that is {located in the administrative territorial entity} is {Umbria} ?",
    "uid": 31360,
    "subgraph": "statement_property",
    "template_index": 3487,
    "question": "Where in the administrative territorial entity of Umbria was Greg Rutherford born?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1745 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q1280 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In what area is the administrative territorial entity of Umbria, where Greg Rutherford was born?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q81819 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q1280 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {total assets} of {Nokia} that is {point in time} is {2012-12-31} ?",
    "uid": 4742,
    "subgraph": "statement_property",
    "template_index": 1187,
    "question": "On December 31, 2012, what were Nokia's total assets?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1418 p:P2403 ?s . ?s ps:P2403 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2012')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1418> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2403> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2012-12-31>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Considering the date of December 31, 2012, what were Nokia's total assets?",
    "answers": [
      "29984000000"
    ]
  },
  {
    "NNQT_question": "What is {educated at} of {Arturo Alessandri} and {academic major}",
    "uid": 32027,
    "subgraph": [],
    "template_index": 217,
    "question": "Where was Arturo Alessandri educated and what did he major in?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q848 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Where was Arturo Alessandri taught and what did he major in?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q174037 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {statement is subject of} for {Iowa} has {business model} as {The Hawkeye State} ?",
    "uid": 31589,
    "subgraph": "statement_property",
    "template_index": 2227,
    "question": "Does Iowa have the Hawkeye State business model?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q1546 p:P7936 ?s . ?s ps:P7936 ?x filter(contains(?x,'The Hawkeye State')) . ?s pq:P805 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Is Hawkeye State the business model of Iowa?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q1546 p:P1449 ?s . ?s ps:P1449 ?x filter(contains(?x,'The Hawkeye State')) . ?s pq:P805 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Chinese character} with the {MAX(stroke count)} ?",
    "uid": 2557,
    "subgraph": "rank",
    "template_index": 133,
    "question": "Which Chinese character has the tallest stroke count?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q53764738 . ?ent wdt:P5205 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q53764738>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P5205>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .}\nORDER BY DESC(?obj)\nLIMIT 5",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "Which Chinese personality has the tallest stroke count?",
    "answers": [
      "龘",
      "鬱",
      "鑑",
      "襲",
      "籠"
    ]
  },
  {
    "NNQT_question": "What is {religious affiliation} of {child of} of {Vladimir the Great} ?",
    "uid": 16491,
    "subgraph": "right-subgraph",
    "template_index": 252,
    "question": "What is the religious affiliation of Vladimir the Great's child?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q14974 wdt:P22 ?X . ?X wdt:P140 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q14974> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P22>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P140> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the spiritual affiliation of Vladimir the Great's child?",
    "answers": [
      "paganism"
    ]
  },
  {
    "NNQT_question": "What is the {Pōmare V} for {award received} of {Angela Lansbury}",
    "uid": 31780,
    "subgraph": "simple question right",
    "template_index": 1550,
    "question": "What is the Pōmare V Angela Lansbury recieved?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q206856 wdt:P166 ?obj . ?obj wdt:P31 wd:Q879812 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me the Pōmare V received by Angela Lansbury",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q206856 wdt:P166 ?obj . ?obj wdt:P31 wd:Q131647 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {position held} of {Charles XIV John of Sweden} that is {IAAF competition category} is {Charles XIII of Sweden} ?",
    "uid": 31370,
    "subgraph": "statement_property",
    "template_index": 3380,
    "question": "What position did Charles XIV John of Sweden take in the IAAF competition category of Charles XIII of Sweden?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q52927 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P7069 wd:Q52928 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was Charles XIII of Sweden IAAF competition category position taken by Charles XIV John of Sweden ?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q52927 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q52928 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {educated at} of {Mao Zedong} that is {start time} is {1912-1-1} ?",
    "uid": 3682,
    "subgraph": "statement_property",
    "template_index": 127,
    "question": "Which school did Mao Zedong attend starting January 1, 1912?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q5816 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1912')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q5816> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P69> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1912-1-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which school did Mao Zedong go to beginning January 1, 1912?",
    "answers": [
      "The First High School of Changsha, Hunan"
    ]
  },
  {
    "NNQT_question": "What is the {location} for {Louis VI of France} has {place of death} as {Château de Saint-Germain-en-Laye} ?",
    "uid": 31607,
    "subgraph": "statement_property",
    "template_index": 756,
    "question": "Did Louis VI of France die at the Château de Saint-Germain-en-Laye?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q165883 p:P20 ?s . ?s ps:P20 wd:Q1520841 . ?s pq:P276 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Is Château de Saint-Germain-en-Laye where Louis VI of France passed?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q165883 p:P20 ?s . ?s ps:P20 wd:Q48622322 . ?s pq:P276 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {works for} of {accused} of {Mariposa Folk Festival 1974} ?",
    "uid": 16037,
    "subgraph": "left-subgraph",
    "template_index": 22,
    "question": "Who works for the accused Mariposa Folk Festival 1974?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q54554872 wdt:P710 ?X . ?X wdt:P108 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q54554872> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P710>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P108> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "The accused Mariposa Folk Festival in 1974 employed whom?",
    "answers": [
      "National Film Board of Canada",
      "Canadian Museum of History",
      "OCAD University"
    ]
  },
  {
    "NNQT_question": "What is {Libraries Australia ID} of {Gareth Bale}",
    "uid": 31045,
    "subgraph": "center",
    "template_index": 3565,
    "question": "Which is the Libraries Australia ID for Gareth Bale?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q184586 wdt:P409 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q184586 wdt:P3043 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {coordinate location} of {Bernhard von Bülow} that is {applies to part} is {river source} ?",
    "uid": 31279,
    "subgraph": "statement_property",
    "template_index": 1189,
    "question": "What five U.S. states does the Bernhard von Bülow drain from?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q60113 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Bernhard von Bülow drains from what 5 us states",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q143762 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {student of} of {Julius Caesar Scaliger}, that has {name in native language} is {Marc Antoine Muret} ?",
    "uid": 30463,
    "subgraph": "right-subgraph",
    "template_index": 2456,
    "question": "What is the master name of Julius Caesar Scaliger, who has the native name Marc Antoine Muret?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q441066 wdt:P1066 ?answer . ?answer wdt:P1559 ?x FILTER(contains(?x,'Marc Antoine Muret'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the ace title of Julius Caesar Scaliger, who has the local title Marc Antoine Muret?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q41568 wdt:P1066 ?answer . ?answer wdt:P1559 ?x FILTER(contains(?x,'Marc Antoine Muret'))}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {pronunciation audio} are for {nickel} ?",
    "uid": 31715,
    "subgraph": "statement_property",
    "template_index": 200,
    "question": "What is the pronunciation audio for nickel?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q744 wdt:P443 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "When does nickel enter a pronunciation audio?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q744 wdt:P1121 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {eye color} of {Watership Down}",
    "uid": 30891,
    "subgraph": "center",
    "template_index": 2550,
    "question": "Which is the eye color of Watership Down?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q936801 wdt:P1340 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q936801 wdt:P212 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {taxon rank} of {parent taxon} of {mango} ?",
    "uid": 30598,
    "subgraph": "right-subgraph",
    "template_index": 88,
    "question": "Which is the rank of the taxon parent of mango?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q169 wdt:P171 ?X . ?X wdt:P105 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is the rank of the taxon parent of mango?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q622525 wdt:P171 ?X . ?X wdt:P105 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Victoria} that {operating area} {all countries} and which contains the word {model} in their name",
    "uid": 31900,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1095,
    "question": "Tell me the Victoria that operates in all countries and contains the word model in it's name?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2132 . ?sbj wdt:P2541 wd:Q62900839 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'model')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Tell me Victoria that operates in all countries and contains the phrase model in it is name?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q58863414 . ?sbj wdt:P2541 wd:Q62900839 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'model')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Heidelberg Academy for Sciences and Humanities member ID} of {Tlalnepantla de Baz Municipality}",
    "uid": 30971,
    "subgraph": "center",
    "template_index": 703,
    "question": "What is the Heidelberg Academy for Sciences and Humanities member ID of Tlalnepantla de Baz?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q845307 wdt:P2273 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q845307 wdt:P3801 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {type of rear suspension} of {National Maritime Museum}",
    "uid": 30887,
    "subgraph": "center",
    "template_index": 452,
    "question": "Which is the type of rear suspension for National Maritime Museum?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1199924 wdt:P6534 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q1199924 wdt:P3481 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {significant event} of {Madonna} that is {point in time} is {1976-11-17} ?",
    "uid": 31421,
    "subgraph": "statement_property",
    "template_index": 133,
    "question": "What was the significant event that happened to Madonna in 1976?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1744 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1976')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1976, what significant event did Madonna experience?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q23842 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1976')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {points classification} are to/by {Chris Froome} ?",
    "uid": 1658,
    "subgraph": "statement_property",
    "template_index": 1002,
    "question": "Chris Froome has how many points classifications?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3494 wd:Q319591 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3494> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q319591 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Provide the number of points classifications for Cris Froome.",
    "answers": [
      "40"
    ]
  },
  {
    "NNQT_question": "What is the {point in time} for {Valery Gergiev} has {award received} as {Honored art worker of the Russian Soviet Federative Socialist Republic} ?",
    "uid": 31621,
    "subgraph": "statement_property",
    "template_index": 2323,
    "question": "In what year was Valery Gergiev awarded the Honored art worker of the Russian Soviet Federative Socialist Republic?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q165693 p:P166 ?s . ?s ps:P166 wd:Q13418138 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "At what time did Valery Gergiev got awarded the Honored art worker of the Russian Soviet Federative Socialist Republic?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q165693 p:P166 ?s . ?s ps:P166 wd:Q4146631 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]