[
  {
    "NNQT_question": "what is the {end time} for {Godfrey of Bouillon} has {noble title} as {ERROR1} ?",
    "uid": 5224,
    "subgraph": "statement_property",
    "template_index": 1669,
    "question": null,
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q76721 p:P97 ?s . ?s ps:P97 wd:Q2874492 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q76721> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P97> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2874492> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": [],
    "answers": [
      "1100-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is the {record label} for {employer} of {Peter Gabriel}",
    "uid": 31880,
    "subgraph": "simple question right",
    "template_index": 3542,
    "question": "What is Peter Gabriel's employer?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q175195 wdt:P108 ?obj . ?obj wdt:P31 wd:Q18127 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is Diminish Gabriel's employer?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q175195 wdt:P264 ?obj . ?obj wdt:P31 wd:Q18127 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {notable work} of {Plato} that is {publication date} is {1963-01-01} ?",
    "uid": 31353,
    "subgraph": "statement_property",
    "template_index": 1929,
    "question": "What work did Plato publish in 1963?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q859 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P577 ?x filter(contains(YEAR(?x),'1963')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was published of Plato publish in 1963?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q1666 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P577 ?x filter(contains(YEAR(?x),'1963')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {ionizing radiation} that starts with {'n'}",
    "uid": 24453,
    "subgraph": "string matching simple contains word",
    "template_index": 754,
    "question": "What are the ionizing radiation which start with the letter n",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q186161 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q186161>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the ionizing radiation that begins with letter n",
    "answers": [
      "neutron radiation"
    ]
  },
  {
    "NNQT_question": "What is the {start time} for {Bengaluru} has {industry} as {Mysore State} ?",
    "uid": 31591,
    "subgraph": "statement_property",
    "template_index": 1515,
    "question": "When was Bangalore industry of the Mysore State?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q1355 p:P452 ?s . ?s ps:P452 wd:Q3374892 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did the Mysore State have Bangalore as industry??",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q1355 p:P131 ?s . ?s ps:P131 wd:Q3374892 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Arab League} has {number of volunteers} as {Ethiopia} ?",
    "uid": 31527,
    "subgraph": "statement_property",
    "template_index": 3191,
    "question": "When was the Arab League founded that has Ethiopia as number of volunteers?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q7172 p:P6125 ?s . ?s ps:P6125 wd:Q115 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What year was the Arab League founded that has Ethiopia as number of volunteers?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q7172 p:P47 ?s . ?s ps:P47 wd:Q115 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {from narrative universe} are for {Muhammad Shah of Brunei} ?",
    "uid": 31672,
    "subgraph": "statement_property",
    "template_index": 344,
    "question": "How many dimensions have a Muhammad Shah of Brunei?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q2658398 wdt:P1080 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Give me the dimensions of Muhammad Shah of Brunei",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q190679 wdt:P1080 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Virgil} has {nominated for} as {Nobel Peace Prize} ?",
    "uid": 31626,
    "subgraph": "statement_property",
    "template_index": 3584,
    "question": "In what year was Virgil nominated for the Nobel Peace Prize?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q1398 p:P1411 ?s . ?s ps:P1411 wd:Q35637 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When was Virgil nominated for the Nobel Peace Prize.",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q155415 p:P1411 ?s . ?s ps:P1411 wd:Q35637 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {has facet polytope} of {subset}",
    "uid": 30948,
    "subgraph": "center",
    "template_index": 1394,
    "question": "Which subset has facet polytope?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q177646 wdt:P1312 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q177646 wdt:P1568 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Bhatpara} for {performer} of {Deadpool}",
    "uid": 31786,
    "subgraph": "simple question right",
    "template_index": 1739,
    "question": "Who was the Bhatpara performer for the movie Deadpool?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q1631090 wdt:P175 ?obj . ?obj wdt:P31 wd:Q854914 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who was the Bhatpara performing artist for the motion picture Deadpool?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q1631090 wdt:P175 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {density} are for {pethidine} ?",
    "uid": 31705,
    "subgraph": "statement_property",
    "template_index": 18,
    "question": "What is the density of pethidine?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q55434 wdt:P2054 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Pethidine has a density of what?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q283 wdt:P2054 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {bowling style} of {Kristen Stewart}, that has {capital of} is {Los Angeles County} ?",
    "uid": 30378,
    "subgraph": "right-subgraph",
    "template_index": 5166,
    "question": "What is the bowling style of Kirsten Stewart, with the county seat of Los Angeles County?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q126599 wdt:P2545 ?answer . ?answer wdt:P1376 wd:Q104994}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the bowling style of Kirsten Stewart, with the district situate of Los Angeles Province?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q126599 wdt:P19 ?answer . ?answer wdt:P1376 wd:Q104994}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {feature film} for {screenwriter} of {Jim Henson}",
    "uid": 30342,
    "subgraph": "simple question left",
    "template_index": 3383,
    "question": "What movie has Jim Henson as screenwriter?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P58 wd:Q191037 . ?sbj wdt:P31 wd:Q24869 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me the film with Jim Henson as screenwriter",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P57 wd:Q191037 . ?sbj wdt:P31 wd:Q24869 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {vegetation zone} that contains the word {taiga} in their name",
    "uid": 23204,
    "subgraph": "string matching simple contains word",
    "template_index": 3805,
    "question": "TELL ME VEGETATION ZONE WHOSE NAME HAS THE WORD TAIGA IN IT",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2083910 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'taiga')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2083910>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'taiga')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let Me know VEGETATION ZONE WHOSE Title HAS THE WORD TAIGA IN IT",
    "answers": [
      "taiga"
    ]
  },
  {
    "NNQT_question": "What is the {musical theatre} for {screenwriter} of {T. S. Eliot}",
    "uid": 30326,
    "subgraph": "simple question left",
    "template_index": 3522,
    "question": "Which musical did T. S. Eliot write?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P58 wd:Q37767 . ?sbj wdt:P31 wd:Q2743 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which melodic did T. S. Eliot write?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P58 wd:Q180975 . ?sbj wdt:P31 wd:Q2743 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {astronaut mission} are for {Yury Romanenko} ?",
    "uid": 1068,
    "subgraph": "statement_property",
    "template_index": 68,
    "question": "How many space missions did Yury Romanenko complete?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q446720 wdt:P450 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q446720> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P450> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Yuri Romanenko has done several flights How many?\n ",
    "answers": [
      "5"
    ]
  },
  {
    "NNQT_question": "What is the {trans-Neptunian object} with the {MAX(rotation period)} ?",
    "uid": 31089,
    "subgraph": "rank",
    "template_index": 224,
    "question": "which trans-Neptunian object has the highest rotation period?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q6592 . ?ent wdt:P2147 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "What is the highest rotation period of trans-Neptunian object",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q2199 . ?ent wdt:P2147 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {writing system} of {languages spoken, written or signed} of {Leo Ortolani} ?",
    "uid": 30612,
    "subgraph": "left-subgraph",
    "template_index": 33170,
    "question": "What is alphabet  language signed of  Leo Ortolani ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1395 wdt:P1412 ?X . ?X wdt:P282 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Leo Ortolani signed what alphabet language?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q3594014 wdt:P1412 ?X . ?X wdt:P282 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {place of death} are to/by {Maracanã Stadium} ?",
    "uid": 31748,
    "subgraph": "statement_property",
    "template_index": 1497,
    "question": "Is Estadio do Maracana a place of death?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P20 wd:Q155174 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Is the venue Estadio do Maracana a place of death?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P115 wd:Q155174 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {interaction} of {antiparticle (symmetric correspondence)}, that has {Q48460} is {521.1} ?",
    "uid": 12426,
    "subgraph": "right-subgraph",
    "template_index": 66,
    "question": "What is the interaction of antiparticle symmetric correspondence with Q48460 521.1?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q182717 wdt:P517 ?answer . ?answer wdt:P1036 ?x FILTER(contains(?x,'521.1'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q182717> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P517>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1036> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <521.1> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the interaction of antiparticle symmetric correspondence with Q48460 521.1?",
    "answers": [
      "gravity"
    ]
  },
  {
    "NNQT_question": "How many {employer} are for {Luigi Pirandello} ?",
    "uid": 31694,
    "subgraph": "statement_property",
    "template_index": 86,
    "question": "How many employers are there for Luigi Pirandello?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q1403 wdt:P108 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Luigi Pirandello worked for what number of employers?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q13424289 wdt:P108 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {legal form} of {Thursday}",
    "uid": 30780,
    "subgraph": "center",
    "template_index": 1010,
    "question": "What is the legal form for Thursday?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1454 wd:Q129}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P3025 wd:Q129}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Boris Johnson} has {position held} as {Marcus Garvey} ?",
    "uid": 31499,
    "subgraph": "statement_property",
    "template_index": 1942,
    "question": "When was Boris Johnson the Member of the Marcus Garvey?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q180589 p:P39 ?s . ?s ps:P39 wd:Q272504 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "On what date did Boris Johnson the Marcus Garvey?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q180589 p:P39 ?s . ?s ps:P39 wd:Q30524718 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {automobile model} for {manufacturer} of {Studebaker-Garford}",
    "uid": 30283,
    "subgraph": "simple question left",
    "template_index": 3717,
    "question": "Which is the automobile model that is manufactured by Studebaker-Garford?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P176 wd:Q250484 . ?sbj wdt:P31 wd:Q3231690 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is the vehicle demonstrate that's fabricated by Studebaker-Garford?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P176 wd:Q9584 . ?sbj wdt:P31 wd:Q3231690 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {International Olympic Committee athlete ID} of {Irenaeus}",
    "uid": 30821,
    "subgraph": "center",
    "template_index": 1097,
    "question": "What's Irenaeus's International Olympic Committee athlete ID.",
    "sparql_wikidata": "select distinct ?answer where { wd:Q182123 wdt:P3171 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q235975 wdt:P3171 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Baseball-Reference.com major league player ID} of {Marcel Mauss}",
    "uid": 30974,
    "subgraph": "center",
    "template_index": 3747,
    "question": "Which is the Baseball-Reference.com major league player ID of Marcel Mauss?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q295393 wdt:P1825 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q295393 wdt:P5546 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {uses} of {sport} of {blunt instrument} ?",
    "uid": 30605,
    "subgraph": "right-subgraph",
    "template_index": 35,
    "question": "What kind of instrument is made with blunt instrument?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q339828 wdt:P641 ?X . ?X wdt:P2283 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What kind of tool is made of blunt instrument?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q471447 wdt:P641 ?X . ?X wdt:P2283 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {quotation or excerpt} {Cyprinus rubrofuscus} that contains the word {koi} in their name",
    "uid": 31213,
    "subgraph": "string matching simple contains word",
    "template_index": 2297,
    "question": "Tell me thing with cyprinus rubrofuscus quotation whose name has the word koi in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P7081 wd:Q3246258 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'koi')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know object with cyprinus rubrofuscus quotation whose title has the word koi in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3246258 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'koi')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {founded by} of {employer} of {Scotty McCreery} ?",
    "uid": 30727,
    "subgraph": "left-subgraph",
    "template_index": 764,
    "question": "who co-founded by of employer of scotty mcCreery ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q255969 wdt:P108 ?X . ?X wdt:P112 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "who co-founded by of employer of scotty mcCreery ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q255969 wdt:P264 ?X . ?X wdt:P112 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {literary hexalogy} that starts with {'t'}",
    "uid": 31185,
    "subgraph": "string matching simple contains word",
    "template_index": 3032,
    "question": "What's the name of a literary hexalogy that starts with the letter \"t\"?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q52269333 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name a literary hexalogy that begins with \"t\".",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1667921 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {lyrics by} of {Willie Has Gone To War}, that has {occupation} is {lyricist} ?",
    "uid": 30464,
    "subgraph": "right-subgraph",
    "template_index": 199,
    "question": "What are the words by Willie Has Gone To War whose career is lyricist?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q22043379 wdt:P676 ?answer . ?answer wdt:P106 wd:Q822146}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are Willie Has Gone To War's words with a lyrical career?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1153133 wdt:P676 ?answer . ?answer wdt:P106 wd:Q822146}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {occupant} are to/by {Derby} ?",
    "uid": 31727,
    "subgraph": "statement_property",
    "template_index": 1470,
    "question": "How many works are occupied in the Derby?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P466 wd:Q43475 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "How many works are contained within the Derby?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P466 wd:Q190804 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Auñamendi ID} of {Jalal al-Din al-Suyuti}",
    "uid": 30841,
    "subgraph": "center",
    "template_index": 949,
    "question": "What is Auñamendi ID of Jalal al-Din al-Suyuti ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q468432 wdt:P3218 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q318500 wdt:P3218 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {point in time} for {Niels Bohr} has {nominated for} as {Nobel Prize in Physics} ?",
    "uid": 3559,
    "subgraph": "statement_property",
    "template_index": 4,
    "question": "When was Niels Bohr nominated for a Nobel Prize in Physics?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q7085 p:P1411 ?s . ?s ps:P1411 wd:Q38104 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7085> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q38104> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When was Niels Bohr shortlisted for the Nobel Prize in Physics?",
    "answers": [
      "1920-01-01T00:00:00Z",
      "1919-01-01T00:00:00Z",
      "1921-01-01T00:00:00Z",
      "1918-01-01T00:00:00Z",
      "1922-01-01T00:00:00Z",
      "1917-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {cardinality of this set} of {input set} of {complex logarithm} ?",
    "uid": 17481,
    "subgraph": "right-subgraph",
    "template_index": 35,
    "question": "What is the cardinality of the complex logarithm input set?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2520206 wdt:P1851 ?X . ?X wdt:P2820 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2520206> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1851>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2820> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the cardinality of the complex logarithm input set?",
    "answers": [
      "cardinality of the continuum"
    ]
  },
  {
    "NNQT_question": "What is the {net worth} for {Roman Abramovich} has {spouse} as {Irina Abramovich} ?",
    "uid": 31522,
    "subgraph": "statement_property",
    "template_index": 2671,
    "question": "What was the net worth of Roman Abramovich when he married Irina Abramovich?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q171428 p:P26 ?s . ?s ps:P26 wd:Q46109451 . ?s pq:P2218 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was Roman Abramovich net worth during his wedding with Irina Abramovich?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q171428 p:P26 ?s . ?s ps:P26 wd:Q46109451 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {followed by} of {narrative location} of {Methodus Plantas Horti Botanici et Agri Marburgensis} ?",
    "uid": 30707,
    "subgraph": "right-subgraph",
    "template_index": 3521,
    "question": "Who gave the {prequel of} of {location of narrative} of {Methodus Plantas Horti Botanici et Agri Marburgensis} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q6011858 wdt:P840 ?X . ?X wdt:P156 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who gave the prequel of location of narrative of Methodus Plantas Horti Botanici et Agri Marburgensis ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q215894 wdt:P840 ?X . ?X wdt:P156 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]