[
  {
    "NNQT_question": "What is {category for recipients of this award} of {Suppiluliuma I}",
    "uid": 30840,
    "subgraph": "center",
    "template_index": 2101,
    "question": "What is the category for recipients for Suppiluliuma I?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q354903 wdt:P2517 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q7191 wdt:P2517 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {unmarried partner} of {Beverly Shaw}, that has {award received} is {Knight of the Order of Leopold} ?",
    "uid": 30458,
    "subgraph": "right-subgraph",
    "template_index": 3624,
    "question": "Who is the Mistress of Beverly Shaw, who is also the winner of the \"Knight of the Order of Leopold\"?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q24704679 wdt:P451 ?answer . ?answer wdt:P166 wd:Q14900497}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the Special lady of Beverly Shaw, who is additionally the champ of the \"Knight of the Arrange of Leopold\"?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q40531 wdt:P451 ?answer . ?answer wdt:P166 wd:Q14900497}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Academia.edu institutional ID} of {Fawcett Comics-DC Comics}",
    "uid": 30992,
    "subgraph": "center",
    "template_index": 109,
    "question": "Which is the Academia.edu institutional ID for Fawcett Comics-DC Comics?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q933317 wdt:P4052 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q691851 wdt:P4052 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {participant in} of {boy}, that has {use} is {classical antiquity} ?",
    "uid": 30376,
    "subgraph": "right-subgraph",
    "template_index": 23,
    "question": "\"What involved boys as participants, that was in use during classical antiquity?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3010 wdt:P1344 ?answer . ?answer wdt:P366 wd:Q486761}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What involved boys as participants that was typical of classical antiquity?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q3010 wdt:P1344 ?answer . ?answer wdt:P2348 wd:Q486761}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {coordinates of northernmost point} of {specific absorption rate} of {Balkans Campaign} ?",
    "uid": 30562,
    "subgraph": "right-subgraph",
    "template_index": 635,
    "question": "Which  is farthest north of specific absorption rate of Balkans Campaign?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q789406 wdt:P7080 ?X . ?X wdt:P1332 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is most remote north of specific absorption rate of Balkans Campaign?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q789406 wdt:P276 ?X . ?X wdt:P1332 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Pedro Aguirre Cerda} has {award received} as {Grammy Award for Best Opera Recording} ?",
    "uid": 31549,
    "subgraph": "statement_property",
    "template_index": 5509,
    "question": "When did Pedro Aguirre Cerda received the Grammy Award for Best Opera Recording?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q845 p:P166 ?s . ?s ps:P166 wd:Q5593843 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "when did Pedro Aguirre Cerda receive a grammy award?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q117710 p:P166 ?s . ?s ps:P166 wd:Q5593843 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {operator} of {military branch} of {Robert D. Russ} ?",
    "uid": 30749,
    "subgraph": "left-subgraph",
    "template_index": 2017,
    "question": "What is operator of the Service Branch of Robert D. Russ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7343340 wdt:P241 ?X . ?X wdt:P137 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is Robert D. Russ's Service Branch's operator?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q7343340 wdt:P241 ?X . ?X wdt:P121 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {unemployment rate} of {candidate} of {Eastern Front} ?",
    "uid": 14972,
    "subgraph": "right-subgraph",
    "template_index": 6285,
    "question": "What is the unemployment rate of the candidate on the Eastern Front?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q23908696 wdt:P710 ?X . ?X wdt:P1198 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q23908696> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P710>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1198> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the unemployment rate?",
    "answers": [
      "3",
      "4.2",
      "8",
      "9",
      "9",
      "7",
      "5"
    ]
  },
  {
    "NNQT_question": "What is {subclass of} of {pentachoron}",
    "uid": 30816,
    "subgraph": "center",
    "template_index": 542,
    "question": "Pentachoron is subclass of what?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P279 wd:Q1634717}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1322 wd:Q1634717}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {starring} of {in work} of {Ian Carlyle} ?",
    "uid": 14937,
    "subgraph": "left-subgraph",
    "template_index": 83,
    "question": "Who stars with Ian Carlyle in the production?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q42421333 wdt:P1441 ?X . ?X wdt:P161 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q42421333> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1441>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P161> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who stars with Ian Carlyle within the generation?",
    "answers": [
      "Eric Idle",
      "Kat Dennings",
      "Kathy Najimy",
      "Tommy Davidson",
      "Devon Bostick",
      "Mark Rendall",
      "Nigel Bennett",
      "Kim Coates",
      "Kay Hawtrey",
      "Zoie Palmer",
      "Gary Reineke",
      "Arlene Duncan",
      "Joseph Motiki",
      "Scott Wickware",
      "Tedde Moore",
      "Robert Bockstael",
      "Colleen Reynolds",
      "Edie Inksetter",
      "Richard Tse",
      "Joan Heney",
      "Peter Elliot",
      "Richard Ryder",
      "Paula Boudreau",
      "Lila Yee",
      "Andrew Scorer",
      "Chris Currie",
      "Ann Marin",
      "Jake Simons",
      "Greg Barry",
      "Allan Gillespie"
    ]
  },
  {
    "NNQT_question": "What is the {time of the day} with the {MIN(time index)} whose {has quality} is {time of the day} ?",
    "uid": 31133,
    "subgraph": "rank",
    "template_index": 702,
    "question": "What is time of the day that has the minimum time index and has quality of time of the Day?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P1552 wd:Q1260524 . ?ent wdt:P4895 ?obj . ?ent wdt:P1552 wd:Q1260524} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "What is time of the day that has the least time list and has quality of time of the Day",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q1260524 . ?ent wdt:P4895 ?obj . ?ent wdt:P31 wd:Q1260524} ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {end time} for {Virgil} has {position held} as {Chair of the Federal Reserve} ?",
    "uid": 31624,
    "subgraph": "statement_property",
    "template_index": 3319,
    "question": "When did Virgil leave his position as Chair of the Federal Reserve?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q1398 p:P39 ?s . ?s ps:P39 wd:Q2666591 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Virgil left his position as Chair of the Federal Reserve on what date?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q193635 p:P39 ?s . ?s ps:P39 wd:Q2666591 . ?s pq:P582 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Sandbox-String} of {svedberg}",
    "uid": 31019,
    "subgraph": "center",
    "template_index": 2612,
    "question": "Which is the Sandbox-String for svedberg?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1472674 wdt:P370 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q42289 wdt:P370 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {parent company of} of {label} of {Carabao} ?",
    "uid": 16556,
    "subgraph": "right-subgraph",
    "template_index": 26,
    "question": "Who is the parent company of the label of Carabao?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1035286 wdt:P264 ?X . ?X wdt:P355 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1035286> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P264>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P355> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which parent company owns the label of Carabao?",
    "answers": [
      "Roadrunner Records",
      "EMI",
      "Kontor Records",
      "Atco Records",
      "Maybach Music Group",
      "Rhino Entertainment Company",
      "Reprise Records",
      "Rykodisc",
      "Elektra",
      "Warner Music Japan",
      "Fueled by Ramen LLC",
      "Grand Hustle Records",
      "Telltale Games",
      "Giant Records",
      "Tommy Boy Records",
      "Nonesuch",
      "Asylum Records",
      "Lava Records",
      "Mushroom Records",
      "Spinnin' Records",
      "East West Records",
      "Metamorfosis",
      "Warner Music France",
      "Atlantic Records Group",
      "Maverick Films",
      "Warner Music Canada",
      "Warner Chappell Music, Inc.",
      "Alternative Distribution Alliance",
      "Big Beat Records",
      "Cordless Recordings",
      "Full Moon Records",
      "Gold Typhoon",
      "London-Sire Records",
      "Peerless Records",
      "Penalty Recordings",
      "RuffNation Records",
      "Warner Music Latina",
      "Warner Music Vision",
      "Warner Strategic Marketing",
      "EMI Music Poland Sp. z o.o.",
      "Warner Music Germany",
      "Warner Music Taiwan",
      "Warner Music Hong Kong",
      "OVO Sound",
      "Warner Music Poland Sp. z o.o.",
      "Word Entertainment",
      "Gala Records",
      "Parlophone Label Group",
      "Warner Music Russia",
      "Warner Music International, Inc."
    ]
  },
  {
    "NNQT_question": "Give me {operator} {town in Croatia} that contains the word {šibenik} in their name",
    "uid": 31217,
    "subgraph": "string matching simple contains word",
    "template_index": 1143,
    "question": "Tell me element with town in Croatia as operator whose name has the word šibenik in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P137 wd:Q15105893 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'šibenik')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know thing using town in Croatia as operator whose title has the word šibenik in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15105893 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'šibenik')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {par} are to/by {Discovery Channel} ?",
    "uid": 31733,
    "subgraph": "statement_property",
    "template_index": 1440,
    "question": "What is the number of pars of the Discovery Channel?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3530 wd:Q43404 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "The Discovery Channel has how many pars?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P449 wd:Q43404 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of the deme} of {Iker Casillas} that is {start time} is {1999-01-01} ?",
    "uid": 31374,
    "subgraph": "statement_property",
    "template_index": 4989,
    "question": "What is the member of the deme of Iker Casillas that starts January 1st, 1991?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q11584 p:P2462 ?s . ?s ps:P2462 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1999')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Who became a member of the deme Iker Casillas on January 1st, 1991?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q11584 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1999')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {earliest date} for {New Age} has {located on terrain feature} as {Egypt} ?",
    "uid": 31544,
    "subgraph": "statement_property",
    "template_index": 4631,
    "question": "Since when was New Age found in Egypt?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q183308 p:P706 ?s . ?s ps:P706 wd:Q202311 . ?s pq:P1319 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "New Age was discovered in Egypt when?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q131165 p:P706 ?s . ?s ps:P706 wd:Q202311 . ?s pq:P1319 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {depicts} of {Virgin of the Rocks}, that has {place of birth} is {pipefitter} ?",
    "uid": 30351,
    "subgraph": "right-subgraph",
    "template_index": 9,
    "question": "Who is depicted in Virgin of the Rocks painting, which birth city is pipefitter?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q269342 wdt:P180 ?answer . ?answer wdt:P19 wd:Q5407416}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the main subject of Virgin of the Rocks painting, which was born in pipefitter?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q269342 wdt:P180 ?answer . ?answer wdt:P19 wd:Q1132798}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Harmonized System Code} {mathematical notation} that starts with {'s'}",
    "uid": 31210,
    "subgraph": "string matching simple contains word",
    "template_index": 2992,
    "question": "what are the element using mathematical notation Harmonized System Code which start with the letter s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P5471 wd:Q1140046 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "what are the things using numerical documentation Harmonized System Code which begin with the letter s",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1140046 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {WordNet 3.1 Synset ID} of {Thomas Hunt Morgan} and {point in time}",
    "uid": 32040,
    "subgraph": [],
    "template_index": 1262,
    "question": "What was the WordNet 3.1 Synset ID of Thomas Hunt Morgan and when did he receive it?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q177681 p:P8814 ?s . ?s ps:P8814 ?obj . ?s pq:P585 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What WordNet 3.1 Synset ID was assigned to Thomas Hunt Morgan and on which date he receiced it.",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q177681 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {military rank} are to/by {colonel} ?",
    "uid": 2418,
    "subgraph": "statement_property",
    "template_index": 1762,
    "question": "What is the military rank of the colonel?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P410 wd:Q104680 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P410> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q104680 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "For the colonel, what is the military rank?",
    "answers": [
      "12073"
    ]
  },
  {
    "NNQT_question": "Give me {Speed-Badminton} that {coat of arms} {royal coat of arms of the United Kingdom} and which contains the word {british} in their name",
    "uid": 31903,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3209,
    "question": "Name an speed-badminton that contains the word \"british\" in its name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16520119 . ?sbj wdt:P237 wd:Q165762 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'british')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Title a Speed-Badminton that contains the word \"british\" in its name",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q48349 . ?sbj wdt:P237 wd:Q165762 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'british')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {point in time} for {Willem Frederik Hermans} has {award received} as {ERROR1} ?",
    "uid": 8201,
    "subgraph": "statement_property",
    "template_index": 4646,
    "question": null,
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q437771 p:P166 ?s . ?s ps:P166 wd:Q2705788 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q437771> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2705788> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": [],
    "answers": [
      "1949-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "Give me {Mahavidya} that contains the word {tara} in their name",
    "uid": 23500,
    "subgraph": "string matching simple contains word",
    "template_index": 149,
    "question": "Tell me Mahavidya whose name has the word tara in it",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1076022 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tara')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1076022>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tara')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me Mahavidya whose name contains the word tara.",
    "answers": [
      "Tara"
    ]
  },
  {
    "NNQT_question": "Give me {postgraduate degree} that contains the word {philosophy} in their name",
    "uid": 23785,
    "subgraph": "string matching simple contains word",
    "template_index": 1294,
    "question": "Tell me postgraduate degree whose name has the word philosophy in it",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23015928 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'philosophy')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q23015928>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'philosophy')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know postgraduate degree whose title has the word reasoning in it",
    "answers": [
      "Doctor of Philosophy",
      "Doktor Nauk in Philosophy",
      "Doctor of Philosophy in Electrical Engineering"
    ]
  },
  {
    "NNQT_question": "What is {nominated for} of {Mira Sorvino} that is {statement is subject of} is {Ólafur Ragnar Grímsson} ?",
    "uid": 31291,
    "subgraph": "statement_property",
    "template_index": 2617,
    "question": "In the Ólafur Ragnar Grímsson, what nomination did Mira Sorvino receive?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q212026 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q57284 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Mira Sorvino was a nominee for which category in the Ólafur Ragnar Grímsson?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q212026 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q903494 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Smithsonian volcano ID} of {La Garita Caldera}",
    "uid": 30928,
    "subgraph": "center",
    "template_index": 1142,
    "question": "What is the volcano ID, assigned by the Smithsonian, for La Garita Caldera?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q624994 wdt:P1886 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q818475 wdt:P1886 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {doctoral advisor} of {conscription number} of {Anthony Giddens, Baron Giddens} ?",
    "uid": 30553,
    "subgraph": "left-subgraph",
    "template_index": 15,
    "question": "what is {PhD advisor} of {conscription number} of {Anthony Giddens, Baron Giddens} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q220008 wdt:P4856 ?X . ?X wdt:P184 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is the {PhD advisor} of {Anthony Giddens, Baron Giddens}s' {conscription number}?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q220008 wdt:P737 ?X . ?X wdt:P184 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {archives at} of {Milton Friedman Correa} and {academic major}",
    "uid": 32042,
    "subgraph": [],
    "template_index": 1196,
    "question": "Where were Milton Friedman archives and what was his academic major?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q47426 p:P485 ?s . ?s ps:P485 ?obj . ?s pq:P812 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Where were Milton Friedman archives and what was his degree in?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q47426 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {start time} for {The Tonight Show} has {presenter} as {Johnny Carson} ?",
    "uid": 7933,
    "subgraph": "statement_property",
    "template_index": 4378,
    "question": "When did Johnny Carson start as the presenter for The Tonight Show?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q1338655 p:P371 ?s . ?s ps:P371 wd:Q310819 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1338655> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P371> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q310819> .\n?statement <http://www.wikidata.org/entity/P580> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Give the date Johnny Carson began as the presenter for The Tonight Show.",
    "answers": [
      "1962-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {copyright license} of {location of creation} of {zygote} ?",
    "uid": 30554,
    "subgraph": "right-subgraph",
    "template_index": 0,
    "question": "Which  copyright license of place built of zygote ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q170145 wdt:P1071 ?X . ?X wdt:P275 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which copyright license of put built of zygote ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q170145 wdt:P1071 ?X . ?X wdt:P927 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {mushroom cap shape} of {Choe Chiwon}",
    "uid": 30885,
    "subgraph": "center",
    "template_index": 1381,
    "question": "Which is the mushroom cap shape for Choe Chiwon?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q487042 wdt:P784 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q487042 wdt:P4760 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  }
]