[
  {
    "NNQT_question": "What is the {from fictional universe} and the {creator} of {Green_Lantern} ?",
    "uid": 10189,
    "subgraph": "two intentions right subgraph",
    "template_index": 591,
    "question": "What fictional universe did Green Lantern take place in and who create Green Lantern?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q32884 wdt:P1080 ?ans_1 . wd:Q32884 wdt:P170 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q32884> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1080> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q32884> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P170> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Who created Green Lantern, and which fictional universe did it take place in?",
    "answers": [
      "DC Universe",
      "Bill Finger"
    ]
  },
  {
    "NNQT_question": "Give me {Children's Aid Society} that contains the word {veritas} in their name",
    "uid": 31194,
    "subgraph": "string matching simple contains word",
    "template_index": 1724,
    "question": "Tell me Children's Aid Society whose name has the word veritas in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5098014 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'veritas')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me Children's Aid Society whose title has the word veritas in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7278 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'veritas')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {time of the day} that starts with {'m'}",
    "uid": 24502,
    "subgraph": "string matching simple contains word",
    "template_index": 2129,
    "question": "What is a time of day that starts with the letter m.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1260524 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1260524>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What's a time of day with letter m beginning.",
    "answers": [
      "morning"
    ]
  },
  {
    "NNQT_question": "What is the {country} for {diplomatic relation} of {Beijing}",
    "uid": 30344,
    "subgraph": "simple question left",
    "template_index": 3143,
    "question": "Which country has diplomatic relations with Beijing?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P530 wd:Q956 . ?sbj wdt:P31 wd:Q6256 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me the country Beijing has diplomatic relations with",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P150 wd:Q956 . ?sbj wdt:P31 wd:Q6256 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {compArt person ID} of {Charles V of France}",
    "uid": 30843,
    "subgraph": "center",
    "template_index": 3655,
    "question": "What is Charles V of France's compArt person ID?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q167782 wdt:P4772 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q296809 wdt:P4772 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {father} of {child} of {Edgar Ney} ?",
    "uid": 30713,
    "subgraph": "left-subgraph",
    "template_index": 93,
    "question": "Who has the daughter and son of Edgar Ney ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3047474 wdt:P40 ?X . ?X wdt:P22 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who has the daughter and son of Edgar Ney ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q2826888 wdt:P40 ?X . ?X wdt:P22 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {protein synthesis inhibitors} for {significant drug interaction} of {(RS)-methadone}",
    "uid": 30319,
    "subgraph": "simple question left",
    "template_index": 1775,
    "question": "Which protein synthesis inhibitors have a significant drug interaction with (RS)-methadone?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P769 wd:Q179996 . ?sbj wdt:P31 wd:Q7251505 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me the protein synthesis inhibitors with a significant drug interaction with (RS)-methadone",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P769 wd:Q179996 . ?sbj wdt:P31 wd:Q11173 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Aetae} that contains the word {zeus} in their name",
    "uid": 31226,
    "subgraph": "string matching simple contains word",
    "template_index": 3187,
    "question": "What are the Aetae which start with the letter zeus",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21548017 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zeus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name the Aetae whose name begins with zeus",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22989102 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zeus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {voice actor} of {Last Exile}, that has {place of birth} is {St. Petersburg} ?",
    "uid": 30473,
    "subgraph": "right-subgraph",
    "template_index": 1833,
    "question": "Who is the voice actor of Last Exile that was born in St. Petersburg?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1052846 wdt:P725 ?answer . ?answer wdt:P19 wd:Q49236}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the actor that voiced Last Exile and was born in St. Petersburg?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1052846 wdt:P725 ?answer . ?answer wdt:P551 wd:Q49236}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {birth name} are for {George Washington} ?",
    "uid": 31708,
    "subgraph": "statement_property",
    "template_index": 509,
    "question": "How many birth name are for George Washington?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q23 wdt:P1477 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "George Washington has how many birth names?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q4605 wdt:P1477 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nominated for} of {Star Wars: Episode V – The Empire Strikes Back} that is {winner} is {Bill Varney} ?",
    "uid": 31452,
    "subgraph": "statement_property",
    "template_index": 1692,
    "question": "For Bill Varney was Star Wars Episode V: the Empire strikes back of nominated in winner?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q181795 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1346 wd:Q4911227 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What is the award that Bill Varney was nominated for the Star Wars Episode V: The Empire Strikes Back?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q181795 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 wd:Q4911227 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {field of work} of {discoverer or inventor} of {Euler's theorem} ?",
    "uid": 30690,
    "subgraph": "right-subgraph",
    "template_index": 406,
    "question": "What academic subject is Euler's theorem the discoverer of?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q193910 wdt:P61 ?X . ?X wdt:P101 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which academic subject is the discoverer's theorem of Euler?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q204819 wdt:P61 ?X . ?X wdt:P101 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {base} of {zero} that is {follows} is {−2} ?",
    "uid": 31322,
    "subgraph": "statement_property",
    "template_index": 5291,
    "question": "What base of zero follows -2?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q204 p:P3263 ?s . ?s ps:P3263 ?obj . ?s pq:P155 wd:Q3827340 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "-2 is followed by which base of zero?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q204 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P155 wd:Q3827340 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {won by} of {honorary title} of {The Settlers of Catan} ?",
    "uid": 15322,
    "subgraph": "right-subgraph",
    "template_index": 352,
    "question": "What is won by the honorary titles of The Settlers of Catan?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q17271 wdt:P166 ?X . ?X wdt:P1346 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q17271> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1346> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is won by the privileged titles of The Pioneers of Catan?",
    "answers": [
      "Carcassonne",
      "The Settlers of Catan",
      "7 Wonders",
      "6 Nimmt!",
      "Hoity Toity",
      "Agricola",
      "Amun-Re",
      "Taj Mahal",
      "Fresco",
      "Louis XIV",
      "Caylus",
      "The Flying Dutchman",
      "Dominion",
      "El Grande",
      "Tigris and Euphrates",
      "Puerto Rico",
      "The Pillars of the Earth (board game)",
      "Modern Art",
      "Saint Petersburg",
      "Tikal",
      "Löwenherz",
      "Village",
      "Terra Mystica",
      "Russian Railroads",
      "The Voyages of Marco Polo",
      "Terraforming Mars",
      "Mombasa",
      "Master Labyrinth",
      "Azul",
      "Wingspan",
      "The Crew: The Quest for Planet Nine",
      "Carcassonne",
      "The Settlers of Catan",
      "Torres",
      "Keltis",
      "liar's dice",
      "Zooloretto",
      "Ticket to Ride",
      "Focus",
      "Qwirkle",
      "Hoity Toity",
      "Top Secret Spies",
      "Niagara",
      "Auf Achse",
      "Barbarossa",
      "Scotland Yard",
      "Railway Rivals",
      "Sherlock Holmes Consulting Detective",
      "Rummikub",
      "Dixit"
    ]
  },
  {
    "NNQT_question": "How many {owner of} are for {Nissan} ?",
    "uid": 1267,
    "subgraph": "statement_property",
    "template_index": 267,
    "question": "How many people own a Nissan?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q20165 wdt:P1830 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q20165> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1830> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Nissans are owned by how many people?",
    "answers": [
      "4"
    ]
  },
  {
    "NNQT_question": "What is {solubility} of {Su Qin} that is {solvent} is {water} ?",
    "uid": 31278,
    "subgraph": "statement_property",
    "template_index": 1680,
    "question": "What is the solubility of Su Qin in water?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q716543 p:P2177 ?s . ?s ps:P2177 ?obj . ?s pq:P2178 wd:Q283 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which is the solubility of Su Qin in water?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q422709 p:P2177 ?s . ?s ps:P2177 ?obj . ?s pq:P2178 wd:Q283 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {stock exchange} of {Philippe Pétain} that is {ticker symbol} is {0700} ?",
    "uid": 31276,
    "subgraph": "statement_property",
    "template_index": 3783,
    "question": "What is the stock exchange for the ticker symbol 0700 in Philippe Pétain?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q5721 p:P414 ?s . ?s ps:P414 ?obj . ?s pq:P249 ?x filter(contains(?x,'0700')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What is the the symbol for stock 0700 in Philippe Pétain?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q860580 p:P414 ?s . ?s ps:P414 ?obj . ?s pq:P249 ?x filter(contains(?x,'0700')) }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {population} of {Washington, D.C.} that is {repealed by} is {1860-01-01} ?",
    "uid": 31307,
    "subgraph": "statement_property",
    "template_index": 842,
    "question": "What was the population of Washington, D.C. repealed by 1860?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q61 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P2568 ?x filter(contains(YEAR(?x),'1860')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was the census of Washington, D.C. repealed by 1860?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q61 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1860')) }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Cooper-Hewitt Person ID} of {Donatello}",
    "uid": 30963,
    "subgraph": "center",
    "template_index": 3280,
    "question": "Which is the Cooper-Hewitt Person ID of Donatello?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q37562 wdt:P2011 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q37562 wdt:P650 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {position} with the {MIN(term length of office)} whose {subclass of} is {elective office} ?",
    "uid": 31127,
    "subgraph": "rank",
    "template_index": 608,
    "question": "Which elective office has the shortest term length of office?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q4164871 . ?ent wdt:P2097 ?obj . ?ent wdt:P279 wd:Q17279032} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "The shortest term for elective office is?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q4164871 . ?ent wdt:P2097 ?obj . ?ent wdt:P279 wd:Q48352} ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {electrical resistivity} {Luther city} that contains the word {worms} in their name",
    "uid": 31170,
    "subgraph": "string matching simple contains word",
    "template_index": 1912,
    "question": "Name an element with an electrical resistivity of Luther city that contain the word \"worms \" in its name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P5679 wd:Q1547289 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'worms')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name an object with an electrical resistivity of Luther town in its name containing the word \"worms\"",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1547289 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'worms')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {soil type} that contains the word {vertisol} in their name",
    "uid": 23684,
    "subgraph": "string matching simple contains word",
    "template_index": 464,
    "question": "Tell me soil type whose name has the word vertisol in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10926413 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vertisol')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q10926413>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vertisol')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Disclose to me soil type whose name has the word vertisol in it.",
    "answers": [
      "Vertisol"
    ]
  },
  {
    "NNQT_question": "What is {has villages} of {endemism} of {leafy seadragon} ?",
    "uid": 14505,
    "subgraph": "right-subgraph",
    "template_index": 215,
    "question": "which of the villages has endemism of leafy seadragon?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q501644 wdt:P183 ?X . ?X wdt:P150 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q501644> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P183>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P150> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "which of the towns has endemism of verdant seadragon?",
    "answers": [
      "Western Australia",
      "New South Wales",
      "Northern Territory",
      "Australian Capital Territory",
      "Jervis Bay Territory",
      "Norfolk Island",
      "Christmas Island",
      "Tasmania",
      "South Australia",
      "Cocos (Keeling) Islands",
      "Queensland",
      "Victoria",
      "Heard Island and McDonald Islands",
      "Ashmore and Cartier Islands",
      "Coral Sea Islands",
      "Australian Antarctic Territory"
    ]
  },
  {
    "NNQT_question": "How many {social classification} are to/by {knyaz} ?",
    "uid": 31761,
    "subgraph": "statement_property",
    "template_index": 1570,
    "question": "How many different knyaz social classifications are there?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3716 wd:Q273613 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "What is the number of different knyaz social classifications?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3716 wd:Q203563 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Henry Steele Commager} has {Danish educational institution number} as {University of Chicago} ?",
    "uid": 31593,
    "subgraph": "statement_property",
    "template_index": 5868,
    "question": "When did Henry Steele Commager have University of Chicago as Danish educational institution number?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q3785004 p:P8708 ?s . ?s ps:P8708 wd:Q131252 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Henry Steele Commager had the University of Chicago as Danish educational institution number when?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q3785004 p:P69 ?s . ?s ps:P69 wd:Q131252 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {island nation} for {participant} of {Iraq War}",
    "uid": 31859,
    "subgraph": "simple question right",
    "template_index": 1764,
    "question": "Who is the {island nation} for {participant} of {Iraq War}",
    "sparql_wikidata": " select distinct ?obj where { wd:Q545449 wdt:P710 ?obj . ?obj wdt:P31 wd:Q112099 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which island nation participated in the Iraq Conflict?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q218678 wdt:P710 ?obj . ?obj wdt:P31 wd:Q112099 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {student} of {composer} of {venereologist} ?",
    "uid": 30532,
    "subgraph": "left-subgraph",
    "template_index": 376,
    "question": "Who was the teacher of the musical score of venereologist?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q13167731 wdt:P86 ?X . ?X wdt:P802 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who was the educator of the melodic score of venereologist?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q3503209 wdt:P86 ?X . ?X wdt:P802 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {crystal habit} of {samarskite-(Y)}",
    "uid": 30922,
    "subgraph": "center",
    "template_index": 108,
    "question": "Which is the crystal habit for samarskite-(Y)?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q417648 wdt:P565 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q182264 wdt:P565 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {educated at} of {Peggy Whitson} and {author}",
    "uid": 32017,
    "subgraph": [],
    "template_index": 186,
    "question": "When did educated at of Peggy Whitson and who is her author?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q235523 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P50 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "When was Peggy Whitson educated and who is her author?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q235523 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {head of government} of {work location} of {Philippe Omnès} ?",
    "uid": 30680,
    "subgraph": "right-subgraph",
    "template_index": 3528,
    "question": "Philippe Omnès is the Prime Minister of what place?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q44413 wdt:P937 ?X . ?X wdt:P6 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Philippe Omnès is the Prime Serve of what place?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q160422 wdt:P937 ?X . ?X wdt:P6 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {commemorative plaque image} for {Korea} has {country} as {Later Three Kingdoms} ?",
    "uid": 31518,
    "subgraph": "statement_property",
    "template_index": 1446,
    "question": "During the Three Kingdoms period, what was commemorative plaque image of Korea?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q18097 p:P17 ?s . ?s ps:P17 wd:Q698268 . ?s pq:P1801 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "During the Three Kingdoms period, what was Korea commemorative plaque image?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q18097 p:P17 ?s . ?s ps:P17 wd:Q698268 . ?s pq:P582 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {town in Croatia} that contains the word {šibenik} in their name",
    "uid": 23455,
    "subgraph": "string matching simple contains word",
    "template_index": 1143,
    "question": "Tell me town in Croatia whose name has the word šibenik in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15105893 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'šibenik')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q15105893>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'šibenik')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know town in Croatia whose title has the word šibenik in it.",
    "answers": [
      "Šibenik"
    ]
  },
  {
    "NNQT_question": "What is {spouse} of {Abdullah II of Jordan} and {start time}",
    "uid": 31994,
    "subgraph": [],
    "template_index": 302,
    "question": "Tell me about spouse of Abdullah II of Jordan and start time?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q57464 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Tell me and start time about Abdullah II of Jordan ' spouse?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q231417 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  }
]