[
  {
    "NNQT_question": "What is {religious affiliation} of {ethnicity} of {Sirhan Sirhan} ?",
    "uid": 14465,
    "subgraph": "right-subgraph",
    "template_index": 2059,
    "question": "What is {religious affiliation} of {ethnicity} {Sirhan Sirhan} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q297112 wdt:P172 ?X . ?X wdt:P140 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q297112> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P172>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P140> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is {devout connection} of {ethnicity} {Sirhan Sirhan} ?",
    "answers": [
      "Islam",
      "Christianity"
    ]
  },
  {
    "NNQT_question": "What is {winner} of {award received} of {Set} ?",
    "uid": 30699,
    "subgraph": "right-subgraph",
    "template_index": 352,
    "question": "What is won by the honorary titles of Set?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q607738 wdt:P166 ?X . ?X wdt:P1346 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is won by the privileged titles of Set?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q17271 wdt:P166 ?X . ?X wdt:P1346 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {significant event} of {owned by} of {Odebrecht} ?",
    "uid": 30603,
    "subgraph": "right-subgraph",
    "template_index": 694,
    "question": "what is the key incident in the provenance of Odebrecht?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q94849 wdt:P127 ?X . ?X wdt:P793 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "what is the key occurrence within the provenance of Odebrecht?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q169339 wdt:P127 ?X . ?X wdt:P793 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Roman praenomen} of {Foxconn}",
    "uid": 30895,
    "subgraph": "center",
    "template_index": 1009,
    "question": "Who is the Roman praenomen of Hon Hai Precision Industry?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q463094 wdt:P2358 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q463094 wdt:P1830 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {fictional universe} for {first appearance} of {The Matrix}",
    "uid": 31844,
    "subgraph": "simple question right",
    "template_index": 146,
    "question": "Which is the fictional universe in which The Matrix appeared for the first time?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q83495 wdt:P4584 ?obj . ?obj wdt:P31 wd:Q559618 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What universe does The Matrix appear for the first time?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q83495 wdt:P1434 ?obj . ?obj wdt:P31 wd:Q559618 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {country for sport} and the {sport} of {Andre Agassi} ?",
    "uid": 31974,
    "subgraph": "two intentions right subgraph",
    "template_index": 456,
    "question": "Which is the {country for sport} and the {sport} of {Andre Agassi} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q7407 wdt:P1532 ?ans_1 . wd:Q7407 wdt:P641 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What country is Andre Agassi from, and what sport does he play?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q5812 wdt:P1532 ?ans_1 . wd:Q5812 wdt:P641 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {platform} are for {Winnie the Pooh} ?",
    "uid": 31693,
    "subgraph": "statement_property",
    "template_index": 305,
    "question": "How many platforms does Winnie the Pooh have?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q17984894 wdt:P400 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "How many consoles can Winnie the Pooh be played on?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q270503 wdt:P400 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {has melody} of {Vijayapura}",
    "uid": 30777,
    "subgraph": "center",
    "template_index": 1835,
    "question": "What is melody of Vijayapura ?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1625 wd:Q3636023}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1625 wd:Q1324254}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {patronym or matronym for this name} {disease} that starts with {'y'}",
    "uid": 31171,
    "subgraph": "string matching simple contains word",
    "template_index": 3239,
    "question": "Name a thing with disease as patronym or matronym that starts with the letter Y",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P2976 wd:Q12136 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is the element with disease as patronym or matronym that starts with the letter Y?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12136 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {represents} of {sibling} of {Douglas Adams} ?",
    "uid": 30594,
    "subgraph": "left-subgraph",
    "template_index": 8,
    "question": "What represents the organization of the siblings of Douglas Adams?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q42 wdt:P3373 ?X . ?X wdt:P1268 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "The organization of the siblings of Douglas Adams is represented by what?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q6687246 wdt:P3373 ?X . ?X wdt:P1268 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {director} of {Dota 2}",
    "uid": 31042,
    "subgraph": "center",
    "template_index": 800,
    "question": "who is the director of Dota 2?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q771541 wdt:P57 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q771541 wdt:P4467 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {notable work} of {Jacques Brel} that is {publication date} is {1963-0-0} ?",
    "uid": 5484,
    "subgraph": "statement_property",
    "template_index": 1929,
    "question": "What work did Jacques Brel publish in 1963?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1666 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P577 ?x filter(contains(YEAR(?x),'1963')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1666> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P800> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P577> <1963-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was published of Jacques Brel publish in 1963?",
    "answers": [
      "La Fanette"
    ]
  },
  {
    "NNQT_question": "Give me {natural language} that contains the word {thai} in their name",
    "uid": 23262,
    "subgraph": "string matching simple contains word",
    "template_index": 4,
    "question": "Tell me natural language whose name has the word thai in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33742 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'thai')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q33742>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'thai')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me herbal language whose identify has the phrase thai in it.",
    "answers": [
      "Thai"
    ]
  },
  {
    "NNQT_question": "What is the {for work} for {Seal} has {award received} as {Grammy Award for Best Pop Vocal Album} ?",
    "uid": 31642,
    "subgraph": "statement_property",
    "template_index": 3897,
    "question": "For what work did Seal receive a Grammy Award for Best Pop Vocal Album?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q218091 p:P166 ?s . ?s ps:P166 wd:Q1027891 . ?s pq:P1686 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Seal was awarded with a Grammy's Best Pop Vocal Album for what project?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q218091 p:P1411 ?s . ?s ps:P1411 wd:Q1027891 . ?s pq:P1686 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {material used} {treaty} that starts with {'t'}",
    "uid": 31207,
    "subgraph": "string matching simple contains word",
    "template_index": 2296,
    "question": "What are the object made of treaty which start with the letter t",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P186 wd:Q131569 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the element made of arrangement which begin with the letter t",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131569 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {thoracic disease} that contains the word {syndrome} in their name",
    "uid": 23682,
    "subgraph": "string matching simple contains word",
    "template_index": 869,
    "question": "tell me about thoracic disease that contains the word syndrome in their name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18553676 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'syndrome')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q18553676>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'syndrome')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "let me know around thoracic malady that contains the word disorder in their name",
    "answers": [
      "Dressler's syndrome",
      "short QT syndrome"
    ]
  },
  {
    "NNQT_question": "Give me {quotation or excerpt} {mythical character} that contains the word {zau} in their name",
    "uid": 31203,
    "subgraph": "string matching simple contains word",
    "template_index": 3060,
    "question": "What element with mythical character quotation that contains the word zau in their name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P7081 wd:Q4271324 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zau')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What thing with legendary character quotation that contains the word zau in their name",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4271324 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zau')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {has sister} of {actress} of {Red Line} ?",
    "uid": 15474,
    "subgraph": "left-subgraph",
    "template_index": 188,
    "question": "Who plays the sister in Red Line?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7304498 wdt:P161 ?X . ?X wdt:P3373 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7304498> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P161>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3373> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who plays the sister in Ruddy Line?",
    "answers": [
      "Virginia Madsen",
      "Martin Sheen"
    ]
  },
  {
    "NNQT_question": "What is {may prevent} of {anisindione}",
    "uid": 31006,
    "subgraph": "center",
    "template_index": 3182,
    "question": "What may be prevented with anisindione?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q3617574 wdt:P4954 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q18216 wdt:P4954 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {mayor} of {active in} of {Johann Gottlieb Fichte} ?",
    "uid": 15381,
    "subgraph": "right-subgraph",
    "template_index": 2631,
    "question": "Who is the active mayor of Johann Gottlieb Fichte?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q102585 wdt:P937 ?X . ?X wdt:P6 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q102585> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P937>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P6> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who is the dynamic leader of Johann Gottlieb Fichte?",
    "answers": [
      "Michael Müller",
      "Corine Mauch",
      "Thomas Nitzsche"
    ]
  },
  {
    "NNQT_question": "What is {work location} of {François Villon} that is {end time} is {1953-01-01} ?",
    "uid": 31357,
    "subgraph": "statement_property",
    "template_index": 2923,
    "question": "Where François Villon stoped working on 1953?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q849 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1953')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What did François Villon stop working on in 1953?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q2177580 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1953')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {residence} of {Natalia Molchanova} that is {located in the administrative territorial entity} is {Bashkir Autonomous Soviet Socialist Republic} ?",
    "uid": 31451,
    "subgraph": "statement_property",
    "template_index": 4017,
    "question": "What was Natalia Molchanova residence in the Bashkir Autonomous Soviet Socialist Republic?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q59920 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P131 wd:Q809806 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Was the Bashkir Autonomous Soviet Socialist Republic the residence of Natalia Molchanova?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q59920 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q809806 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {GND ID} of {Mount Mitchell}",
    "uid": 31044,
    "subgraph": "center",
    "template_index": 2211,
    "question": "What is the GND ID of Mount Mitchell?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q615337 wdt:P227 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q615337 wdt:P3514 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {population} of {Chongqing} that is {determination method} is {estimation process} ?",
    "uid": 31283,
    "subgraph": "statement_property",
    "template_index": 815,
    "question": "What is the current population of Chongqing?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q11725 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q791801 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "How many people do currently live in Chongqing?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q131694 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q791801 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {place of death} of {Jo Gartner}, that has {contains administrative territorial entity} is {Neubau} ?",
    "uid": 30451,
    "subgraph": "right-subgraph",
    "template_index": 2686,
    "question": "Which is the death place of Jo Gartner that contains the district of Neubau?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q78581 wdt:P20 ?answer . ?answer wdt:P150 wd:Q664835}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which is the passing put of Jo Gartner that contains the district of Neubau?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q7304 wdt:P20 ?answer . ?answer wdt:P150 wd:Q664835}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {separated from} of {country of origin} of {Limp Bizkit} ?",
    "uid": 30759,
    "subgraph": "right-subgraph",
    "template_index": 65,
    "question": "What is separated from Limp Bizkit's place of origin?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q240767 wdt:P495 ?X . ?X wdt:P807 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is separated from Limp Bizkit's put of origin?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q240767 wdt:P495 ?X . ?X wdt:P530 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Vidhan Sabha} for {executive body} of {Andhra Pradesh}",
    "uid": 31816,
    "subgraph": "simple question right",
    "template_index": 226,
    "question": "Is Vidhan Sabha executive body of Andhra Pradesh?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q1159 wdt:P208 ?obj . ?obj wdt:P31 wd:Q3091020 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Is Vidhan Sabha official body of Andhra Pradesh?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q1164 wdt:P208 ?obj . ?obj wdt:P31 wd:Q3091020 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {diplomatic relation} of {originates} of {Death Note} ?",
    "uid": 15447,
    "subgraph": "right-subgraph",
    "template_index": 576,
    "question": "What is the origin of Death Note's diplomatic relation?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1834 wdt:P495 ?X . ?X wdt:P530 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1834> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P495>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P530> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What region did Death Note's diplomatic relation first take place?",
    "answers": [
      "Canada",
      "Hungary",
      "Spain",
      "United States of America",
      "Finland",
      "Sweden",
      "Denmark",
      "Lithuania",
      "Italy",
      "Austria",
      "Greece",
      "Turkey",
      "Portugal",
      "Netherlands",
      "Uruguay",
      "Egypt",
      "Mexico",
      "Ethiopia",
      "France",
      "United Kingdom",
      "People's Republic of China",
      "Brazil",
      "Russia",
      "Germany",
      "Ukraine",
      "Albania",
      "Azerbaijan",
      "Georgia",
      "Malta",
      "Monaco",
      "Montenegro",
      "Barbados",
      "Indonesia",
      "South Africa",
      "Algeria",
      "Singapore",
      "Armenia",
      "Serbia",
      "Australia",
      "Peru",
      "North Korea",
      "Cambodia",
      "European Union",
      "East Timor",
      "New Zealand",
      "India",
      "Solomon Islands",
      "Mongolia",
      "Venezuela",
      "Paraguay"
    ]
  },
  {
    "NNQT_question": "What is {nephew} of {sister or brother} of {Sanada Nobumasa} ?",
    "uid": 16168,
    "subgraph": "left-subgraph",
    "template_index": 174,
    "question": "WHO IS SISTER OR BROTHER OF SANADA NOBUMASA'S NEPHEW?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q11583366 wdt:P3373 ?X . ?X wdt:P1038 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q11583366> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3373>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1038> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "WHO IS SISTER OR BROTHER OF SANADA NOBUMASA'S NEPHEW?",
    "answers": [
      "Tokugawa Ieyasu"
    ]
  },
  {
    "NNQT_question": "What is the {television character} for {sidekick of} of {Superboy-Prime}",
    "uid": 30317,
    "subgraph": "simple question left",
    "template_index": 1815,
    "question": "Which character is Superboy-Prime's sidekick?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2546 wd:Q2723204 . ?sbj wdt:P31 wd:Q15773317 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who is Superboy-Prime's sidekick?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2546 wd:Q79015 . ?sbj wdt:P31 wd:Q15773317 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {followed by} for {San Marino} has {award received} as {Nobel Prize in Literature} ?",
    "uid": 31481,
    "subgraph": "statement_property",
    "template_index": 1286,
    "question": "Who received the Nobel Prize in Literature after San Marino?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q238 p:P166 ?s . ?s ps:P166 wd:Q37922 . ?s pq:P156 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Give me the person name who received nobel literature prize after San Marino?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q8998 p:P166 ?s . ?s ps:P166 wd:Q37922 . ?s pq:P156 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Commons gallery} of {Saskatchewan River}",
    "uid": 31040,
    "subgraph": "center",
    "template_index": 1528,
    "question": "Tell me the Commons gallery of the Saskatchewan River?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q3047 wdt:P935 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q3047 wdt:P821 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {specific absorption rate} {written work} that contains the word {war} in their name",
    "uid": 31206,
    "subgraph": "string matching simple contains word",
    "template_index": 3836,
    "question": "Tell me object having a specific absorption rate of written work whose name has the word war in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P7080 wd:Q47461344 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'war')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which thing with a specific absorption rate of written body of work contains the term \"war\" in its name?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47461344 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'war')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {location} of {Tsushima Island}, that has {tributary} is {Iwaki River} ?",
    "uid": 30475,
    "subgraph": "right-subgraph",
    "template_index": 72,
    "question": "What is located in Tsushima Island, that is a tributary of Iwaki River",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q52051 wdt:P276 ?answer . ?answer wdt:P974 wd:Q5359180}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is located in Tsushima Island, that is a tributary of Iwaki River",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q52051 wdt:P206 ?answer . ?answer wdt:P974 wd:Q5359180}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]