[
  {
    "NNQT_question": "Give me {intergovernmental organization} that starts with {'s'}",
    "uid": 24702,
    "subgraph": "string matching simple contains word",
    "template_index": 3478,
    "question": "Tell me {intergovernmental organization}  whose name  starts with s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q245065 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q245065>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me whose name begins with s { intergovernmental organization}.",
    "answers": [
      "Southern African Customs Union",
      "Southeast Europe Transport Community",
      "South Pacific Regional Trade and Economic Cooperation Agreement",
      "Senegal River Basin Development Authority",
      "Sahara and Sahel Observatory",
      "Southeast Asian Fisheries Development Center",
      "Sahel G5",
      "Southern States Energy Board",
      "Southern Baltic Sea Parliamentary Forum",
      "Salzburg Forum",
      "Southeast Asian Ministers of Education Organization",
      "South Asian Association for Regional Cooperation",
      "Southeast Asia Treaty Organization"
    ]
  },
  {
    "NNQT_question": "What is {award received} of {Mel Brooks} that is {point in time} is {2003-0-0} ?",
    "uid": 7602,
    "subgraph": "statement_property",
    "template_index": 4047,
    "question": "What award did Mel Brooks receive in 2003?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q104266 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2003')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q104266> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2003-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 2003, what award was presented to Mel Brooks?",
    "answers": [
      "Laurel Award for Screenwriting Achievement"
    ]
  },
  {
    "NNQT_question": "Give me {vehicle family} that starts with {'v'}",
    "uid": 24408,
    "subgraph": "string matching simple contains word",
    "template_index": 3542,
    "question": "What family of vehicles starts with the letter \"v\"?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22999537 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q22999537>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the group of vehicles that start with the letter \"v\"",
    "answers": [
      "Valentine"
    ]
  },
  {
    "NNQT_question": "Give me {heavy metal band} that {honorific prefix} {Eddie the Head} and which that starts with {'i'}",
    "uid": 31912,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3158,
    "question": "What is the heavy metal band whose honorific prefix is Ediie the head that start with letter I ?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56816954 . ?sbj wdt:P511 wd:Q259261 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'i')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "What is the heavy metal band whose honorific prefix is Ediie the head that begin with letter I ?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56816954 . ?sbj wdt:P822 wd:Q259261 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'i')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {KGB} has {chairperson} as {Alexander Shelepin} ?",
    "uid": 31662,
    "subgraph": "statement_property",
    "template_index": 169,
    "question": "When was Alexander Shelepin the chairperson for the KGB?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q80919 p:P488 ?s . ?s ps:P488 wd:Q533890 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When was Alexander Shelepin the KGB Chairperson?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q80919 p:P488 ?s . ?s ps:P488 wd:Q533890 . ?s pq:P582 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {author} of {contributed to creative work} of {Mitchell Watt} ?",
    "uid": 30621,
    "subgraph": "left-subgraph",
    "template_index": 13,
    "question": "Who are the writers and collaborators to Mitchell Watt?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1747 wdt:P3919 ?X . ?X wdt:P50 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who are the scholars and collaborators to Mitchell Watt?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q24898980 wdt:P3919 ?X . ?X wdt:P50 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {sibling} of {cast member} of {The Visit} ?",
    "uid": 30694,
    "subgraph": "left-subgraph",
    "template_index": 188,
    "question": "Who plays the sister in The Visit?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q76450383 wdt:P161 ?X . ?X wdt:P3373 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who plays the sister in The Visit?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q7304498 wdt:P161 ?X . ?X wdt:P3373 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {dog type} that contains the word {toy} in their name",
    "uid": 23942,
    "subgraph": "string matching simple contains word",
    "template_index": 3196,
    "question": "What's the name of a type of dog with the word \"toy\" in its name?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q38672 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'toy')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q38672>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'toy')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the name of a dog type in its name with the word \"toy?\"",
    "answers": [
      "Belgian toy dog",
      "Toy Bulldog",
      "Toy Trawler Spaniel",
      "toy dog"
    ]
  },
  {
    "NNQT_question": "What is the {start time} for {Shivaji Bhonsle I} has {chairperson} as {Sakavaarbai} ?",
    "uid": 31574,
    "subgraph": "statement_property",
    "template_index": 1782,
    "question": "When did Shivaji become chairperson of Sakavaarbai?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q239505 p:P488 ?s . ?s ps:P488 wd:Q7402864 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Shivaji became Sakavaarbai chairperson in which year?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q239505 p:P26 ?s . ?s ps:P26 wd:Q7402864 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Tomáš Garrigue Masaryk} has {nominated for} as {Nobel Peace Prize} ?",
    "uid": 31639,
    "subgraph": "statement_property",
    "template_index": 2999,
    "question": "From when was Tomas Garrigue masaryk nominated for Nobel peace prize award?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q78492 p:P1411 ?s . ?s ps:P1411 wd:Q35637 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Tomas Garrique Masaryk nomination for the Nobel peace prize occured from what year?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q78492 p:P1411 ?s . ?s ps:P1411 wd:Q35637 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {separation process} that {discoverer or inventor} {Zosimos of Panopolis} and which that starts with {'d'}",
    "uid": 25618,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1828,
    "question": "What what is separation process discoverer or inventor Zosimos of Panopolis  and which that starts with d",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q898987 . ?sbj wdt:P61 wd:Q226868 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q898987>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P61> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q226868>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "What what is division prepare pioneer or creator Zosimos of Panopolis and which that begins with d",
    "answers": [
      "distillation"
    ]
  },
  {
    "NNQT_question": "What is {discoverer or inventor} of {airline hub} of {Amundsen Sea} ?",
    "uid": 30657,
    "subgraph": "right-subgraph",
    "template_index": 392,
    "question": "Who developed the airline hub of the Amundsen Sea?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q72154 wdt:P113 ?X . ?X wdt:P61 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who created the airline hub of the Amundsen Sea?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q72154 wdt:P30 ?X . ?X wdt:P61 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {time zone named for a UTC offset} with the {MAX(timezone offset)} whose {said to be the same as} is {Macau Standard Time}  ?",
    "uid": 3137,
    "subgraph": "rank",
    "template_index": 336,
    "question": "What time zone is the same as Macau?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q17272482 . ?ent wdt:P2907 ?obj . ?ent wdt:P460 wd:Q996734 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q17272482>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2907>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P460> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q996734> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Name the time zone that matches Macau.",
    "answers": [
      "UTC+08:00"
    ]
  },
  {
    "NNQT_question": "Give me {sex or gender} {theorem} that contains the word {theorem} in their name",
    "uid": 31201,
    "subgraph": "string matching simple contains word",
    "template_index": 1708,
    "question": "Tell me element with gender of theorem whose name has the word theorem in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P21 wd:Q65943 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'theorem')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which is the thing with gender of theorem whose name has the word theorem in it?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q65943 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'theorem')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {film crew member} and the {sidekick of} of {Game of Thrones} ?",
    "uid": 31970,
    "subgraph": "two intentions right subgraph",
    "template_index": 277,
    "question": "Who are the film crew members and what is the sidekick of Game of Thrones?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q23572 wdt:P3092 ?ans_1 . wd:Q23572 wdt:P2546 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Name the crew members and the sidekick of Game of Thrones.",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q23572 wdt:P3092 ?ans_1 . wd:Q23572 wdt:P161 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {galactic longitude} of {Martin V} that is {replaced by} is {Eugene IV} ?",
    "uid": 31321,
    "subgraph": "statement_property",
    "template_index": 1905,
    "question": "What galactic longitude did Martin V hold that was eventually replaced by Eugene IV?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q169612 p:P6260 ?s . ?s ps:P6260 ?obj . ?s pq:P1366 wd:Q167561 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What galactic longitude did Eugene IV take over from Martin V?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q169612 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q167561 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {megacity} for {official language} of {Bhojpuri}",
    "uid": 30325,
    "subgraph": "simple question left",
    "template_index": 3010,
    "question": "In which megacity is Bhojpuri the official language?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P37 wd:Q33268 . ?sbj wdt:P31 wd:Q174844 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Bhojpuri is the official language of which megacity?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P37 wd:Q1617 . ?sbj wdt:P31 wd:Q174844 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {antiparticle of} of {positron}, that has {interaction} is {gravity} ?",
    "uid": 13140,
    "subgraph": "right-subgraph",
    "template_index": 31,
    "question": "What is the opposite of a positron that is pulled by gravity?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3229 wdt:P2152 ?answer . ?answer wdt:P517 wd:Q11412}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q3229> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2152>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P517> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q11412> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the inverse of a positron that's pulled by gravity?",
    "answers": [
      "electron"
    ]
  },
  {
    "NNQT_question": "What is the {mother} for {Philip III of France} has {sibling} as {Louis, Count of Évreux} ?",
    "uid": 31657,
    "subgraph": "statement_property",
    "template_index": 2970,
    "question": "Who was Louis, Count of Evreux, and Philip III of France's mother?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q172203 p:P3373 ?s . ?s ps:P3373 wd:Q352940 . ?s pq:P25 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Who's son were Louis, Count of Evreux, and Philip III of France?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q172203 p:P40 ?s . ?s ps:P40 wd:Q352940 . ?s pq:P25 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {educated at} and {academic degree} of {Jeff Bezos} has {educated at} as {Princeton University}",
    "uid": 32089,
    "subgraph": [],
    "template_index": 563,
    "question": "Mention the qualifying degree and the place of education in which Jeff Bezos graduated from the Princeton University",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q312556 p:P69 ?s . ?s ps:P69 wd:Q21578 . ?s pq:P69 ?value1 . ?s pq:P512 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What course did Jeff Bezos take while attending Princeton University and in what place?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q312556 p:P69 ?s . ?s ps:P69 wd:Q21578 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {musical duo} for {contributed to published work} of {Sasha Grey}",
    "uid": 20880,
    "subgraph": "simple question right",
    "template_index": 1226,
    "question": "Mention the musical related work highlighting the work of Sasha Grey.",
    "sparql_wikidata": " select distinct ?obj where { wd:Q2709 wdt:P3919 ?obj . ?obj wdt:P31 wd:Q9212979 } ",
    "sparql_dbpedia18": "select distinct ?obj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2709> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3919> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj . ?obj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q9212979> } ",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Say the melodic related work highlighting the work of Sasha Grey.",
    "answers": [
      "Death in Vegas"
    ]
  },
  {
    "NNQT_question": "Give me {art genre} that {studied by} {cliodynamics} and which contains the word {ballet} in their name",
    "uid": 31919,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1972,
    "question": "Name an art genre that contains the word \"ballet\" in its name and studied by cliodynamics",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1792379 . ?sbj wdt:P2579 wd:Q766002 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ballet')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Name an artwork style that incorporates the phrase \"ballet\" in its title and well known to cliodynamics",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1792379 . ?sbj wdt:P2579 wd:Q4076591 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ballet')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {surface tension} are for {ethyl acetate} ?",
    "uid": 1338,
    "subgraph": "statement_property",
    "template_index": 338,
    "question": "How many surface tensions are there for ethyl acetate?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q407153 wdt:P3013 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q407153> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3013> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "ethyl acetate includes how many surface tensions?",
    "answers": [
      "5"
    ]
  },
  {
    "NNQT_question": "What is the {point in time} for {Betty White} has {award received} as {Daytime Emmy Award for Outstanding Music Direction and Composition} ?",
    "uid": 31558,
    "subgraph": "statement_property",
    "template_index": 710,
    "question": "When did Betty White win the Daytime Emmy Award for Outstanding Music Direction and Composition?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q373895 p:P166 ?s . ?s ps:P166 wd:Q46935425 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Betty White won the Daytime Emmy Award for Outstanding Music Direction and Composition, but when was it?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q373895 p:P166 ?s . ?s ps:P166 wd:Q5243447 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {relative to} of {facet of} of {structure of the World} ?",
    "uid": 30758,
    "subgraph": "right-subgraph",
    "template_index": 242,
    "question": "What is relative to Earth's structure?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1664027 wdt:P1269 ?X . ?X wdt:P2210 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is relative to the Earth's structure?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1664027 wdt:P1269 ?X . ?X wdt:P443 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {density} are for {water} ?",
    "uid": 1018,
    "subgraph": "statement_property",
    "template_index": 18,
    "question": "What is the density of water?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q283 wdt:P2054 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q283> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2054> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Water has a density of what?",
    "answers": [
      "26"
    ]
  },
  {
    "NNQT_question": "What is {Chrome Webstore extension ID} of {Albert Ellis}",
    "uid": 30959,
    "subgraph": "center",
    "template_index": 351,
    "question": "Which is the Chrome Webstore extension ID for Albert Ellis?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q313931 wdt:P8559 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q313931 wdt:P648 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {ancient civilization} that starts with {'u'}",
    "uid": 24572,
    "subgraph": "string matching simple contains word",
    "template_index": 2205,
    "question": "What are the ancient civilization which start with the letter s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28171280 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q28171280>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the antiquated civilization which begin with the letter s",
    "answers": [
      "Urartu"
    ]
  },
  {
    "NNQT_question": "What is {producer} of {Symphony No. 9}",
    "uid": 31035,
    "subgraph": "center",
    "template_index": 3662,
    "question": "Which is the producer of Symphony No. 9?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q11985 wdt:P162 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q11985 wdt:P1827 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {physical phenomenon} that contains the word {surface} in their name",
    "uid": 23234,
    "subgraph": "string matching simple contains word",
    "template_index": 524,
    "question": "Tell me physical phenomenon whose name has the word surface in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1293220 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'surface')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1293220>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'surface')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know physical marvel whose title has the word surface in it.",
    "answers": [
      "surface tension"
    ]
  },
  {
    "NNQT_question": "How many {participating team} are to/by {Esporte Clube Pelotas} ?",
    "uid": 31741,
    "subgraph": "statement_property",
    "template_index": 1357,
    "question": "How many team participants are there in the {Esporte Clube Pelotas} ?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1923 wd:Q2506413 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "The Esporte Clube Pelotas has what number of team participants?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1923 wd:Q1422 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]