[
  {
    "NNQT_question": "What is the {language of work or name} for {Apepi} has {named after} as {3} ?",
    "uid": 31487,
    "subgraph": "statement_property",
    "template_index": 629,
    "question": "what is Apepi named after?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q322169 p:P138 ?s . ?s ps:P138 wd:Q201 . ?s pq:P407 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Where does Apepi get its name from?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q127 p:P138 ?s . ?s ps:P138 wd:Q201 . ?s pq:P407 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {record held} and the {named after} of {Richard II of England} ?",
    "uid": 31942,
    "subgraph": "two intentions right subgraph",
    "template_index": 431,
    "question": "After what is Richard II of England named and what is the current record?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q81000 wdt:P1000 ?ans_1 . wd:Q81000 wdt:P138 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "why Richard II of England had this name and the current record is?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q40244 wdt:P1000 ?ans_1 . wd:Q40244 wdt:P138 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {educated at} and {academic major} of {Paolo Gentiloni} has {academic degree} as {laurea}",
    "uid": 32084,
    "subgraph": [],
    "template_index": 1519,
    "question": "What is Paolo Gentiloni academic degree and academic major at laurea?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q1071031 p:P512 ?s . ?s ps:P512 wd:Q1054679 . ?s pq:P69 ?value1 . ?s pq:P812 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is Paolo Gentiloni scholarly degree and scholastic major at laurea)?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q1071031 p:P512 ?s . ?s ps:P512 wd:Q4000966 . ?s pq:P69 ?value1 . ?s pq:P812 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {image} of {John Major} and {end cause}",
    "uid": 32000,
    "subgraph": [],
    "template_index": 193,
    "question": "what was the image of john major and when did it end?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q9559 p:P18 ?s . ?s ps:P18 ?obj . ?s pq:P1534 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "what was the image by john major and when did it conclusion?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q9559 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1534 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {professorship} of {José Martí}, that has {said to be the same as} is {Dichter} ?",
    "uid": 30482,
    "subgraph": "right-subgraph",
    "template_index": 526,
    "question": "What is the professorship of Jose Marti who is also known as Dichter?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q103285 wdt:P803 ?answer . ?answer wdt:P460 wd:Q1293108}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What did Jose \"Dichter\" Marti do as professorship?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q103285 wdt:P106 ?answer . ?answer wdt:P460 wd:Q1293108}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {basionym} of {Artocarpus altilis}",
    "uid": 30931,
    "subgraph": "center",
    "template_index": 3186,
    "question": "Artocarpus altilis has a basionym of what?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q14677 wdt:P566 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q311524 wdt:P566 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {written work} that contains the word {war} in their name",
    "uid": 23182,
    "subgraph": "string matching simple contains word",
    "template_index": 3836,
    "question": "Tell me written work whose name has the word war in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47461344 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'war')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q47461344>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'war')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which written body of work contains the term \"war\" in its name?",
    "answers": [
      "The War of the Worlds",
      "The Art of War",
      "Warm Bodies",
      "The Looking Glass War",
      "The War of the Saints",
      "Swaraj",
      "World War Z",
      "An Ice-Cream War",
      "Tereza Batista: Home from the Wars",
      "Storm Warning",
      "The Dwarf",
      "Way of the Peaceful Warrior",
      "TekWar (Novels)",
      "War Horse",
      "The Wayward Bus",
      "Beware of Pity",
      "On War",
      "The Brothers' War",
      "Lord Edgware Dies",
      "Our Worlds at War",
      "The Cowards",
      "Zen at War",
      "Warriors of God",
      "Spanish War Diary",
      "The Golden Turkey Awards"
    ]
  },
  {
    "NNQT_question": "What is the {fictional universe} for {fictional universe described in} of {Manado}",
    "uid": 30228,
    "subgraph": "simple question left",
    "template_index": 1643,
    "question": "Mention the fictional universe described in Manado.",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1445 wd:Q15847 . ?sbj wdt:P31 wd:Q559618 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Say the anecdotal universe depicted within Manado.",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1445 wd:Q83495 . ?sbj wdt:P31 wd:Q559618 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {diplomatic relation} of {nationality} of {Usher} ?",
    "uid": 14323,
    "subgraph": "right-subgraph",
    "template_index": 2622,
    "question": "When is {diplomatic relation} with {nationality} of {Usher} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q165911 wdt:P27 ?X . ?X wdt:P530 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q165911> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P27>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P530> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When is {diplomatic relation} with {nationality} of {Usher} ?",
    "answers": [
      "Canada",
      "Japan",
      "Norway",
      "Ireland",
      "Hungary",
      "Belgium",
      "Luxembourg",
      "Finland",
      "Sweden",
      "Denmark",
      "Poland",
      "Lithuania",
      "Italy",
      "Switzerland",
      "Greece",
      "Turkey",
      "Portugal",
      "Netherlands",
      "Uruguay",
      "Mexico",
      "Ethiopia",
      "Ghana",
      "France",
      "United Kingdom",
      "People's Republic of China",
      "Brazil",
      "Russia",
      "Germany",
      "Belarus",
      "Iceland",
      "Estonia",
      "Latvia",
      "Ukraine",
      "Czech Republic",
      "Slovakia",
      "Slovenia",
      "Moldova",
      "Romania",
      "North Macedonia",
      "Albania",
      "Croatia",
      "Bosnia and Herzegovina",
      "Azerbaijan",
      "Andorra",
      "Cyprus",
      "Georgia",
      "Kazakhstan",
      "Malta",
      "Monaco",
      "Montenegro"
    ]
  },
  {
    "NNQT_question": "What is {route map} of {Angela Merkel}",
    "uid": 30883,
    "subgraph": "center",
    "template_index": 403,
    "question": "What is Angela Merkel's route map?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q567 wdt:P15 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q567 wdt:P5355 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {place of origin (Switzerland)} of {Bradford}",
    "uid": 30890,
    "subgraph": "center",
    "template_index": 3966,
    "question": "Which is the place of origin of Bradford?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q22905 wdt:P1321 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q22905 wdt:P613 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {list of characters} of {depends on software} of {Civilization VI: Rise and Fall} ?",
    "uid": 30661,
    "subgraph": "left-subgraph",
    "template_index": 9,
    "question": "Which is {list of characters} of {depends on software} {Civilization VI: Rise and Fall} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q24057203 wdt:P1547 ?X . ?X wdt:P1881 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which is {list of characters} of {depends on software} {Civilization VI: Rise and Drop} ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q24057203 wdt:P1547 ?X . ?X wdt:P674 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {population} of {Aysén Region} that is {point in time} is {1992-0-0} ?",
    "uid": 9413,
    "subgraph": "statement_property",
    "template_index": 5858,
    "question": "What was the population of Aysén Region from 1992-0-0?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q2181 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1992')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2181> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1992-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was the populace of the Aysen Region from the exact time 1992",
    "answers": [
      "80501"
    ]
  },
  {
    "NNQT_question": "What is {GONIAT place ID} of {Hertfordshire}",
    "uid": 31018,
    "subgraph": "center",
    "template_index": 411,
    "question": "What is GONIAT ID of Hertfordshire?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q3410 wdt:P5215 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q23105 wdt:P5215 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {family name} of {Mireille Mathieu}, that has {said to be the same as} is {Accoramboni} ?",
    "uid": 30412,
    "subgraph": "right-subgraph",
    "template_index": 1796,
    "question": "Who has surname as Mireille Mathieu and similar to Accoramboni?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q71452 wdt:P734 ?answer . ?answer wdt:P460 wd:Q339383}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who has surname as Mireille Mathieu and comparable to Accoramboni?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q71452 wdt:P734 ?answer . ?answer wdt:P460 wd:Q29905256}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {given name} of {Frederick I}, that has {said to be the same as} is {Friedrich Wilhelm} ?",
    "uid": 30453,
    "subgraph": "right-subgraph",
    "template_index": 2527,
    "question": "What is the middle name of Friedrich I whose nick name is Friedrich Wilhelm?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q79789 wdt:P735 ?answer . ?answer wdt:P460 wd:Q55203177}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the middle title of Friedrich I whose nick name is Friedrich Wilhelm?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q79789 wdt:P735 ?answer . ?answer wdt:P460 wd:Q3273004}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {present in work} of {Sophia Alekseyevna of Russia}",
    "uid": 30825,
    "subgraph": "center",
    "template_index": 669,
    "question": "What is Sophia Alekseyevna of Russia in right now?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q233987 wdt:P1441 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q937186 wdt:P1441 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Gamekult franchise ID} of {The Sims}",
    "uid": 30967,
    "subgraph": "center",
    "template_index": 105,
    "question": "What is Gamekult franchise ID for The Sims ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q4897444 wdt:P7912 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q4897444 wdt:P5360 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {unmarried partner} and the {spouse} of {Amritsar} ?",
    "uid": 31944,
    "subgraph": "two intentions right subgraph",
    "template_index": 179,
    "question": "Who is the partner and the spouse of Amritsar?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q48403 wdt:P451 ?ans_1 . wd:Q48403 wdt:P26 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Who is Amritsar married to ?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q202056 wdt:P451 ?ans_1 . wd:Q202056 wdt:P26 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {garment} of {characters} of {The Silent Stars Go By} ?",
    "uid": 16521,
    "subgraph": "left-subgraph",
    "template_index": 7,
    "question": "What type of clothing do the characters in The Silent Stars Go By wear?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7764234 wdt:P674 ?X . ?X wdt:P3828 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7764234> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P674>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3828> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which is the type of clothing that the characters in The Silent Stars Go By wear?",
    "answers": [
      "bow tie",
      "tweed",
      "suspenders",
      "fez"
    ]
  },
  {
    "NNQT_question": "Give me {skill} that starts with {'s'}",
    "uid": 24611,
    "subgraph": "string matching simple contains word",
    "template_index": 2614,
    "question": "What is a skill that starts with the letter s.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q205961 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q205961>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What could be a aptitude that begins with the letter s.",
    "answers": [
      "suction",
      "seamanship"
    ]
  },
  {
    "NNQT_question": "What is the {thunder god} for {epithet} of {Artemis}",
    "uid": 30336,
    "subgraph": "simple question left",
    "template_index": 3339,
    "question": "Who is the thunder god which epithet is Artemis?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P8822 wd:Q39503 . ?sbj wdt:P31 wd:Q842697 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who is the thunder god with Artemis as epithet?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P4675 wd:Q39503 . ?sbj wdt:P31 wd:Q842697 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {open days} of {musée d'Ennery} and {open period from}",
    "uid": 32032,
    "subgraph": [],
    "template_index": 431,
    "question": "When is the musée d'Ennery open?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q1579504 p:P3025 ?s . ?s ps:P3025 ?obj . ?s pq:P3027 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "When is the historical center d'Ennery open?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q6373 p:P3025 ?s . ?s ps:P3025 ?obj . ?s pq:P3027 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Karl Dönitz} has {commander of} as {German Navy} ?",
    "uid": 31650,
    "subgraph": "statement_property",
    "template_index": 4335,
    "question": "What { point in time } has { commander of } as { Kriegsmarine } for { Karl Dönitz }?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q76437 p:P598 ?s . ?s ps:P598 wd:Q151701 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What is Karl Donitz's point in time?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q76437 p:P598 ?s . ?s ps:P598 wd:Q151701 . ?s pq:P582 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {applies to part} for {Po} has {coordinate location} as {12.5469} ?",
    "uid": 6881,
    "subgraph": "statement_property",
    "template_index": 3326,
    "question": "Where does Po fit into the location 12.5469?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q643 p:P625 ?s . ?s ps:P625 ?x filter(contains(?x,'12.5469')) . ?s pq:P518 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q643> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P625> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <12.5469> .\n?statement <http://www.wikidata.org/entity/P518> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "At location 12.5469, where is Po exactly?",
    "answers": [
      "river mouth"
    ]
  },
  {
    "NNQT_question": "How many {exclave of} are to/by {Azerbaijan} ?",
    "uid": 2350,
    "subgraph": "statement_property",
    "template_index": 1694,
    "question": "How many numbers of exclave for the  {Azerbaijan} ?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P500 wd:Q227 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P500> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q227 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "How many exclaves does Azerbaijan have?",
    "answers": [
      "5"
    ]
  },
  {
    "NNQT_question": "What is {has fruit type} of {parent taxon} of {Mysmenidae} ?",
    "uid": 30606,
    "subgraph": "left-subgraph",
    "template_index": 30757,
    "question": "Which fruit type is the higher taxon of Mysmenidae?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q10654 wdt:P171 ?X . ?X wdt:P4000 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the fruit type of the higher taxon of Mysmenidae?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q15313826 wdt:P171 ?X . ?X wdt:P4000 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {publication date} for {iTunes} has {software version} as {12.7.5} ?",
    "uid": 8566,
    "subgraph": "statement_property",
    "template_index": 5011,
    "question": "what was the publication date for iTunes which has software version as 12.7.5?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q9589 p:P348 ?s . ?s ps:P348 ?x filter(contains(?x,'12.7.5')) . ?s pq:P577 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q9589> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P348> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <12.7.5> .\n?statement <http://www.wikidata.org/entity/P577> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When was iTunes version 12.7.5 published?",
    "answers": [
      "2018-05-29T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "Give me {Akola} that starts with {'x'}",
    "uid": 31152,
    "subgraph": "string matching simple contains word",
    "template_index": 129,
    "question": "What are the Akola which start with the letter X",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q213014 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'x')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the Akola which begin with the letter X",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q57362 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'x')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {IPA transcription} of {Queens}",
    "uid": 30781,
    "subgraph": "center",
    "template_index": 3807,
    "question": "What is the IPA transcription of Queens?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P898 wd:Q18424}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P263 wd:Q18424}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {HAZMAT Class 3 Flammable Liquids} with the {MAX(median lethal concentration (LC50))} ?",
    "uid": 31080,
    "subgraph": "rank",
    "template_index": 108,
    "question": "Which HAZMAT Class 3 flammable liquid has the highest median lethal concentration?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q5629000 . ?ent wdt:P2712 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "What HAZMAT Class 3 flammable liquid has the greatest median dangerous concentration?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q21009057 . ?ent wdt:P2712 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {facet of} of {instruction set architecture}, that has {creator} is {Christian Taylor} ?",
    "uid": 30405,
    "subgraph": "right-subgraph",
    "template_index": 7,
    "question": "What was in the aspect of the instruction set architecture whose painter was Christian Taylor?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q272683 wdt:P1269 ?answer . ?answer wdt:P170 wd:Q1751}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What used to be in the issue of the guidance set structure whose painter was once Christian Taylor?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q272683 wdt:P1269 ?answer . ?answer wdt:P170 wd:Q2632606}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {on geographical feature} of {Greater Antilles}, that has {continent} is {North America} ?",
    "uid": 11800,
    "subgraph": "right-subgraph",
    "template_index": 42,
    "question": "What is on geographical feature of Greater Antilles whose continent is North America ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q128011 wdt:P706 ?answer . ?answer wdt:P30 wd:Q49}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q128011> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P706>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P30> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q49> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the geography of the Greater Antilles in North America?",
    "answers": [
      "Caribbean"
    ]
  },
  {
    "NNQT_question": "What is {digitiser} of {series} of {Ultima III: Exodus} ?",
    "uid": 16153,
    "subgraph": "left-subgraph",
    "template_index": 7098,
    "question": "Who organizes the order of Ultima III: Exodus?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2240236 wdt:P179 ?X . ?X wdt:P479 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2240236> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P179>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P479> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who organizes the arrange of Ultima III: Departure?",
    "answers": [
      "computer keyboard",
      "gamepad"
    ]
  }
]