[
  {
    "NNQT_question": "What is {contains administrative territorial entity} of {endemic to} of {Lycium ferocissimum} ?",
    "uid": 30682,
    "subgraph": "right-subgraph",
    "template_index": 215,
    "question": "which of the villages has endemism of Lycium ferocissimum?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q151022 wdt:P183 ?X . ?X wdt:P150 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "which of the towns has endemism of Lycium ferocissimum?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q501644 wdt:P183 ?X . ?X wdt:P150 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {family} of {Meiji}, that has {founded by} is {Naruhito} ?",
    "uid": 30455,
    "subgraph": "right-subgraph",
    "template_index": 4596,
    "question": "What is the dynasty of Meiji whose co-founder is Naruhito?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q174231 wdt:P53 ?answer . ?answer wdt:P112 wd:Q217096}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the Meiji dynasty with Naruhito as its co - founder?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q174231 wdt:P53 ?answer . ?answer wdt:P112 wd:Q200188}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {marriageable age} of {Guinea} that is {point in time} is {1961-01-01} ?",
    "uid": 31446,
    "subgraph": "statement_property",
    "template_index": 4604,
    "question": "What was the marriageable age of Guinea in 1961?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1006 p:P3000 ?s . ?s ps:P3000 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1961')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1961, what was the marriageable age of Guinea?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q1006 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1961')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {head coach} and the {named after} of {New_York_Yankees} ?",
    "uid": 9496,
    "subgraph": "two intentions right subgraph",
    "template_index": 476,
    "question": "What head coach is the New York Yankees named after?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q213417 wdt:P286 ?ans_1 . wd:Q213417 wdt:P138 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q213417> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P286> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q213417> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P138> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "The New York Yankees were named for which head coach?",
    "answers": [
      "Aaron Boone",
      "New York City",
      "Aaron Boone",
      "Yankee"
    ]
  },
  {
    "NNQT_question": "What is the {part of} for {cinnamon} has {regulates} as {Cinnamon} ?",
    "uid": 31594,
    "subgraph": "statement_property",
    "template_index": 2199,
    "question": "Does cinnamon contain a regulator called Cinnamomum verum?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q28165 p:P128 ?s . ?s ps:P128 wd:Q370239 . ?s pq:P361 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "I want to know if cinnamon contains a regulator called Cinnamonum verum?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q28165 p:P1582 ?s . ?s ps:P1582 wd:Q370239 . ?s pq:P361 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {GameFAQs game ID} of {Civilization III}",
    "uid": 30988,
    "subgraph": "center",
    "template_index": 1126,
    "question": "What is Civilization III's GameRankings game ID?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q2374 wdt:P4769 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q1765733 wdt:P4769 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {building complex} with the {MIN(number of elevators)} whose {main building contractor} is {Arup} ?",
    "uid": 31131,
    "subgraph": "rank",
    "template_index": 420,
    "question": "Name the building with Arup as contractor with the least amount of elevators.",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q1497364 . ?ent wdt:P1301 ?obj . ?ent wdt:P193 wd:Q716737} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Which building whose contractor is Arup has the least amount of elevators?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q1497364 . ?ent wdt:P1301 ?obj . ?ent wdt:P631 wd:Q716737} ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {subclass of} {thoracic disease} that starts with {'s'}",
    "uid": 31244,
    "subgraph": "string matching simple contains word",
    "template_index": 661,
    "question": "What are the subclass of thoracic disease which start with the letter s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P279 wd:Q18553676 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the subclass of thoracic disease that begins with the letter s",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18553676 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {César Award person ID} and {point in time} of {William Golding} has {award received} as {Nobel Prize in Literature}",
    "uid": 32074,
    "subgraph": [],
    "template_index": 33,
    "question": "When was William Golding awarded the Nobel Prize in Literature and what is his César Award person ID ?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q44183 p:P166 ?s . ?s ps:P166 wd:Q37922 . ?s pq:P5319 ?value1 . ?s pq:P585 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When did William Golding win the literary Nobel Prize and what is his César Award person ID?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q44183 p:P166 ?s . ?s ps:P166 wd:Q37922 . ?s pq:P2121 ?value1 . ?s pq:P585 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {place with town rights and privileges} that {located in time zone} {listed objects in Salzburg} and which contains the word {salzburg} in their name",
    "uid": 31925,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3136,
    "question": "Name the place located in listed Salzburg town monuments time zone and containing the word Salzburg in their name.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13539802 . ?sbj wdt:P421 wd:Q1188436 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'salzburg')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Name the place located in recorded Salzburg town landmarks time zone and containing the word Salzburg in their name.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13539802 . ?sbj wdt:P1456 wd:Q1188436 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'salzburg')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {treated by} of {because} of {arteriosclerosis} ?",
    "uid": 17662,
    "subgraph": "right-subgraph",
    "template_index": 352,
    "question": "What is being treated in an individual with arteriosclerosis?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q184559 wdt:P828 ?X . ?X wdt:P2176 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q184559> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P828>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2176> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is being handled in an person with arteriosclerosis?",
    "answers": [
      "D-methamphetamine",
      "mazindol",
      "(+)-norephedrin",
      "phentermine",
      "orlistat",
      "phendimetrazine",
      "diethylpropion",
      "benzphetamine",
      "chlorphentermine",
      "dirlotapide",
      "lorcaserin hydrochloride",
      "chromium picolinate",
      "Insulin Lispro",
      "voglibose",
      "nifedipine",
      "valsartan",
      "triamterene",
      "bumetanide",
      "perindopril",
      "terazosin",
      "ubidecarenone",
      "furosemide",
      "reserpine",
      "(RS)-metoprolol",
      "losartan",
      "verapamil",
      "atenolol",
      "amlodipine",
      "lisinopril",
      "clonidine",
      "bisoprolol",
      "carvedilol",
      "methyldopa",
      "ramipril",
      "(S)-(−)-timolol",
      "isradipine",
      "aliskiren",
      "candesartan",
      "pindolol",
      "nebivolol",
      "esmolol",
      "ethacrynic acid",
      "acebutolol",
      "phenoxybenzamine",
      "doxazosin",
      "torsemide",
      "hydralazine",
      "amiloride",
      "rivaroxaban",
      "phentolamine"
    ]
  },
  {
    "NNQT_question": "What is the {sovereign state} for {country} of {Twenty Thousand Leagues Under the Sea}",
    "uid": 31883,
    "subgraph": "simple question right",
    "template_index": 3262,
    "question": "What sovereign state was Twenty Thousand Leagues Under the Sea country?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q183565 wdt:P17 ?obj . ?obj wdt:P31 wd:Q3624078 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which nations were the countries of the novel \"Twenty Thousand Leagues Under The Sea\"?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q183565 wdt:P840 ?obj . ?obj wdt:P31 wd:Q3624078 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {The-Sports.org athlete ID} of {Nebuchadnezzar II}",
    "uid": 30831,
    "subgraph": "center",
    "template_index": 3143,
    "question": "What is Nebuchadnezzar II's TheSports.org athlete ID?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q12591 wdt:P4391 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q658596 wdt:P4391 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {influenced by} of {Ammonius Saccas}",
    "uid": 31867,
    "subgraph": "simple question right",
    "template_index": 1397,
    "question": "Who is the person that was influenced by Ammonius Saccas?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q310173 wdt:P737 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who did Ammonius Saccas influence?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q11903 wdt:P737 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {separation process} that {discoverer or inventor} {Pierre-Désiré-Amand Savalle} and which contains the word {distillation} in their name",
    "uid": 31928,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2100,
    "question": "What separation process did Pierre-Désiré-Amand Savalle invent with the word \"distillation\" in its name?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q898987 . ?sbj wdt:P61 wd:Q16941948 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'distillation')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What separation process did Pierre-Désiré-Amand Savalle invent with the word \"distillation\" in its name?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q898987 . ?sbj wdt:P61 wd:Q226868 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'distillation')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {profession's field} of {musician}, that has {timeline of topic} is {history of music} ?",
    "uid": 12464,
    "subgraph": "right-subgraph",
    "template_index": 26,
    "question": "Who is profession's field is musician having a timeline of topic of history of music?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q639669 wdt:P425 ?answer . ?answer wdt:P2184 wd:Q846047}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q639669> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P425>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2184> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q846047> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is profession's field is performer having a timeline of subject of history of music?",
    "answers": [
      "music"
    ]
  },
  {
    "NNQT_question": "What is the {country} for {replaced by} of {Soviet Union}",
    "uid": 31893,
    "subgraph": "simple question right",
    "template_index": 938,
    "question": "Name the country replaced by the Soviet Union",
    "sparql_wikidata": " select distinct ?obj where { wd:Q15180 wdt:P1366 ?obj . ?obj wdt:P31 wd:Q6256 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Title the nation prior to the Soviet Union",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q15180 wdt:P530 ?obj . ?obj wdt:P31 wd:Q6256 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {object has role} for {Mickey Mouse} has {contributor to the creative work or subject} as {Seti I} ?",
    "uid": 31483,
    "subgraph": "statement_property",
    "template_index": 1385,
    "question": "What role does Mickey Mouse play in the creative work of Seti I?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q11934 p:P767 ?s . ?s ps:P767 wd:Q157918 . ?s pq:P3831 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "How does Mickey Mouse feature in the creative work of Seti I?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q11934 p:P767 ?s . ?s ps:P767 wd:Q2549739 . ?s pq:P3831 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {eMedicine} are for {acromegaly} ?",
    "uid": 1031,
    "subgraph": "statement_property",
    "template_index": 31,
    "question": "How many eMedicine are acromegaly?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q189580 wdt:P673 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q189580> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P673> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What are the number of acromegaly eMedicine's?",
    "answers": [
      "2"
    ]
  },
  {
    "NNQT_question": "What is {academic subject} of {authors} of {Ten simple rules for editing Wikipedia} ?",
    "uid": 14269,
    "subgraph": "left-subgraph",
    "template_index": 40,
    "question": "Who are the writers of the academic subject Ten simple rules for editing Wikipedia?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q21145331 wdt:P50 ?X . ?X wdt:P101 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q21145331> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P50>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P101> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who are the scholars of the scholastic subject Ten basic rules for altering Wikipedia?",
    "answers": [
      "malaria",
      "DNA sequencing",
      "data visualization"
    ]
  },
  {
    "NNQT_question": "Give me {social} that {intangible cultural heritage status} {inventory of the immaterial cultural patrimony of France} and which contains the word {day} in their name",
    "uid": 25295,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2114,
    "question": "What what is animated nonprofit organization distributed by MGM and English",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q345367 . ?sbj wdt:P3259 wd:Q21011287 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'day')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q345367>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3259> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q21011287>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'day')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What what is enlivened nonprofit organization dispersed by MGM and English",
    "answers": [
      "Day of the Dead"
    ]
  },
  {
    "NNQT_question": "Give me {magazine} that starts with {'z'}",
    "uid": 24439,
    "subgraph": "string matching simple contains word",
    "template_index": 3530,
    "question": "which magazine starts with z",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41298 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q41298>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "which magazine begins with z",
    "answers": [
      "Zoetrope: All-Story",
      "Zoom",
      "Zong",
      "Zwiebelfisch",
      "Züritipp",
      "Zeit im Bild",
      "Zeitenschrift",
      "Zentralblatt der Bauverwaltung",
      "Za Rulem",
      "Zillo",
      "Zeitschrift für Politische Psychologie und Sexualökonomie",
      "Zeitschrift für deutsche Bildung",
      "zeitgeschichte",
      "ZauberZeit",
      "Zack",
      "Zeit Wissen",
      "Zeck",
      "ZeitPunkt-Kulturmagazin",
      "Zoot",
      "Zapple Mag",
      "Zenit",
      "Znamya",
      "Zakonnost'",
      "Zritiel",
      "Znanie – Sila"
    ]
  },
  {
    "NNQT_question": "What is {bordered by} of {died in} of {William Booth} ?",
    "uid": 15271,
    "subgraph": "right-subgraph",
    "template_index": 798,
    "question": "What is bordered by death of William Booth",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q309882 wdt:P20 ?X . ?X wdt:P47 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q309882> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P47> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is bordered by passing of William Booth",
    "answers": [
      "Cockfosters",
      "New Barnet",
      "East Barnet"
    ]
  },
  {
    "NNQT_question": "What is the {public company} for {chief executive officer} of {Michael Dell}",
    "uid": 30312,
    "subgraph": "simple question left",
    "template_index": 3489,
    "question": "Michael Dell is CEO of what public company?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P169 wd:Q218630 . ?sbj wdt:P31 wd:Q891723 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me the public company which CEO is Michael Dell",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P169 wd:Q218630 . ?sbj wdt:P31 wd:Q1589009 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {position held} of {Louis X of France} that is {start time} is {1314-11-29} ?",
    "uid": 7443,
    "subgraph": "statement_property",
    "template_index": 3888,
    "question": "What position did Louis X of France hold starting on 11/29/1314?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q8384 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1314')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q8384> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P39> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1314-11-29>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "On November 29 1314 what position did Louis X of France hold?",
    "answers": [
      "King of France"
    ]
  },
  {
    "NNQT_question": "What is {newspaper format} of {Over the Rainbow}",
    "uid": 30799,
    "subgraph": "center",
    "template_index": 1813,
    "question": "what is in the newspaper format of Over the Rainbow ?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P3912 wd:Q161402}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P5059 wd:Q161402}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {cast member} of {Miami Vice}, that has {place of death} is {1949-12-15} ?",
    "uid": 30440,
    "subgraph": "right-subgraph",
    "template_index": 1453,
    "question": "Who is in the film Miami Vice that was died on December 15, 1949?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q559321 wdt:P161 ?answer . ?answer wdt:P20 ?x FILTER(contains(YEAR(?x),'1949'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is within the film Miami Bad habit that was died on December 15, 1949?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q559321 wdt:P161 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1949'))}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {literary genre} that contains the word {vita} in their name",
    "uid": 23163,
    "subgraph": "string matching simple contains word",
    "template_index": 615,
    "question": "Tell me literary genre whose name has the word vita in it",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223393 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vita')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q223393>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vita')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me scholarly sort whose title has the word vita in it",
    "answers": [
      "vita",
      "curriculum vitae"
    ]
  },
  {
    "NNQT_question": "What is {appointed by} and {end cause} of {{Eugenio Montale} has {position held} as {senatore a vita}}",
    "uid": 10512,
    "subgraph": [],
    "template_index": 590,
    "question": "Name the appointment cause and the halt reason for Eugenio Montale while serving as a senatore a vita",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q83174 p:P39 ?s . ?s ps:P39 wd:Q826589 . ?s pq:P748 ?value1 . ?s pq:P1534 ?value2 }",
    "sparql_dbpedia18": "select distinct ?value1 ?value2 where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q83174> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P39> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q826589>. ?statement <http://www.wikidata.org/entity/P580> ?value1 . ?statement <http://www.wikidata.org/entity/P2842> ?value2 } ",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "what was the appointment cause for eugenio montale while serving as a senatore a vita and what was the halt reason",
    "answers": [
      "Giuseppe Saragat",
      "death in office"
    ]
  },
  {
    "NNQT_question": "What is {has fruit type} of {higher taxon} of {Philodendron edmundoi} ?",
    "uid": 15894,
    "subgraph": "left-subgraph",
    "template_index": 30757,
    "question": "Which fruit type is the higher taxon of Philodendron edmundoi?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q15313826 wdt:P171 ?X . ?X wdt:P4000 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q15313826> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P171>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P4000> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the fruit type of the higher taxon of Philodendron edmundoi?",
    "answers": [
      "berry"
    ]
  }
]