[
  {
    "NNQT_question": "What is {place of birth} of {Virgil}, that has {coordinate location} is {33.45} ?",
    "uid": 30417,
    "subgraph": "right-subgraph",
    "template_index": 372,
    "question": "\"Which birthplace of Virgil, has a Geotag of 33.45?\"",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1398 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'33.45'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "\"Which origin of Virgil, contains a Geotag of 33.45?\"",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q4109 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'33.45'))}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {book of the Bible} for {described by source} of {Exodus}",
    "uid": 30331,
    "subgraph": "simple question left",
    "template_index": 1344,
    "question": "Which part of the Bible was described by Exodus?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1343 wd:Q9190 . ?sbj wdt:P31 wd:Q29154430 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which portion of the Book of scriptures was described by Exodus?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P156 wd:Q9190 . ?sbj wdt:P31 wd:Q29154430 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {creator} of {original language of film or TV show} of {Pedro II of Brazil} ?",
    "uid": 30507,
    "subgraph": "left-subgraph",
    "template_index": 7,
    "question": "Who is {creators} of {language of the original work} {Pedro II of Brazil} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q156774 wdt:P364 ?X . ?X wdt:P170 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who were the creators for the language of the original work of Pedro II of Brazil?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q171711 wdt:P364 ?X . ?X wdt:P170 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {New Zealand Gazetteer place ID} of {Viktor Chernomyrdin}",
    "uid": 30826,
    "subgraph": "center",
    "template_index": 1095,
    "question": "What is the New Zealand Gazetteer place id for Viktor Chernomyrdin?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q190884 wdt:P5104 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q37100 wdt:P5104 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {officially opened by} are to/by {Prince Philip, Duke of Edinburgh} ?",
    "uid": 1667,
    "subgraph": "statement_property",
    "template_index": 1011,
    "question": "How many were officially opened by Prince Philip, Duke of Edinburgh?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P542 wd:Q80976 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P542> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q80976 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Give me the number of castles opened by Prince Philip.",
    "answers": [
      "9"
    ]
  },
  {
    "NNQT_question": "Give me {property} that {measures} {Wechsler Intelligence Scale for Children} and which that starts with {'i'}",
    "uid": 31937,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1240,
    "question": "What what is  property measuring Wechsler Intelligence Scale for Children   which that starts with letters i",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q937228 . ?sbj wdt:P2575 wd:Q1572850 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'i')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "What what is property measuring Wechsler Insights Scale for Children which that begins with letters i",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q937228 . ?sbj wdt:P1880 wd:Q1572850 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'i')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {activating neurotransmitter} are to/by {DL-ornithine} ?",
    "uid": 31740,
    "subgraph": "statement_property",
    "template_index": 1168,
    "question": "how many activated neurotransmitters are in DL-ornithine?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P928 wd:Q27102952 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "DL-ornithine has activated neurotransmitters, how many?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P928 wd:Q210021 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {gender} of {Cecilia Bartoli}, that has {abbreviation} is {жін} ?",
    "uid": 12111,
    "subgraph": "right-subgraph",
    "template_index": 1783,
    "question": "What is the gender of Cecilia Bartoli, which has the abbreviation 'жін'?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q18828 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'жін'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q18828> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P21>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1813> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <жін> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is Cecilia Bartoli's gender, which has the abbreviation ' admissible? '",
    "answers": [
      "female"
    ]
  },
  {
    "NNQT_question": "What is {minimal lethal dose} of {Constanța}",
    "uid": 30870,
    "subgraph": "center",
    "template_index": 1806,
    "question": "What is the minimal lethal dose of Constanta?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q79808 wdt:P2300 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q79808 wdt:P843 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {decimal classification} that {has edition} {DDC 23} and which contains the word {classification} in their name",
    "uid": 25065,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2711,
    "question": "Name a decimal classification that contains the word \"classification \" in its name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1207369 . ?sbj wdt:P747 wd:Q15222117 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'classification')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1207369>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P747> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q15222117>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'classification')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Name a decimal classification that includes the word \"classification \" in its name",
    "answers": [
      "Dewey Decimal Classification"
    ]
  },
  {
    "NNQT_question": "What is the {end time} for {Alexander Rutskoy} has {spouse} as {Mykolas Orbakas} ?",
    "uid": 31496,
    "subgraph": "statement_property",
    "template_index": 3350,
    "question": "When did Alexander Rutskoy divorce his wife, Mykolas Orbakas?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q314116 p:P26 ?s . ?s ps:P26 wd:Q16465149 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What is the divorce date for Alexander Rutskoy from his wife Mykolas Orbakas",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q80510 p:P26 ?s . ?s ps:P26 wd:Q16465149 . ?s pq:P582 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {cast member} of {part of the series} of {Pretty, Pretty Dresses} ?",
    "uid": 30668,
    "subgraph": "left-subgraph",
    "template_index": 401,
    "question": "Who is the cast member of the series Pretty, Pretty Dresses?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q32825539 wdt:P179 ?X . ?X wdt:P161 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who are the actors of the arrangement Lovely, Beautiful Dresses?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q32825539 wdt:P179 ?X . ?X wdt:P725 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {official language} of {Federated States of Micronesia}, that has {kunya} is {инглизсә} ?",
    "uid": 30426,
    "subgraph": "right-subgraph",
    "template_index": 6788,
    "question": "What is the language official in Federated States of Micronesia having a kunya of инглизсә?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q702 wdt:P37 ?answer . ?answer wdt:P8927 ?x FILTER(contains(?x,'инглизсә'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the language authentic in Federated States of Micronesia having a kunya of инглизсә?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q702 wdt:P37 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'инглизсә'))}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {separated from} of {country of citizenship} of {Usher} ?",
    "uid": 30737,
    "subgraph": "right-subgraph",
    "template_index": 2622,
    "question": "When is {separated from} with {nationality} of {Usher} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q165911 wdt:P27 ?X . ?X wdt:P807 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When is {separated from} with {nationality} of {Usher} ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q165911 wdt:P27 ?X . ?X wdt:P530 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {applies to part} for {Vístulamadre} has {coordinate location} as {35.5583} ?",
    "uid": 31610,
    "subgraph": "statement_property",
    "template_index": 941,
    "question": "What part of the Vístulamadre has the coordinates 35.5583?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q548 p:P625 ?s . ?s ps:P625 ?x filter(contains(?x,'35.5583')) . ?s pq:P518 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Coordinate 35.5583 is the coordinate for what part of the Vístulamadre?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q40059 p:P625 ?s . ?s ps:P625 ?x filter(contains(?x,'35.5583')) . ?s pq:P518 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {formation} of {Zero Mostel}, that has {subsidiary company} is {United States Army Human Resources Command} ?",
    "uid": 12140,
    "subgraph": "right-subgraph",
    "template_index": 74,
    "question": "What is the formation of Zero Mostel with subsidiary company in the United States Army Human Resources Command?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q191952 wdt:P241 ?answer . ?answer wdt:P355 wd:Q7889484}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q191952> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P241>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P355> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q7889484> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the formation of Zero Mostel in the U.S. Army Human Resources Command with a subsidiary?",
    "answers": [
      "United States Army"
    ]
  },
  {
    "NNQT_question": "What is the {Gabriel Gonzáles Videla} for {designed by} of {Dennis M. Ritchie}",
    "uid": 30240,
    "subgraph": "simple question left",
    "template_index": 3384,
    "question": "Which Gabriel González Videla did Dennis M. Ritchie create?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P287 wd:Q45575 . ?sbj wdt:P31 wd:Q815 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which Gabriel Gonzáles Videla did Dennis M. Ritchie make?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P287 wd:Q45575 . ?sbj wdt:P31 wd:Q9143 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of sports team} of {Andrei Tarkovsky} and {number of matches played/races/starts}",
    "uid": 32012,
    "subgraph": [],
    "template_index": 1053,
    "question": "What team does Andrei Tarkovsky play for, and how many matches has he played?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q853 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What crew does Andrei Tarkovsky play for, and how many fits has he played?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q170328 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Velká pardubická} with the {MIN(race time)} whose {winner} is {Peter Gehm}  ?",
    "uid": 3279,
    "subgraph": "rank",
    "template_index": 501,
    "question": "What is the Velká pardubická with the lowest race time whose winner is Peter Gehm?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q1701273 . ?ent wdt:P2781 ?obj . ?ent wdt:P1346 wd:Q12044712} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q1701273>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2781>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1346> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q12044712> .\n\n}\nORDER BY ASC(?obj1)\nLIMIT 5",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "What Velka Pardubicka has the lowest race time that was won by Peter Gehm?",
    "answers": [
      "Velká pardubická 2003",
      "Velká pardubická 2001",
      "Velká pardubická 2002"
    ]
  },
  {
    "NNQT_question": "What is {child} of {Alistair Brownlee}",
    "uid": 31034,
    "subgraph": "center",
    "template_index": 304,
    "question": "Please tell me Alistair Brownlee's child.",
    "sparql_wikidata": "select distinct ?answer where { wd:Q716308 wdt:P40 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q716308 wdt:P2778 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Flora of North America taxon ID} of {wolverine}",
    "uid": 30925,
    "subgraph": "center",
    "template_index": 2204,
    "question": "What is  the Flora of North America taxon ID for wolverine?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q14334 wdt:P1727 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q156344 wdt:P1727 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {horse breed} that starts with {'z'}",
    "uid": 24387,
    "subgraph": "string matching simple contains word",
    "template_index": 566,
    "question": "Tell me every horse breed whose name starts with the letter z",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1160573 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1160573>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me each and every horse breed whose identify begins with the letter z",
    "answers": [
      "Zangersheide",
      "Zweibrücker",
      "Zaniskari",
      "Zabaikal",
      "Zhongdian"
    ]
  },
  {
    "NNQT_question": "What is {captain} of {plays for} of {Gerry Brisson} ?",
    "uid": 16729,
    "subgraph": "left-subgraph",
    "template_index": 2467,
    "question": "Captain Gerry Brisson plays for what?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q746901 wdt:P54 ?X . ?X wdt:P634 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q746901> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P54>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P634> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Captain Gerry Brisson plays for what?",
    "answers": [
      "Maurice Richard",
      "Saku Koivu",
      "Jean Béliveau",
      "Brian Gionta",
      "Henri Richard",
      "Max Pacioretty"
    ]
  },
  {
    "NNQT_question": "How many {number of subscribers} are for {Jesus} ?",
    "uid": 31681,
    "subgraph": "statement_property",
    "template_index": 378,
    "question": "What were the number of subscribers of Jesus Christ?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q302 wdt:P3744 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What were Jesus' number of subscribers?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q302 wdt:P3909 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {instance of} of {New Zealand} that is {end time} is {1947-11-25} ?",
    "uid": 7786,
    "subgraph": "statement_property",
    "template_index": 4231,
    "question": "What happened in New Zealand on 11/25/1947?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q664 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1947')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q664> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P582> <1947-11-25>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which event transpired on 11/25/1947 in New Zealand?",
    "answers": [
      "dominion of the British Empire"
    ]
  },
  {
    "NNQT_question": "What is {award received} of {Davao City} that is {together with} is {Eyvind Johnson} ?",
    "uid": 31288,
    "subgraph": "statement_property",
    "template_index": 3960,
    "question": "What award did Davao City adn Eyvind Johnson receive together?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1473 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q131326 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which award was given to both Davao City and Eyvind Johnson?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q132695 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q131326 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {determination method} for {arterial hypertension} has {cell component} as {CACNB2} ?",
    "uid": 31587,
    "subgraph": "statement_property",
    "template_index": 4106,
    "question": "Tell me the method for determining hypertension with a CACNB2 cell component?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q41861 p:P681 ?s . ?s ps:P681 wd:Q17854978 . ?s pq:P459 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "How is the hypertension with a CACNB2 cell component determined?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q41861 p:P2293 ?s . ?s ps:P2293 wd:Q17854978 . ?s pq:P459 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {publication date} for {Andrés de Santa Cruz} has {software version identifier} as {12.7.5} ?",
    "uid": 31482,
    "subgraph": "statement_property",
    "template_index": 5011,
    "question": "what was the publication date for Andrés de Santa Cruz which has software version as 12.7.5?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q467959 p:P348 ?s . ?s ps:P348 ?x filter(contains(?x,'12.7.5')) . ?s pq:P577 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When was Andrés de Santa Cruz version 12.7.5 published?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q9589 p:P348 ?s . ?s ps:P348 ?x filter(contains(?x,'12.7.5')) . ?s pq:P577 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Zamboanga City} and {point in time}",
    "uid": 31996,
    "subgraph": [],
    "template_index": 783,
    "question": "which award Zamboanga City did receive and at what time he got it?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q1629 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "which award Zamboanga City did obtain and at what time he bought it?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q11621 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {sibling} of {Jim McCartney}",
    "uid": 30323,
    "subgraph": "simple question left",
    "template_index": 1577,
    "question": "Who are Jim McCartney's siblings?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P3373 wd:Q14084294 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the names of Jim McCartney's siblings?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P3373 wd:Q2599 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {sibling} of {Philip Stanhope, 4th Earl of Chesterfield}",
    "uid": 31864,
    "subgraph": "simple question right",
    "template_index": 787,
    "question": "Who is the brother or sister of Philip Stanhope, 4th Earl of Chesterfield?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q332487 wdt:P3373 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the brother or sister of Philip Stanhope, 4th Earl of Chesterfield?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q131981 wdt:P3373 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {U.S. National Archives Identifier} of {Neurospora crassa}",
    "uid": 31054,
    "subgraph": "center",
    "template_index": 3401,
    "question": "Which is a U.S. National Archives Identifier of Neurospora crassa?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q133459 wdt:P1225 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q133459 wdt:P1391 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {end time} for {Korea} has {country} as {Later Three Kingdoms} ?",
    "uid": 5001,
    "subgraph": "statement_property",
    "template_index": 1446,
    "question": "When did the Three Kingdoms period end in Korea?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q18097 p:P17 ?s . ?s ps:P17 wd:Q698268 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q18097> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P17> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q698268> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When was the last year Three Kingdoms period finish in Korea?",
    "answers": [
      "0935-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {language official} of {Federated States of Micronesia}, that has {shortened name} is {инглизсә} ?",
    "uid": 13108,
    "subgraph": "right-subgraph",
    "template_index": 6788,
    "question": "What is the language official in Federated States of Micronesia having a shortened name of",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q702 wdt:P37 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'инглизсә'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q702> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P37>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1813> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <инглизсә> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the language authentic in Federated States of Micronesia having a shortened title of",
    "answers": [
      "English"
    ]
  }
]