[
  {
    "NNQT_question": "Give me {country of citizenship} {dyad} that contains the word {yan} in their name",
    "uid": 31208,
    "subgraph": "string matching simple contains word",
    "template_index": 1031,
    "question": "Tell me citizen of dyed whose name has the word yan in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P27 wd:Q29431432 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yan')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know citizen of colored whose title has the word yan in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29431432 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yan')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {interested in} are for {Seretse Khama} ?",
    "uid": 31673,
    "subgraph": "statement_property",
    "template_index": 424,
    "question": "How many are interested in Seretse Khama?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q219962 wdt:P2650 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Seretse Khama is interested in by how many people?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q215263 wdt:P2650 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {canonization status} are to/by {Benevolent Dictator for Life} ?",
    "uid": 31743,
    "subgraph": "statement_property",
    "template_index": 1373,
    "question": "How many Benevolent Dictator for Lifes have obtained canonization status?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P411 wd:Q11271 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "What is the number of Benevolent Dictator for Lifes that have been canonized?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P411 wd:Q43115 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {employer} of {Zero Mostel}, that has {subsidiary} is {United States Army Human Resources Command} ?",
    "uid": 30480,
    "subgraph": "right-subgraph",
    "template_index": 74,
    "question": "What is the employer of Zero Mostel with subsidiary company in the United States Army Human Resources Command?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q191952 wdt:P108 ?answer . ?answer wdt:P355 wd:Q7889484}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the employer of Zero Mostel in the U.S. Army Human Resources Command with a subsidiary?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q191952 wdt:P241 ?answer . ?answer wdt:P355 wd:Q7889484}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {narrative location} of {Infinite Jest}, that has {shares border with} is {Auckland} ?",
    "uid": 30357,
    "subgraph": "right-subgraph",
    "template_index": 1629,
    "question": "What is the narrative location of Infinite Jest, that shares border with Auckland?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1077445 wdt:P840 ?answer . ?answer wdt:P47 wd:Q37100}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name Infinite Jest location, which shares borser with Auckland",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1077445 wdt:P840 ?answer . ?answer wdt:P47 wd:Q49143}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {operating system} are to/by {Logo} ?",
    "uid": 31754,
    "subgraph": "statement_property",
    "template_index": 1492,
    "question": "Hoe many operating systems  are supported by logo?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P306 wd:Q201436 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Logo supports what number of operating systems?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3985 wd:Q201436 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Gran Enciclopèdia Catalana ID} of {Rishon LeZion}",
    "uid": 31051,
    "subgraph": "center",
    "template_index": 3473,
    "question": "Which is the Gran Enciclopèdia Catalana ID for Rishon LeZion?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q201051 wdt:P1296 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q201051 wdt:P3941 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Dreadnought Project page} of {Story Musgrave}, that has {conflict} is {Banana Wars} ?",
    "uid": 30427,
    "subgraph": "right-subgraph",
    "template_index": 1290,
    "question": "What is the Dreadnought Project page of Story Musgrave, that participated to Banana Wars conflict?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q462132 wdt:P4589 ?answer . ?answer wdt:P607 wd:Q768496}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name Story Musgrave's Dreadnought Project page that was involved in the war of Banana Wars",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q462132 wdt:P241 ?answer . ?answer wdt:P607 wd:Q768496}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Samuel Beckett} has {nominated for} as {Walter Bauer Award} ?",
    "uid": 31547,
    "subgraph": "statement_property",
    "template_index": 4797,
    "question": "when was samuel beckett nominated for Walter Bauer Award?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q37327 p:P1411 ?s . ?s ps:P1411 wd:Q1342797 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What year was Samuel Beckett nominated for a Walter Bauer Award?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q37327 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {date depicted} for {Peter Freuchen} has {member of political party} as {Social Democrats} ?",
    "uid": 31580,
    "subgraph": "statement_property",
    "template_index": 998,
    "question": "When Peter Freuchen joined the Social Democrats, what was the date depicted?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q945641 p:P102 ?s . ?s ps:P102 wd:Q212101 . ?s pq:P2913 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Which was the date depicted when Peter Freuchen became a member of the Social Democrats?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q945641 p:P102 ?s . ?s ps:P102 wd:Q212101 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {in conflict} of {depiction of} of {Raising the Flag on Iwo Jima} ?",
    "uid": 15600,
    "subgraph": "right-subgraph",
    "template_index": 546,
    "question": "What conflict is depicted is Raising the Flag on Iwo Jima?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q117693 wdt:P180 ?X . ?X wdt:P607 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q117693> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P180>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P607> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which conflict is depicted by the Raising of the Flag on Iwo Jima?",
    "answers": [
      "World War II",
      "Battle of Iwo Jima",
      "Battle of Vella Gulf",
      "Bougainville Campaign",
      "World War II",
      "World War II",
      "Battle of Iwo Jima",
      "World War II",
      "World War II"
    ]
  },
  {
    "NNQT_question": "What is the {GHS hazard pictogram} and the {religion} of {Elizabeth Smart} ?",
    "uid": 31952,
    "subgraph": "two intentions right subgraph",
    "template_index": 615,
    "question": "What is the GHS hazard pictogram and the religion of Elizabeth_Smart ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q13462978 wdt:P5040 ?ans_1 . wd:Q13462978 wdt:P140 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What was Elizabeth Smart's GHS hazard pictogram, and what religion did she follow?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q13462978 wdt:P27 ?ans_1 . wd:Q13462978 wdt:P140 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {country of citizenship} of {Marlene Dietrich} that is {start time} is {1939-0-0} ?",
    "uid": 6095,
    "subgraph": "statement_property",
    "template_index": 2540,
    "question": "In 1939, what country did Marlene Dietrich become a citizen of?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q4612 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1939')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q4612> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P27> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1939-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which country became a citizen of Marlene Dietrich in 1939?",
    "answers": [
      "United States of America"
    ]
  },
  {
    "NNQT_question": "What is {tributary} and {end cause} of {Ramsay MacDonald} has {position held} as {Member of the 37th Parliament of the United Kingdom}",
    "uid": 32059,
    "subgraph": [],
    "template_index": 716,
    "question": "What tributary did Ramsay MacDonald have as member of the 37th Parliament of the United Kingdom and what was his cause?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q166646 p:P39 ?s . ?s ps:P39 wd:Q41582593 . ?s pq:P974 ?value1 . ?s pq:P1534 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What tributary did Ramsay McDonald have in the parliament of the UK?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q166646 p:P39 ?s . ?s ps:P39 wd:Q41582593 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Biographisches Archiv der Psychiatrie  ID} of {Horemheb}",
    "uid": 30838,
    "subgraph": "center",
    "template_index": 2146,
    "question": "What is BIA PSY person ID for Horemheb ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q157995 wdt:P5450 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q191004 wdt:P5450 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {tonality} of {Symphony No. 40}, that has {followed by} is {F-sharp minor} ?",
    "uid": 30488,
    "subgraph": "right-subgraph",
    "template_index": 201,
    "question": "What key is the Symphony No. 40 written in that was followed by F-sharp minor?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q231390 wdt:P826 ?answer . ?answer wdt:P156 wd:Q283910}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the key written in Symphony No. 40 that was F - sharp minor in the future?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q231390 wdt:P826 ?answer . ?answer wdt:P155 wd:Q283910}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {represents} for {Convention against Transnational Organized Crime} has {signatory} as {Dean Acheson} ?",
    "uid": 31613,
    "subgraph": "statement_property",
    "template_index": 448,
    "question": "what is the {represents} for {Convention against Transnational Organized Crime} that has {signatory} as {Dean Acheson} ?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q331504 p:P1891 ?s . ?s ps:P1891 wd:Q214758 . ?s pq:P1268 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "what signature represents Dean Acheson regarding the Convention against Transnational Organized Crime?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q877399 p:P1891 ?s . ?s ps:P1891 wd:Q214758 . ?s pq:P1268 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {total imports} of {Southern Dzongdey}",
    "uid": 30918,
    "subgraph": "center",
    "template_index": 2660,
    "question": "What is Southern Dzongdey's total imports?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q3575751 wdt:P2136 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q1788657 wdt:P2136 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {set in period} of {Drömfakulteten}",
    "uid": 30917,
    "subgraph": "center",
    "template_index": 2807,
    "question": "Which is the period Drömfakulteten was set in?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q44017 wdt:P2408 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q214371 wdt:P2408 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {national association football team} that contains the word {team} in their name",
    "uid": 23319,
    "subgraph": "string matching simple contains word",
    "template_index": 2790,
    "question": "Tell me national association football team whose name has the word team in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6979593 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'team')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q6979593>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'team')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Disclose me national association football team whose name has the word team in it.",
    "answers": [
      "Catalonia national football team",
      "North Korea national football team",
      "Canada men's national soccer team",
      "Bahrain national football team",
      "United Kingdom national football team",
      "Italy national under-21 football team",
      "Wales national under-21 football team",
      "Costa Rica national under-20 football team",
      "Somalia national football team",
      "Solomon Islands national football team",
      "Maldives national football team",
      "Tunisia national football team",
      "Egypt national football team",
      "Saaremaa official association football team",
      "Gotland official association football team",
      "Uruguay national under-20 football team",
      "Niger national under-17 football team",
      "Argentina national under-23 football team",
      "Ynys Môn football team",
      "Frøya official association football team",
      "Chile national under-20 football team",
      "Dominican Republic national football team",
      "Netherlands national association football team",
      "Papua New Guinea national football team",
      "Mauritius national football team"
    ]
  },
  {
    "NNQT_question": "What is the {universe} for {has part} of {Big Bang}",
    "uid": 31887,
    "subgraph": "simple question right",
    "template_index": 1629,
    "question": "What part did the Big Bang have in the universe?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q323 wdt:P527 ?obj . ?obj wdt:P31 wd:Q36906466 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What part did the Enormous Blast have in the universe?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q323 wdt:P1542 ?obj . ?obj wdt:P31 wd:Q36906466 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {end time} for {Alla Pugacheva} has {spouse} as {Mykolas Orbakas} ?",
    "uid": 6905,
    "subgraph": "statement_property",
    "template_index": 3350,
    "question": "When did Alla Pugacheva divorce his wife, Mykolas Orbakas?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q80510 p:P26 ?s . ?s ps:P26 wd:Q16465149 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q80510> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q16465149> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What is the divorce date for Alla Pugacheva from his wife Mykolas Orbakas",
    "answers": [
      "1973-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {opposite of} of {inorganic chemistry}, that has {heat deflection temperature} is {history of organic chemistry} ?",
    "uid": 30432,
    "subgraph": "right-subgraph",
    "template_index": 87,
    "question": "What is the opposite of inorganic chemistry with a heat deflection temperature of history of organic chemistry?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q11165 wdt:P461 ?answer . ?answer wdt:P5682 wd:Q17480697}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the inverse of inorganic chemistry with a heat deflection temperature of history of organic chemistry?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q11165 wdt:P461 ?answer . ?answer wdt:P2184 wd:Q17480697}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {for work} for {Zooey Deschanel} has {nominated for} as {Grammy Award for Best Song Written for Visual Media} ?",
    "uid": 31622,
    "subgraph": "statement_property",
    "template_index": 4852,
    "question": "For what show was Zooey Deschanel nominated for a Grammy Award for Best Song Written for Visual Media?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q191719 p:P1411 ?s . ?s ps:P1411 wd:Q428808 . ?s pq:P1686 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "In a Comedy Series, for what program was Zooey Deschanel assigned to a Grammy Award for Best Song Written for Visual Media?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q191719 p:P1411 ?s . ?s ps:P1411 wd:Q1287335 . ?s pq:P1686 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {language used} of {New York City} that is {has quality} is {second language} ?",
    "uid": 31342,
    "subgraph": "statement_property",
    "template_index": 4554,
    "question": "Which language is used in New York City that has a quality of second language?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q60 p:P2936 ?s . ?s ps:P2936 ?obj . ?s pq:P1552 wd:Q125421 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Wich language is used as a second language in New York City?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q1410 p:P2936 ?s . ?s ps:P2936 ?obj . ?s pq:P1552 wd:Q125421 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {sibling} and the {child} of {Alan_Alda} ?",
    "uid": 9549,
    "subgraph": "two intentions right subgraph",
    "template_index": 35,
    "question": "Who are the children and siblings of Alan Alda?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q310394 wdt:P3373 ?ans_1 . wd:Q310394 wdt:P40 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q310394> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3373> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q310394> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P40> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Name the immediate family of Alan Alda.",
    "answers": [
      "Antony Alda",
      "Beatrice Alda",
      "Antony Alda",
      "Elizabeth Alda",
      "Antony Alda",
      "Eve Alda"
    ]
  },
  {
    "NNQT_question": "What is {World Spider Catalog ID} of {Geometridae}",
    "uid": 31041,
    "subgraph": "center",
    "template_index": 1421,
    "question": "Which is the World Spider Catalog ID for Geometridae?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q45559 wdt:P3288 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q45559 wdt:P3398 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {UCI 2.1} with the {MAX(category for the interior of the item)} whose {participating team} is {2016 Katusha} ?",
    "uid": 31108,
    "subgraph": "rank",
    "template_index": 66,
    "question": "What is the 2.1 with the highest category for the interior of the item whose participating teams is Katusha 2016?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q22231112 . ?ent wdt:P7561 ?obj . ?ent wdt:P1923 wd:Q21955186 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Out of the participating teams in the Katusha 2016, who with a 2.1 had the highest category for the interior of the item?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q22231112 . ?ent wdt:P2052 ?obj . ?ent wdt:P1923 wd:Q21955186 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {bourbon whiskey} with the {MIN(alcohol by volume)} whose {angle from vertical} is {United States of America} ?",
    "uid": 31106,
    "subgraph": "rank",
    "template_index": 413,
    "question": "Which bourbon whisky has the lowest alcohol by volume whose angle from vertical is united states of america?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q543127 . ?ent wdt:P2665 ?obj . ?ent wdt:P4183 wd:Q30} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Which bourbon whisky has the lowest alcohol via volume whose angle from vertical is united states of america?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q543127 . ?ent wdt:P2665 ?obj . ?ent wdt:P495 wd:Q30} ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {population} of {Normandy} that is {point in time} is {2005-0-0} ?",
    "uid": 6457,
    "subgraph": "statement_property",
    "template_index": 2902,
    "question": "How much was the population of Normandy in 2005?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q18677875 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2005')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q18677875> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2005-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "How many people lived in Normandy in 2005?",
    "answers": [
      "3450388"
    ]
  },
  {
    "NNQT_question": "What is {twinned administrative body} of {Bosnia and Herzegovina} that is {start time} is {1992-05-18} ?",
    "uid": 31281,
    "subgraph": "statement_property",
    "template_index": 1032,
    "question": "What has been the ister city of Bosnia and Herzegovina since Aug 25th, 1992?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q225 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1992')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Since Aug. 25th, 1992 this has been the ister city of Bosnia and Herzegovina?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q92161 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1992')) }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {HomoloGene ID} of {Cdc14}",
    "uid": 30905,
    "subgraph": "center",
    "template_index": 3389,
    "question": "What is Cdc14's HomoloGene ID?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q5055653 wdt:P593 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q14820612 wdt:P593 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {MinDat mineral ID} of {petroleum}",
    "uid": 31058,
    "subgraph": "center",
    "template_index": 2551,
    "question": "Which is the MinDat mineral IDl of petroleum?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q22656 wdt:P6263 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q22656 wdt:P2662 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]