[
  {
    "NNQT_question": "Give me {religious concept} that {facet of} {Częstochowa} and which contains the word {yatra} in their name",
    "uid": 31905,
    "subgraph": "string matching type + relation contains word",
    "template_index": 635,
    "question": "Name a religious concept in Częstochowa that contains the word \"yatra\" in its name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23847174 . ?sbj wdt:P1269 wd:Q103217 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yatra')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Name a non secular thought in Częstochowa that carries the phrase \"yatra\" in its title",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23847174 . ?sbj wdt:P1269 wd:Q9089 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yatra')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {postal code} are for {Sioux Falls} ?",
    "uid": 1561,
    "subgraph": "statement_property",
    "template_index": 561,
    "question": "What are the postal codes for Sioux Falls?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q131335 wdt:P281 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q131335> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P281> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Give me the postal codes for Sioux Falls.",
    "answers": [
      "8"
    ]
  },
  {
    "NNQT_question": "What is {Dowker-Thistlethwaite name} of {petroleum jelly}",
    "uid": 30783,
    "subgraph": "center",
    "template_index": 3287,
    "question": "Which is the Dowker-Thistlethwaite name of petroleum jelly?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P8416 wd:Q457239}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P2239 wd:Q457239}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nickname} of {Saltillo}",
    "uid": 30848,
    "subgraph": "center",
    "template_index": 3232,
    "question": "Saltillo name",
    "sparql_wikidata": "select distinct ?answer where { wd:Q53077 wdt:P1449 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q434909 wdt:P1449 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {taxon} for {taxonomic type} of {lion}",
    "uid": 30276,
    "subgraph": "simple question left",
    "template_index": 1714,
    "question": "What taxon does lion belong to?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P427 wd:Q140 . ?sbj wdt:P31 wd:Q16521 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What taxon does lion belong?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P427 wd:Q43084 . ?sbj wdt:P31 wd:Q16521 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {son of} of {brother} of {Murray Guggenheim} ?",
    "uid": 16399,
    "subgraph": "left-subgraph",
    "template_index": 102,
    "question": "Who is the son of the brother of Murray Guggenheim?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1702576 wdt:P3373 ?X . ?X wdt:P22 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1702576> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3373>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P22> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is the child of the brother of Murray Guggenheim?",
    "answers": [
      "Meyer Guggenheim",
      "Meyer Guggenheim",
      "Meyer Guggenheim",
      "Meyer Guggenheim",
      "Meyer Guggenheim",
      "Meyer Guggenheim"
    ]
  },
  {
    "NNQT_question": "What is the {nomadic empire} for {located in the administrative territorial entity} of {Golden Horde}",
    "uid": 31879,
    "subgraph": "simple question right",
    "template_index": 3987,
    "question": "Which empire rose was located in the territorial entity of Golden Horde?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q79965 wdt:P131 ?obj . ?obj wdt:P31 wd:Q2495771 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which domain took place in the Brilliant Horde?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q79965 wdt:P17 ?obj . ?obj wdt:P31 wd:Q2495771 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {ideology} of {member of party} of {Michel Pouzol} ?",
    "uid": 15690,
    "subgraph": "left-subgraph",
    "template_index": 29836,
    "question": "Who is ideology of member of party of Michel Pouzol ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3310625 wdt:P102 ?X . ?X wdt:P1142 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q3310625> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P102>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1142> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is philosophy of part of party of Michel Pouzol ?",
    "answers": [
      "social democracy",
      "social liberalism",
      "social ecology"
    ]
  },
  {
    "NNQT_question": "What is {place of death} of {Amelia Earhart}, that has {secretary general} is {Ayampe River} ?",
    "uid": 30379,
    "subgraph": "right-subgraph",
    "template_index": 4603,
    "question": "Where is the deathplace of {Amelia Earhart}, which secretary general is Ayampe River?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3355 wdt:P20 ?answer . ?answer wdt:P3975 wd:Q1367043}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Where is the deathplace of Amelia Earhart, which has Ayampe River as secretary general?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q3355 wdt:P20 ?answer . ?answer wdt:P974 wd:Q1367043}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {develops from} of {Aysén Region} that is {point in time} is {1992-01-01} ?",
    "uid": 31311,
    "subgraph": "statement_property",
    "template_index": 5858,
    "question": "What was the source of development of Aysén Region from 1992-0-0?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q2181 p:P3094 ?s . ?s ps:P3094 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1992')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was the source of development of the Aysen Region from the exact time 1992",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q2181 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1992')) }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {ComicBookDB ID} of {Georgina Cassar}",
    "uid": 31017,
    "subgraph": "center",
    "template_index": 451,
    "question": "Which is the ComicBookDB ID for Georgina Cassar?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q839 wdt:P1392 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q540787 wdt:P1392 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {shares border with} of {Senegal}, that has {member of} is {National agencies responsible for GDP measurement} ?",
    "uid": 30411,
    "subgraph": "right-subgraph",
    "template_index": 16177,
    "question": "What borders Senegal and yet is a member of National agencies responsible for GDP measurement?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1041 wdt:P47 ?answer . ?answer wdt:P463 wd:Q6979530}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What borders Senegal and however could be a part of National agencies responsible for GDP measurement?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1041 wdt:P47 ?answer . ?answer wdt:P463 wd:Q3348506}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {relative} of {George Washington} that is {kinship to subject} is {first cousin once removed descending} ?",
    "uid": 31423,
    "subgraph": "statement_property",
    "template_index": 3596,
    "question": "What relative or kinship is the first cousin once removed descending of George Washington?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q23 p:P1038 ?s . ?s ps:P1038 ?obj . ?s pq:P1039 wd:Q19901611 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Who is George Washington's first cousin, once removed?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q440 p:P1038 ?s . ?s ps:P1038 ?obj . ?s pq:P1039 wd:Q19901611 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {long gun} that contains the word {shotgun} in their name",
    "uid": 31230,
    "subgraph": "string matching simple contains word",
    "template_index": 2011,
    "question": "Tell me long gun whose name has the word shotgun in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1046481 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'shotgun')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Disclose me long gun whose name has the word shotgun in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12796 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'shotgun')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {narrative location} of {The Escort} that is {filming location} is {California} ?",
    "uid": 31354,
    "subgraph": "statement_property",
    "template_index": 5532,
    "question": "Where was the plot of The Escort, filmed in California, set?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q59501 p:P840 ?s . ?s ps:P840 ?obj . ?s pq:P915 wd:Q99 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Where in California was The Escort se itn",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q223139 p:P840 ?s . ?s ps:P840 ?obj . ?s pq:P915 wd:Q99 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {target muscle} of {Maria Montessori} that is {point in time} is {1950-01-01} ?",
    "uid": 31324,
    "subgraph": "statement_property",
    "template_index": 1362,
    "question": "What award was Maria Montessori target muscle on January 1, 1950?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q131117 p:P6884 ?s . ?s ps:P6884 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1950')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which was the award that Maria Monessori got target muscle in 1950?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q131117 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1950')) }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {commanded by} are to/by {Crusades} ?",
    "uid": 31747,
    "subgraph": "statement_property",
    "template_index": 1651,
    "question": "How many people commanded by Crusades were there?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P4791 wd:Q12546 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "What is the number of people commanded by Crusades?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P607 wd:Q12546 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {ultimate cause} of {participant in conflict} of {Vasily Blyukher} ?",
    "uid": 16144,
    "subgraph": "right-subgraph",
    "template_index": 3527,
    "question": "In which conflict was Vasily Blyukher involved ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q48129 wdt:P607 ?X . ?X wdt:P828 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q48129> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P607>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P828> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which conflict was Vasily Blyukher part of?",
    "answers": [
      "multiple causes"
    ]
  },
  {
    "NNQT_question": "What is {member of sports team} of {Peter Schmeichel} that is {first attested from} is {1984-01-01} ?",
    "uid": 31315,
    "subgraph": "statement_property",
    "template_index": 2532,
    "question": "What team did Peter Schmeichel start playing for that was first attested from 1984?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q182314 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P6684 ?x filter(contains(YEAR(?x),'1984')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What team did Peter Schmeichel join that was first attested from 1984?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q182314 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1984')) }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nominated for} of {Laurence Olivier} that is {train depot} is {12th Academy Awards} ?",
    "uid": 31318,
    "subgraph": "statement_property",
    "template_index": 470,
    "question": "What was Laurence Olivier nominated for at the 12th Academy Awards train depot?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q55245 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P834 wd:Q508513 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Laurence Olivier was nominated for what at the 12th annual Academy Awards train depot?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q55245 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q508513 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {clearance} for {Trichomonas vaginalis} has {award received} as {Q1310157} ?",
    "uid": 31523,
    "subgraph": "statement_property",
    "template_index": 4966,
    "question": "What was the clearance of Trichomonas vaginalis that received the Q1310157 award?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q132595 p:P166 ?s . ?s ps:P166 wd:Q1310157 . ?s pq:P2793 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was Trichomonas vaginalis clearance that received the Q1310157 award?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q132595 p:P166 ?s . ?s ps:P166 wd:Q1310157 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {participant} and the {location} of {Pacific_War} ?",
    "uid": 9757,
    "subgraph": "two intentions right subgraph",
    "template_index": 14,
    "question": "Which is the {participant} and the {location} of {Pacific_War} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q184425 wdt:P710 ?ans_1 . wd:Q184425 wdt:P276 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q184425> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P710> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q184425> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P276> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Who was involved in the pacific war and where did it take place?",
    "answers": [
      "Pacific Ocean",
      "Canada",
      "Oceania",
      "Canada",
      "Taiwan",
      "Canada",
      "Indian Ocean",
      "Canada",
      "East Asia",
      "Canada",
      "South Asia",
      "Canada",
      "Pacific Ocean",
      "United States of America",
      "Oceania",
      "United States of America",
      "Taiwan",
      "United States of America",
      "Indian Ocean",
      "United States of America",
      "East Asia",
      "United States of America",
      "South Asia",
      "United States of America",
      "Pacific Ocean",
      "Netherlands",
      "Oceania",
      "Netherlands",
      "Taiwan",
      "Netherlands",
      "Indian Ocean",
      "Netherlands",
      "East Asia",
      "Netherlands",
      "South Asia",
      "Netherlands",
      "Pacific Ocean",
      "Mexico",
      "Oceania",
      "Mexico",
      "Taiwan",
      "Mexico",
      "Indian Ocean",
      "Mexico",
      "East Asia",
      "Mexico",
      "South Asia",
      "Mexico",
      "Pacific Ocean",
      "United Kingdom",
      "Oceania",
      "United Kingdom",
      "Taiwan",
      "United Kingdom",
      "Indian Ocean",
      "United Kingdom",
      "East Asia",
      "United Kingdom",
      "South Asia",
      "United Kingdom",
      "Pacific Ocean",
      "Australia",
      "Oceania",
      "Australia",
      "Taiwan",
      "Australia",
      "Indian Ocean",
      "Australia",
      "East Asia",
      "Australia",
      "South Asia",
      "Australia",
      "Pacific Ocean",
      "Thailand",
      "Oceania",
      "Thailand",
      "Taiwan",
      "Thailand",
      "Indian Ocean",
      "Thailand",
      "East Asia",
      "Thailand",
      "South Asia",
      "Thailand",
      "Pacific Ocean",
      "Soviet Union",
      "Oceania",
      "Soviet Union",
      "Taiwan",
      "Soviet Union",
      "Indian Ocean",
      "Soviet Union",
      "East Asia",
      "Soviet Union",
      "South Asia",
      "Soviet Union",
      "Pacific Ocean",
      "Empire of Japan",
      "Oceania",
      "Empire of Japan"
    ]
  },
  {
    "NNQT_question": "What is the {for work} for {Charles de Gaulle} has {nominated for} as {Academy Award for Best Actor} ?",
    "uid": 31608,
    "subgraph": "statement_property",
    "template_index": 2133,
    "question": "For what work was Charles de Gaulle nominated for the Academy Award for Best Actor?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q2042 p:P1411 ?s . ?s ps:P1411 wd:Q103916 . ?s pq:P1686 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Charles de Gaulle was nominated for what work for the Academy Award for Best Actor?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q129817 p:P1411 ?s . ?s ps:P1411 wd:Q103916 . ?s pq:P1686 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {country} of {Bad Vöslau} that is {start time} is {1871-01-18} ?",
    "uid": 31347,
    "subgraph": "statement_property",
    "template_index": 399,
    "question": "What country was started in the year 1871 in Bad Vöslau?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q798800 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1871')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1871 what country was started in Bad Vöslau?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q1721 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1871')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {IAAF competition category} {winged horse} that contains the word {pegasus} in their name",
    "uid": 31215,
    "subgraph": "string matching simple contains word",
    "template_index": 3863,
    "question": "What are the element of winged horse IAAF competition category which start with the letter pegasus",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P7069 wd:Q2537829 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'pegasus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which things belonging to winged horses IAAF competition category begin with the word \"pegasus\"?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2537829 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'pegasus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {edition} of {runtime} of {League of Legends} ?",
    "uid": 17774,
    "subgraph": "right-subgraph",
    "template_index": 846,
    "question": "What is edition runtime for League of Legends?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q223341 wdt:P400 ?X . ?X wdt:P747 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q223341> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P400>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P747> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the League of Legends runtime edition?",
    "answers": [
      "Windows 8",
      "Windows 7",
      "Windows Server 2012",
      "Windows Server 2008 R2",
      "Windows Vista",
      "Windows Server 2008",
      "Windows Server 2003",
      "Windows XP",
      "Windows RT",
      "Windows Mobile",
      "Pocket PC",
      "Windows Phone 8",
      "Windows 1.0",
      "Windows 95",
      "Windows Preinstallation Environment",
      "Windows XP Professional x64 Edition",
      "Windows 98",
      "Windows 2000",
      "Windows Me",
      "Windows 2.0",
      "Windows Embedded Compact",
      "Windows NT 4.0",
      "Windows 3.0",
      "Windows 3.1",
      "Windows Fundamentals for Legacy PCs",
      "Windows 3.x",
      "Windows NT 3.1",
      "Windows NT 3.5",
      "Windows NT 3.51",
      "Windows 96",
      "Windows Embedded Compact 7",
      "Windows Embedded CE 6.0",
      "Windows 2.1x",
      "Windows Embedded",
      "Windows MultiPoint Server",
      "Windows Small Business Server",
      "Windows Embedded Automotive",
      "Windows Phone 7.x",
      "Windows for Workgroups 3.11",
      "Windows CE 5.0",
      "Windows XP Media Center Edition",
      "Windows Embedded Industry",
      "Windows Server 2000",
      "Windows 8.1",
      "Windows 97",
      "Windows Mobile 6.0",
      "Windows Phone",
      "Windows XP 64-Bit Edition",
      "Windows Mobile 2003",
      "Windows Mobile 5.0"
    ]
  },
  {
    "NNQT_question": "What is {in work} and {followed by} of {Communist Party of China} has {chairperson} as {Hu Jintao}",
    "uid": 32053,
    "subgraph": [],
    "template_index": 1009,
    "question": "What are the beliefs of the Chinese Communist Party's Chair, Hu Jintao, and in which work is he present?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q17427 p:P488 ?s . ?s ps:P488 wd:Q15029 . ?s pq:P2553 ?value1 . ?s pq:P156 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the convictions of the Chinese Communist Party's Chair, Hu Jintao, and in which work is he present?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q17427 p:P488 ?s . ?s ps:P488 wd:Q15029 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {drug used for treatment} of {medical condition} of {Reese Hoffa} ?",
    "uid": 30595,
    "subgraph": "right-subgraph",
    "template_index": 469,
    "question": "What treatment is Reese Hoffa getting for his health issues?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1760 wdt:P1050 ?X . ?X wdt:P2176 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "How is Reese Hoffa treating his health issues?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q294531 wdt:P1050 ?X . ?X wdt:P2176 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {pharmaceutical product} for {regulated by} of {erythromycin}",
    "uid": 31805,
    "subgraph": "simple question right",
    "template_index": 498,
    "question": "What is the pharmaceutical product regulated by erythromycin?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q213511 wdt:P3719 ?obj . ?obj wdt:P31 wd:Q28885102 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is regulated by an erythromycin perscription?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q213511 wdt:P3780 ?obj . ?obj wdt:P31 wd:Q28885102 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {theatrical character} for {characters} of {Henry VI, Part 1}",
    "uid": 31818,
    "subgraph": "simple question right",
    "template_index": 1355,
    "question": "What is the name of the theatrical character of Henry VI, Part 1?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q643236 wdt:P674 ?obj . ?obj wdt:P31 wd:Q3375722 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the title of the showy character of Henry VI, Part 1?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q41567 wdt:P674 ?obj . ?obj wdt:P31 wd:Q3375722 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]