[
  {
    "NNQT_question": "Give me {history of a country or state} that starts with {'h'}",
    "uid": 24208,
    "subgraph": "string matching simple contains word",
    "template_index": 2729,
    "question": "Tell me the history of a country or state that starts with the letter h",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17544377 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q17544377>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Reveal  me the history of a country or state that starts with the letter h",
    "answers": [
      "history of France",
      "history of Canada",
      "history of Greenland",
      "history of Mongolia",
      "history of Chad",
      "history of Kosovo",
      "history of Pakistan",
      "history of Equatorial Guinea",
      "history of the United States from 1849 to 1865",
      "history of Sweden (800–1521)",
      "history of Mesopotamia",
      "history of the Ottoman Empire",
      "history of Namibia",
      "history of Bolivia",
      "history of Liberia",
      "history of China",
      "history of Spain",
      "history of Portugal",
      "history of Italy",
      "history of the United Kingdom",
      "history of Germany",
      "history of Tunisia",
      "history of Yemen",
      "history of Cyprus",
      "history of Rajasthan"
    ]
  },
  {
    "NNQT_question": "Give me {economic sector} that starts with {'s'}",
    "uid": 24207,
    "subgraph": "string matching simple contains word",
    "template_index": 2299,
    "question": "WHAT ARE ECONOMIC SECTOR WHICH START WITH THE LETTER N.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3958441 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3958441>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "WHAT ARE Financial Segment WHICH Begin WITH THE LETTER N.",
    "answers": [
      "service sector",
      "student housing"
    ]
  },
  {
    "NNQT_question": "What is {diplomatic relation} of {country of origin} of {Touhou Bougetsushou} ?",
    "uid": 30592,
    "subgraph": "right-subgraph",
    "template_index": 576,
    "question": "What is the origin of Touhou Bougetsushou's diplomatic relation?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q210779 wdt:P495 ?X . ?X wdt:P530 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What region did Touhou Bougetsushou's diplomatic relation first take place?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1834 wdt:P495 ?X . ?X wdt:P530 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {absolute magnitude} of {country of origin} of {The Star-Spangled Banner} ?",
    "uid": 30570,
    "subgraph": "right-subgraph",
    "template_index": 341,
    "question": "What is the absolute magnitude of star spangled banner country?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q44696 wdt:P495 ?X . ?X wdt:P1457 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the absolute magnitude of the star radiant standard country?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q44696 wdt:P495 ?X . ?X wdt:P150 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {flux} that contains the word {flux} in their name",
    "uid": 23978,
    "subgraph": "string matching simple contains word",
    "template_index": 3684,
    "question": "Tell me flux whose name has the word flux in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6485344 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'flux')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q6485344>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'flux')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know flux whose title has the word flux in it.",
    "answers": [
      "magnetic flux"
    ]
  },
  {
    "NNQT_question": "what is the {end time} for {Karl Dönitz} has {commander of} as {Kriegsmarine} ?",
    "uid": 7890,
    "subgraph": "statement_property",
    "template_index": 4335,
    "question": "What { end time } has { commander of } as { Kriegsmarine } for { Karl Dönitz }?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q76437 p:P598 ?s . ?s ps:P598 wd:Q151701 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q76437> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P598> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q151701> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What is Karl Donitz's end time?",
    "answers": [
      "1945-04-30T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is the {type of quantum particle} for {antiparticle} of {elementary fermion}",
    "uid": 31868,
    "subgraph": "simple question right",
    "template_index": 655,
    "question": "The antiparticle of an elementary fermion is what premium particle?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q52234516 wdt:P2152 ?obj . ?obj wdt:P31 wd:Q22675015 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What premium particle is the opposite of an elementary fermion",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q43116 wdt:P2152 ?obj . ?obj wdt:P31 wd:Q22675015 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {ranking} of {follows} of {All We Know} ?",
    "uid": 30658,
    "subgraph": "left-subgraph",
    "template_index": 22,
    "question": "What is the ranking of All We Know predecessor?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2315956 wdt:P155 ?X . ?X wdt:P1352 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the ranking of the predecessor of the song 'All We Know'?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q2315956 wdt:P155 ?X . ?X wdt:P86 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {manner of death} of {Abraham Lincoln} that is {notable work} is {John Wilkes Booth} ?",
    "uid": 31308,
    "subgraph": "statement_property",
    "template_index": 2796,
    "question": "What was the manner of death of Abraham Lincoln that was a notable work of John Wilkes Booth?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q91 p:P1196 ?s . ?s ps:P1196 ?obj . ?s pq:P800 wd:Q180914 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "How was Abraham Lincoln assassinated by the notable work of John Wilkes Booth?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q91 p:P1196 ?s . ?s ps:P1196 ?obj . ?s pq:P157 wd:Q180914 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {religious identity} for {said to be the same as} of {atheism}",
    "uid": 30334,
    "subgraph": "simple question left",
    "template_index": 1849,
    "question": "Which religious identity is said to be the same as atheism?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P460 wd:Q7066 . ?sbj wdt:P31 wd:Q4392985 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which religious identity is similar to atheism?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1557 wd:Q7066 . ?sbj wdt:P31 wd:Q4392985 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {medical condition treated} are for {Kitakyūshū} ?",
    "uid": 31676,
    "subgraph": "statement_property",
    "template_index": 345,
    "question": "How many medical conditions are treated by Kitakyūshū?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q188806 wdt:P2175 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What medical condition is treated using Kitakyūshū?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q210402 wdt:P2175 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {field of work} of {author} of {orthodontist} ?",
    "uid": 30515,
    "subgraph": "left-subgraph",
    "template_index": 40,
    "question": "Who are the writers of the orthodontist?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3842067 wdt:P50 ?X . ?X wdt:P101 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who are the scholars of orthodontist?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q21145331 wdt:P50 ?X . ?X wdt:P101 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {municipality of the Netherlands} that starts with {'z'}",
    "uid": 24551,
    "subgraph": "string matching simple contains word",
    "template_index": 3172,
    "question": "What are the municipality of the Netherlands  which start with the letter s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2039348 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2039348>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the region of the Netherlands which begin with the letter s",
    "answers": [
      "Zeist",
      "Zwijndrecht",
      "Zwollerkerspel",
      "Zwolle",
      "Zaamslag",
      "Zoetermeer",
      "Zundert",
      "Zuid-Beijerland",
      "Zijpe",
      "Zeevang",
      "Zaanstad",
      "Zandvoort",
      "Zuidplas",
      "Zeewolde",
      "Zederik",
      "Zevenhuizen-Moerkapelle",
      "Zevenhoven",
      "Zevenaar",
      "Zoeterwoude",
      "Zweeloo",
      "Zwartewaterland",
      "Zuidschalkwijk",
      "Zuidhorn",
      "Zouteveen",
      "Zesgehuchten"
    ]
  },
  {
    "NNQT_question": "What is {continent} of {place of death} of {Georgina Cassar} ?",
    "uid": 30600,
    "subgraph": "right-subgraph",
    "template_index": 1352,
    "question": "Which is {continent} of {death place} of {Georgina Cassar} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q839 wdt:P20 ?X . ?X wdt:P30 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "On which continent did Georgina Cassar die?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q438141 wdt:P20 ?X . ?X wdt:P30 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {subject has role} and the {physically interacts with} of {Dopamine} ?",
    "uid": 9635,
    "subgraph": "two intentions right subgraph",
    "template_index": 382,
    "question": "What {subject has role} which {physically interacts with} of {Dopamine} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q170304 wdt:P2868 ?ans_1 . wd:Q170304 wdt:P129 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q170304> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2868> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q170304> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P129> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Which subject physically interacts with Dopamine?",
    "answers": [
      "dopaminergics",
      "Dopamine receptor D4",
      "sympathomimetic drug",
      "Dopamine receptor D4",
      "dopamine agonist",
      "Dopamine receptor D4",
      "adrenergic agonist",
      "Dopamine receptor D4",
      "cardiotonic",
      "Dopamine receptor D4",
      "dopaminergics",
      "Dopamine receptor D2",
      "sympathomimetic drug",
      "Dopamine receptor D2",
      "dopamine agonist",
      "Dopamine receptor D2",
      "adrenergic agonist",
      "Dopamine receptor D2",
      "cardiotonic",
      "Dopamine receptor D2",
      "dopaminergics",
      "Dopamine receptor D1",
      "sympathomimetic drug",
      "Dopamine receptor D1",
      "dopamine agonist",
      "Dopamine receptor D1",
      "adrenergic agonist",
      "Dopamine receptor D1",
      "cardiotonic",
      "Dopamine receptor D1",
      "dopaminergics",
      "Dopamine receptor D3",
      "sympathomimetic drug",
      "Dopamine receptor D3",
      "dopamine agonist",
      "Dopamine receptor D3",
      "adrenergic agonist",
      "Dopamine receptor D3",
      "cardiotonic",
      "Dopamine receptor D3",
      "dopaminergics",
      "Dopamine receptor D5",
      "sympathomimetic drug",
      "Dopamine receptor D5",
      "dopamine agonist",
      "Dopamine receptor D5",
      "adrenergic agonist",
      "Dopamine receptor D5",
      "cardiotonic",
      "Dopamine receptor D5"
    ]
  },
  {
    "NNQT_question": "What is {discoverer or inventor} of {Horsehead Nebula}, that has {sex or gender} is {Dublin} ?",
    "uid": 30364,
    "subgraph": "right-subgraph",
    "template_index": 89,
    "question": "Name the Dublin who discovered the Horsehead Nebula.",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q14271 wdt:P61 ?answer . ?answer wdt:P21 wd:Q1761}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Title the Dublin who found the Horsehead Cloud.",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q14271 wdt:P61 ?answer . ?answer wdt:P21 wd:Q6581072}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {parish church} are to/by {Ōita Prefecture} ?",
    "uid": 31734,
    "subgraph": "statement_property",
    "template_index": 1526,
    "question": "how many are parish churches of Otia Prefecture?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P8289 wd:Q133924 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "What is the number of the Otia Prefecture's parish churches?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P126 wd:Q133924 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {head of government} of {work location} of {Walther Hewel} ?",
    "uid": 30703,
    "subgraph": "right-subgraph",
    "template_index": 2631,
    "question": "Who is the active mayor of Walther Hewel?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q60715 wdt:P937 ?X . ?X wdt:P6 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who is the dynamic leader of Walther Hewel?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q102585 wdt:P937 ?X . ?X wdt:P6 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {season} that contains the word {winter} in their name",
    "uid": 23252,
    "subgraph": "string matching simple contains word",
    "template_index": 3904,
    "question": "TELL ME SEASON WHOSE NAME HAS THE WORD WINTER IN IT.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24384 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'winter')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q24384>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'winter')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let Me know SEASON WHOSE Title HAS THE WORD WINTER IN IT.",
    "answers": [
      "Winter 2013-2014",
      "Winter in North America"
    ]
  },
  {
    "NNQT_question": "What is {appears in the form of} of {Kogepan}",
    "uid": 30911,
    "subgraph": "center",
    "template_index": 644,
    "question": "What does Kogepan appear in the form of?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1315950 wdt:P4675 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q6502703 wdt:P4675 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Class II combustible liquid} with the {MAX(median lethal concentration)} ?",
    "uid": 2532,
    "subgraph": "rank",
    "template_index": 108,
    "question": "Which Class II combustible liquid has the highest median lethal concentration?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q21009057 . ?ent wdt:P2712 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q21009057>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2712>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .}\nORDER BY DESC(?obj)\nLIMIT 5",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "What Class II flammable liquid has the greatest median dangerous concentration?",
    "answers": [
      "allyl glycidyl ether",
      "allyl glycidyl ether"
    ]
  },
  {
    "NNQT_question": "What is {population} of {Bermuda} that is {point in time} is {1988-0-0} ?",
    "uid": 9228,
    "subgraph": "statement_property",
    "template_index": 5673,
    "question": "What was the population of Bermuda on 0-0-1988?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q23635 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1988')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q23635> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1988-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was the population of Bermuda in 1988?",
    "answers": [
      "58347"
    ]
  },
  {
    "NNQT_question": "How many {platform} are for {Tomb Raider} ?",
    "uid": 1305,
    "subgraph": "statement_property",
    "template_index": 305,
    "question": "How many platforms does Tomb Raider have?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q270503 wdt:P400 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q270503> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P400> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "How many consoles can Tomb Raider be played on?",
    "answers": [
      "20"
    ]
  },
  {
    "NNQT_question": "What is {manager/director} of {Metropolitan Museum of Art} that is {start time} is {1910-0-0} ?",
    "uid": 6575,
    "subgraph": "statement_property",
    "template_index": 3020,
    "question": "Who was the manager/director of the Metropolitan Museum of Art starting in 1910?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q160236 p:P1037 ?s . ?s ps:P1037 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1910')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q160236> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1037> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1910-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Starting in 1910, who was the manager/director of the Metropolitan Museum of Art?",
    "answers": [
      "Edward Robinson"
    ]
  },
  {
    "NNQT_question": "What is {winner} of {nominated for} of {Joachim von Ribbentrop} ?",
    "uid": 30523,
    "subgraph": "left-subgraph",
    "template_index": 3160,
    "question": "Which reward was Joachim von Ribbentrop a nominee for?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q101886 wdt:P1411 ?X . ?X wdt:P1346 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which remunerate was Joachim von Ribbentrop to the point a candidate for?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q707986 wdt:P1411 ?X . ?X wdt:P1346 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {different from} {status} that starts with {'s'}",
    "uid": 31259,
    "subgraph": "string matching simple contains word",
    "template_index": 878,
    "question": "Tell me a object different from legal status that begins with the letter s.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P1889 wd:Q2628882 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Let me know a thing different from legitimate status that starts with the letter s.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2628882 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {protein} for {speed limit} of {oxytocin}",
    "uid": 30259,
    "subgraph": "simple question left",
    "template_index": 2133,
    "question": "Which protein is a speed limit of oxytocin?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P3086 wd:Q169960 . ?sbj wdt:P31 wd:Q8054 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which protein limits speed of oxytocin?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P129 wd:Q169960 . ?sbj wdt:P31 wd:Q8054 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {head of state} of {Kingdom of France}",
    "uid": 31820,
    "subgraph": "simple question right",
    "template_index": 258,
    "question": "Who is the Head of State  of the Kingdom of France?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q70972 wdt:P35 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the Kingdom of France's Head of State?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q131964 wdt:P35 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {ICTV virus ID} of {Philinidae}",
    "uid": 31016,
    "subgraph": "center",
    "template_index": 1715,
    "question": "What is ICTV virus ID of Philinidae?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q3199 wdt:P1076 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q250204 wdt:P1076 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {jury pool} that starts with {'z'}",
    "uid": 31182,
    "subgraph": "string matching simple contains word",
    "template_index": 3584,
    "question": "which jury pool name starts with z",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q104971887 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "which jury pool title begins with z",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43229 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {manner of death} and the {cause of death} of {Kate Warner} ?",
    "uid": 31979,
    "subgraph": "two intentions right subgraph",
    "template_index": 45,
    "question": "What was the {manner of death} and the {cause of death} of {Kate Warner} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q18571481 wdt:P1196 ?ans_1 . wd:Q18571481 wdt:P509 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "How and why did Kate Warner die?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q162005 wdt:P1196 ?ans_1 . wd:Q162005 wdt:P509 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]