[
  {
    "NNQT_question": "What is {population} of {Edessa} that is {point in time} is {2011-01-01} ?",
    "uid": 31338,
    "subgraph": "statement_property",
    "template_index": 1120,
    "question": "What was the population of Edessa in 2011?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1190403 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "How many people lived in Edessa in 2011?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q47916 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {discoverer or inventor} of {Dobsonian telescope}, that has {place of birth} is {Burbank} ?",
    "uid": 30462,
    "subgraph": "right-subgraph",
    "template_index": 73,
    "question": "Who is the inventor or discoverer of Dobsonian telescope, whose location of birth is Burbank?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1430326 wdt:P61 ?answer . ?answer wdt:P19 wd:Q39561}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the innovator or pioneer of Dobsonian telescope, whose area of birth is Burbank?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1430326 wdt:P61 ?answer . ?answer wdt:P19 wd:Q956}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {commanded by} of {Warsaw Pact} that is {start time} is {1967-4-12} ?",
    "uid": 9377,
    "subgraph": "statement_property",
    "template_index": 5822,
    "question": "What is governed by the Warsaw Pact effective from 12th March 1967?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q41644 p:P4791 ?s . ?s ps:P4791 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1967')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q41644> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P4791> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1967-4-12>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Effective as of the 12th of March, 1967, what does the Warsaw pact govern?",
    "answers": [
      "Ivan Ignatyevich Yakubovsky"
    ]
  },
  {
    "NNQT_question": "What is the {human} for {orbital inclination} of {Claude Shannon}",
    "uid": 30258,
    "subgraph": "simple question left",
    "template_index": 1799,
    "question": "What person is the orbital inclination of Claude Shannon?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2045 wd:Q92760 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the person that is the orbital inclination of Claude Shannon",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P184 wd:Q92760 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {part of} of {history of engineering}, that has {said to be the same as} is {technique} ?",
    "uid": 30476,
    "subgraph": "right-subgraph",
    "template_index": 14,
    "question": "What is part of the History of engineering, that has the same name as the technique?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q5867819 wdt:P361 ?answer . ?answer wdt:P460 wd:Q2695280}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is part of the History of building, that has the same title as the technique?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q5867819 wdt:P1269 ?answer . ?answer wdt:P460 wd:Q2695280}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {languages spoken, written or signed} of {creator} of {triathlon} ?",
    "uid": 30527,
    "subgraph": "right-subgraph",
    "template_index": 57,
    "question": "What language does the sculptor of triathlon write in?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q10980 wdt:P170 ?X . ?X wdt:P1412 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the language used for writing sculptor of triathlon?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q222419 wdt:P170 ?X . ?X wdt:P1412 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {subject has role} and the {location of discovery} of {niobium} ?",
    "uid": 31964,
    "subgraph": "two intentions right subgraph",
    "template_index": 531,
    "question": "Which the {subject has role} and the {location of discovery} of {niobium} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q1046 wdt:P2868 ?ans_1 . wd:Q1046 wdt:P189 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What does niobium do and where was it discovered?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q1103 wdt:P2868 ?ans_1 . wd:Q1103 wdt:P189 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {border} of {is in the parish of} of {Krukengrund} ?",
    "uid": 14543,
    "subgraph": "left-subgraph",
    "template_index": 10734,
    "question": "Which church is located in the parish border Krukengrund?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q32068316 wdt:P131 ?X . ?X wdt:P47 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q32068316> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P131>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P47> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which church is found within the ward border Krukengrund?",
    "answers": [
      "Wallonia",
      "Overijssel",
      "Gelderland",
      "Limburg",
      "Liège",
      "Lower Saxony",
      "Hesse",
      "Rhineland-Palatinate"
    ]
  },
  {
    "NNQT_question": "What is {award received} of {Mel Brooks} that is {end time} is {2003-01-01} ?",
    "uid": 31460,
    "subgraph": "statement_property",
    "template_index": 4047,
    "question": "What award did Mel Brooks receive until 2003?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q104266 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2003')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Until 2003, what award was presented to Mel Brooks?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q104266 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2003')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Encyclopædia Britannica Online ID} of {magnum}",
    "uid": 30994,
    "subgraph": "center",
    "template_index": 916,
    "question": "What is Encyclopædia Britannica Online ID for magnum ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q23502 wdt:P1417 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q11247037 wdt:P1417 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {inception} and {dissolved, abolished or demolished date} of {European Union} has {member of} as {European Community}",
    "uid": 32092,
    "subgraph": [],
    "template_index": 935,
    "question": "When was European Union dissolved, abolished or demolished as a member of the European Community?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q458 p:P463 ?s . ?s ps:P463 wd:Q260487 . ?s pq:P571 ?value1 . ?s pq:P576 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When used to be European Union dissolved, abolished or demolished as a member of the European Community?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q458 p:P155 ?s . ?s ps:P155 wd:Q260487 . ?s pq:P571 ?value1 . ?s pq:P576 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {start time} for {Athens} has {country} as {Greece} ?",
    "uid": 4693,
    "subgraph": "statement_property",
    "template_index": 1138,
    "question": "When was Athens, Greece founded?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q1524 p:P17 ?s . ?s ps:P17 wd:Q41 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1524> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P17> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q41> .\n?statement <http://www.wikidata.org/entity/P580> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "In what year was Athens, Greece founded?",
    "answers": [
      "1974-12-08T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {nominated for} of {The Broken Coin} that is {nominee} is {John Williams} ?",
    "uid": 31356,
    "subgraph": "statement_property",
    "template_index": 677,
    "question": "What award was John Williams nominated for in The Broken Coin?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q24732 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q131285 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "When John Williams was nominated for an award for the film The Broken Coin, which award was it?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q320588 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q131285 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {hill} with the {MAX(topographic isolation)} whose {quotation or excerpt} is {mountain range} ?",
    "uid": 31120,
    "subgraph": "rank",
    "template_index": 340,
    "question": "Give the name of the hill with the highest isolation whose quotation or excerpt is mountain range.",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P7081 wd:Q54050 . ?ent wdt:P2659 ?obj . ?ent wdt:P7081 wd:Q46831 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Which highly isolated hill has mountain range as quotation or excerpt?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q54050 . ?ent wdt:P2659 ?obj . ?ent wdt:P31 wd:Q46831 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {writer} of {collaborator on} of {Chris Odom} ?",
    "uid": 14305,
    "subgraph": "left-subgraph",
    "template_index": 13,
    "question": "Who are the writers and collaborators to Chris Odom?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q24898980 wdt:P3919 ?X . ?X wdt:P50 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q24898980> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3919>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P50> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who are the scholars and collaborators to Chris Odom?",
    "answers": [
      "Erik von Markovik",
      "Chris Odom"
    ]
  },
  {
    "NNQT_question": "What is the {inventory number} for {Leslie Lamport} has {employer} as {Microsoft Research} ?",
    "uid": 31643,
    "subgraph": "statement_property",
    "template_index": 932,
    "question": "What was the inventory number of Leslie Lamport as Microsoft Research employee?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q92613 p:P108 ?s . ?s ps:P108 wd:Q1144725 . ?s pq:P217 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was the inventory number assigned to Leslie Lamport's employment for Microsoft Research?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q92613 p:P108 ?s . ?s ps:P108 wd:Q1144725 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {student} of {François Laruelle}",
    "uid": 31874,
    "subgraph": "simple question right",
    "template_index": 921,
    "question": "Who was François Laruelle's student?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q852886 wdt:P802 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who was the student of François Laruelle?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q44272 wdt:P802 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {place of death} of {Scott Moir}",
    "uid": 31061,
    "subgraph": "center",
    "template_index": 3021,
    "question": "Which is the place of death of Scott Moir?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q440940 wdt:P20 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q440940 wdt:P4054 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {end time} for {KGB} has {chairperson} as {Alexander Shelepin} ?",
    "uid": 3724,
    "subgraph": "statement_property",
    "template_index": 169,
    "question": "When did Alexander Shelepin stop being chairperson for the KGB?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q80919 p:P488 ?s . ?s ps:P488 wd:Q533890 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q80919> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P488> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q533890> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "From when Alexander Shelepin was termiated from Chairperson of KGB?",
    "answers": [
      "1961-11-13T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {cardinality of this set} of {youth wing} of {complex logarithm} ?",
    "uid": 30548,
    "subgraph": "right-subgraph",
    "template_index": 35,
    "question": "What is the cardinality of the complex logarithm youth wing?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2520206 wdt:P4379 ?X . ?X wdt:P2820 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the cardinality of the complex logarithm youth wing?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q2520206 wdt:P1851 ?X . ?X wdt:P2820 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {stepparent} of {Don Honeyman}",
    "uid": 30806,
    "subgraph": "center",
    "template_index": 1522,
    "question": "Who is the stepparent of Don Honeyman?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P3448 wd:Q22959006}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P3448 wd:Q84233}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Invaluable.com person ID} of {Antonio Vivaldi}",
    "uid": 30996,
    "subgraph": "center",
    "template_index": 1924,
    "question": "What is Invaulable.com's artist ID for Antonio Vivaldi?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1340 wdt:P4927 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q159552 wdt:P4927 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {applies to part} for {Kolyma River} has {signum} as {161.364} ?",
    "uid": 31513,
    "subgraph": "statement_property",
    "template_index": 2372,
    "question": "What is at the Kolyma River at the signum 161.364?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q78879 p:P5438 ?s . ?s ps:P5438 ?x filter(contains(?x,'161.364')) . ?s pq:P518 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "I want to know what can be found at the Kolyma River at the 161.364 signum.",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q78879 p:P625 ?s . ?s ps:P625 ?x filter(contains(?x,'161.364')) . ?s pq:P518 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {earliest date} for {Manichaeism} has {located on terrain feature} as {Egypt} ?",
    "uid": 8186,
    "subgraph": "statement_property",
    "template_index": 4631,
    "question": "Since when was Manichaeism found in Egypt?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q131165 p:P706 ?s . ?s ps:P706 wd:Q202311 . ?s pq:P1319 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q131165> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P706> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q202311> .\n?statement <http://www.wikidata.org/entity/P1319> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Manichaeism was discovered in Egypt when?",
    "answers": [
      "0241-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "Give me {statement supported by} {intergovernmental organization} that starts with {'s'}",
    "uid": 31161,
    "subgraph": "string matching simple contains word",
    "template_index": 3478,
    "question": "Tell me the {statement supported by} {intergovernmental organization}  whose name  starts with s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P3680 wd:Q245065 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me whose name begins with s {statement supported by} { intergovernmental organization}.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q245065 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Japanese Baseball Hall of Fame ID} of {Antonio Vivaldi}",
    "uid": 30909,
    "subgraph": "center",
    "template_index": 3511,
    "question": "Which is Japanese Baseball Hall of Fame ID for Antonio Vivaldi?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1340 wdt:P4562 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q486690 wdt:P4562 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Agustín Gamarra} that {from narrative universe} {Marvel Universe} and which that starts with {'w'}",
    "uid": 31902,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3185,
    "question": "Give me a Agustín Gamarra from a fictional universe, such as Marvel comics that starts with a W.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q379638 . ?sbj wdt:P1080 wd:Q931597 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "Give me a Agustín Gamarra from a fictional universe, such as Marvel comics that starts with a W.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15773347 . ?sbj wdt:P1080 wd:Q931597 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {AlloCiné person ID} of {Mikhail Bulgakov}",
    "uid": 30936,
    "subgraph": "center",
    "template_index": 2447,
    "question": "Which is the AlloCiné person ID for Mikhail Bulgakov?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q835 wdt:P1266 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q156178 wdt:P1266 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {known for} of {scriptwriter} of {Barefoot Gen: Explosion of Tears} ?",
    "uid": 15514,
    "subgraph": "left-subgraph",
    "template_index": 7,
    "question": "Who is known for being the script writer of Barefoot Gen: Explosion of Tears?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q16164415 wdt:P58 ?X . ?X wdt:P800 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q16164415> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P58>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P800> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is known to be Barefoot Gen's script writer: Tears explosion?",
    "answers": [
      "Barefoot Gen"
    ]
  },
  {
    "NNQT_question": "What is {key incident} of {provenance} of {Glencore} ?",
    "uid": 16483,
    "subgraph": "right-subgraph",
    "template_index": 694,
    "question": "what is the key incident in the provenance of Glencore?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q169339 wdt:P127 ?X . ?X wdt:P793 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q169339> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P127>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P793> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "what is the key occurrence within the provenance of Glencore?",
    "answers": [
      "Silver tax 1816",
      "Paradise Papers"
    ]
  },
  {
    "NNQT_question": "What is {date depicted} of {Primavera}",
    "uid": 30964,
    "subgraph": "center",
    "template_index": 2583,
    "question": "Which is the date depicted for Primavera?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q549847 wdt:P2913 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q549847 wdt:P2242 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {sponsor} are for {Juventus F.C.} ?",
    "uid": 1590,
    "subgraph": "statement_property",
    "template_index": 590,
    "question": "How many sponsors are for Juventus F.C.?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q1422 wdt:P859 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1422> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P859> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Which is the number of sponsors that are for Juventus F.C.?",
    "answers": [
      "4"
    ]
  },
  {
    "NNQT_question": "What is {location of formation} of {owned by} of {CD-R} ?",
    "uid": 30697,
    "subgraph": "right-subgraph",
    "template_index": 143,
    "question": "Where did this CD-R come from and who owns it now?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q420778 wdt:P127 ?X . ?X wdt:P740 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Where and who owns this CD-R from now?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q5294 wdt:P127 ?X . ?X wdt:P740 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {field of work} of {developer} of {REBOL} ?",
    "uid": 30611,
    "subgraph": "right-subgraph",
    "template_index": 724,
    "question": "which is scientific area of developed by of REBOL?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1359171 wdt:P178 ?X . ?X wdt:P101 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "which is logical range of created by of REBOL?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q42478 wdt:P178 ?X . ?X wdt:P101 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is <IAT triathlete ID> of <Alistair Brownlee> ?",
    "uid": 26007,
    "subgraph": "center",
    "template_index": 304,
    "question": "Please tell me Alistair Brownlee's IAT triathlete ID.",
    "sparql_wikidata": "select distinct ?answer where { wd:Q716308 wdt:P2778 ?answer}",
    "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q716308> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2778> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "answers": [
      "48955AA3A1BF4F8F9E107927E9BB4298"
    ]
  },
  {
    "NNQT_question": "What is {area} of {place of death} of {Universal Media Disc} ?",
    "uid": 30684,
    "subgraph": "right-subgraph",
    "template_index": 1069,
    "question": "How much acreage is the death place of Brittany Bruner-Ringo?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q92780896 wdt:P20 ?X . ?X wdt:P2046 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "At the death place of Brittany Bruner-Ringo, how much acreage was there?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q536884 wdt:P20 ?X . ?X wdt:P2046 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]