[
  {
    "NNQT_question": "Give me {pepo} that contains the word {nut} in their name",
    "uid": 31188,
    "subgraph": "string matching simple contains word",
    "template_index": 1522,
    "question": "WHICH ARE THE PEPO THAT CONTAINS THE WORD NUT IN THEIR NAME",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3173962 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'nut')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "WHICH ARE THE PEPO THAT CONTAINS THE WORD NUT IN THEIR Title",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11009 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'nut')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {town of the United Kingdom} that starts with {'z'}",
    "uid": 31186,
    "subgraph": "string matching simple contains word",
    "template_index": 3172,
    "question": "What are the town of the United Kingdom which start with the letter s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q100503226 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the town of the United Kingdom which begin with the letter s",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2039348 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Caracas} has {head of government} as {Johanna Rolland} ?",
    "uid": 31541,
    "subgraph": "statement_property",
    "template_index": 4942,
    "question": "When did Caracas begin having Johanna Rolland as head of government?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q1533 p:P6 ?s . ?s ps:P6 wd:Q16037012 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Johanna Rolland become Mayor of Caracas?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q12191 p:P6 ?s . ?s ps:P6 wd:Q16037012 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {together with} for {Kid Cudi} has {phone number} as {Grammy Award for Best Rap/Sung Performance} ?",
    "uid": 31588,
    "subgraph": "statement_property",
    "template_index": 1660,
    "question": "Who did Kid Cudi have the Grammy Award for Best Rap/Sung Performance phone number with?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q299138 p:P1329 ?s . ?s ps:P1329 wd:Q1542172 . ?s pq:P1706 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Kid Cudi had the Grammy Award for Best Rap/Song Performance phone number with who?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q299138 p:P166 ?s . ?s ps:P166 wd:Q1542172 . ?s pq:P1706 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {hammam} for {name in kana} of {Suleiman the Magnificent}",
    "uid": 30302,
    "subgraph": "simple question left",
    "template_index": 1645,
    "question": "What hammam is the name in kana of Suleiman the Magnificent?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1814 wd:Q8474 . ?sbj wdt:P31 wd:Q28077 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What Turkish shower is the name in kana ofSuleiman the Magnificent?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P138 wd:Q8474 . ?sbj wdt:P31 wd:Q28077 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of political party} of {Thierry Henry} and {number of matches played/races/starts}",
    "uid": 32018,
    "subgraph": [],
    "template_index": 1278,
    "question": "To which political party does Thierry Henry belong to and how many matches has he played?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q45901 p:P102 ?s . ?s ps:P102 ?obj . ?s pq:P1350 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "With which political party was Thierry Henry a member and how many matches did he play?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q45901 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {place of marriage} for {Zelda Fitzgerald} has {father} as {F. Scott Fitzgerald} ?",
    "uid": 31652,
    "subgraph": "statement_property",
    "template_index": 2353,
    "question": "Where did Zelda Fitzgerald and her father F. Scott Fitzgerald marry?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q187324 p:P22 ?s . ?s ps:P22 wd:Q93354 . ?s pq:P2842 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was the location of Zelda Fitzgerald and her father F. Scott Fitzgerald's wedding?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q187324 p:P26 ?s . ?s ps:P26 wd:Q93354 . ?s pq:P2842 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {population} of {Taguig} that is {determination method} is {census} ?",
    "uid": 9357,
    "subgraph": "statement_property",
    "template_index": 5802,
    "question": "What method did the census use to determine the population of Taguig?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1643 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1643> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P459> <http://wikidata.dbpedia.org/resource/Q39825>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "wich method was used by the census to determine the population of Taguig?",
    "answers": [
      "73702",
      "804915",
      "381350",
      "6829",
      "8423",
      "21856",
      "613343",
      "134137",
      "12087",
      "266637",
      "467375",
      "644473",
      "55257",
      "15340"
    ]
  },
  {
    "NNQT_question": "Give me {autonomous region of the People's Republic of China} that starts with {'x'}",
    "uid": 24466,
    "subgraph": "string matching simple contains word",
    "template_index": 129,
    "question": "What are the autonomous region of the People's Republic of China which start with the letter X",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q57362 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'x')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q57362>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'x')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the independent locale of the People's Republic of China which begin with the letter X",
    "answers": [
      "Xinjiang"
    ]
  },
  {
    "NNQT_question": "What is {NLC authorities} of {Jean-Baptiste de Lamarck}",
    "uid": 31032,
    "subgraph": "center",
    "template_index": 3088,
    "question": "Which is the NLC authorities for Jean-Baptiste de Lamarck?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q82122 wdt:P1213 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q82122 wdt:P5370 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {said to be the same as} {economic sector} that contains the word {service} in their name",
    "uid": 31255,
    "subgraph": "string matching simple contains word",
    "template_index": 2048,
    "question": "Tell me thing similar to economic sector whose name has the word service in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P460 wd:Q3958441 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'service')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know element similar to financial division whose title has the word benefit in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3958441 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'service')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {country} of {Witten} that is {start time} is {1836-12-28} ?",
    "uid": 31415,
    "subgraph": "statement_property",
    "template_index": 4191,
    "question": "In what country was Witten founded on 12-28-1836?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q3764 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1836')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "On 12-28-1836, in what county was Witten founded?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q5112 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1836')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {significant event} of {Charles de Gaulle}, that has {discoverer or inventor} is {El Faro (periódico amarillista)} ?",
    "uid": 30404,
    "subgraph": "right-subgraph",
    "template_index": 1754,
    "question": "What is the fate of Charles de Gaulle, who was first described as El Faro?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2042 wdt:P793 ?answer . ?answer wdt:P61 wd:Q5351268}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the destiny of Charles de Gaulle, who was to begin with depicted as El Faro?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q456321 wdt:P793 ?answer . ?answer wdt:P61 wd:Q5351268}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {antiparticle} of {selectron}, that has {interaction} is {gravity} ?",
    "uid": 30466,
    "subgraph": "right-subgraph",
    "template_index": 31,
    "question": "What is the opposite of a selectron that is pulled by gravity?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1087203 wdt:P2152 ?answer . ?answer wdt:P517 wd:Q11412}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the inverse of a selectron that's pulled by gravity?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q3229 wdt:P2152 ?answer . ?answer wdt:P517 wd:Q11412}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {headquarters location} of {Honda} that is {postal code} is {107-8556} ?",
    "uid": 8128,
    "subgraph": "statement_property",
    "template_index": 4573,
    "question": "What is the location of the Honda headquarters with the postal code 107-8556?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q9584 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P281 ?x filter(contains(?x,'107-8556')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q9584> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P159> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P281> <107-8556>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Where is Honda headquarters with postal code 107-8556?",
    "answers": [
      "Minato-ku"
    ]
  },
  {
    "NNQT_question": "What is the {book} for {language of work or name} of {Gregor Strasser}",
    "uid": 30231,
    "subgraph": "simple question left",
    "template_index": 771,
    "question": "Name a book written in Gregor Strasser",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P407 wd:Q76638 . ?sbj wdt:P31 wd:Q571 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name a book written in Gregor Strasser",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P407 wd:Q143 . ?sbj wdt:P31 wd:Q571 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {dissertation submitted to} of {Gershom Carmichael}",
    "uid": 31012,
    "subgraph": "center",
    "template_index": 1695,
    "question": "What is dissertation submitted to for Gershom Carmichael ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1514998 wdt:P4101 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q10648 wdt:P4101 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {international organization} for {native language} of {World Bank}",
    "uid": 31808,
    "subgraph": "simple question right",
    "template_index": 2128,
    "question": "What is the international organization that is a native language of World Bank?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q7164 wdt:P103 ?obj . ?obj wdt:P31 wd:Q484652 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the universal organization native language of World Bank?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q7164 wdt:P355 ?obj . ?obj wdt:P31 wd:Q484652 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {carries} are to/by {road} ?",
    "uid": 2217,
    "subgraph": "statement_property",
    "template_index": 1561,
    "question": "How many carry things by road?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2505 wd:Q34442 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2505> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q34442 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Which is the number of the carry things by road?",
    "answers": [
      "150"
    ]
  },
  {
    "NNQT_question": "What is the {Gojong of the Korean Empire} with the {MIN(consumption rate per capita)} whose {has part} is {paraffin wax} ?",
    "uid": 31096,
    "subgraph": "rank",
    "template_index": 483,
    "question": "What is the Gojong of Korea with the lowest consumption rate per capita whose has part is paraffin wax?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q257425 . ?ent wdt:P2662 ?obj . ?ent wdt:P527 wd:Q177540. } ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "What Gojong of Korea that contains paraffin wax has the lowest usage per capita?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q2424752 . ?ent wdt:P2662 ?obj . ?ent wdt:P527 wd:Q177540. } ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {academic major} and {academic degree} of {John Updike} has {author} as {Harvard University}",
    "uid": 32075,
    "subgraph": [],
    "template_index": 792,
    "question": "Which is the academic major and the academic degree of John Updike who was author of the Harvard University?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q105756 p:P50 ?s . ?s ps:P50 wd:Q13371 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the academic major and degree of John Updike, author of the Harvard University?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q105756 p:P69 ?s . ?s ps:P69 wd:Q13371 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {BSD Portal athlete ID} of {Juan Antonio Rios}",
    "uid": 30997,
    "subgraph": "center",
    "template_index": 1020,
    "question": "Which is the BSD Portal athlete ID of Juan Antonio Rios?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q820 wdt:P4650 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q60711 wdt:P4650 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {number of points/goals/set scored} and {number of matches played} of {{Brian Clough} has {member of sports team} as {England national football team}}",
    "uid": 10286,
    "subgraph": [],
    "template_index": 138,
    "question": "Tell me the number of points and games played by Brian Clough, member of the English national football team.",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q207658 p:P54 ?s . ?s ps:P54 wd:Q47762 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }",
    "sparql_dbpedia18": "select distinct ?value1 ?value2 where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q207658> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P54> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q47762>. ?statement <http://www.wikidata.org/entity/P580> ?value1 . ?statement <http://www.wikidata.org/entity/P2842> ?value2 } ",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me how many points and games Brian Clough, an English national football team member, has played.",
    "answers": [
      "2",
      "0"
    ]
  },
  {
    "NNQT_question": "How many {located on street} are for {Paul Gascoigne} ?",
    "uid": 31680,
    "subgraph": "statement_property",
    "template_index": 173,
    "question": "Is Paul Gascoigne located on a street?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q13002 wdt:P669 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What street is Paul Gascoigne located in?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q13002 wdt:P54 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Great Aragonese Encyclopedia ID} of {Ali Abdullah Saleh}",
    "uid": 30844,
    "subgraph": "center",
    "template_index": 1237,
    "question": "Which is the Great Aragonese Encyclopedia ID for Ali Abdullah Saleh?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q483672 wdt:P1807 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q23485 wdt:P1807 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {detail map} of {Arctic} that is {media legend} is {topography of Europe} ?",
    "uid": 31414,
    "subgraph": "statement_property",
    "template_index": 45,
    "question": "Which is {detail map} of {Arctic} where {media legend} is {topography of Europe} ?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q25322 p:P1621 ?s . ?s ps:P1621 ?obj . ?s pq:P2096 ?x filter(contains(?x,'topography of Europe')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In the Arctic map where is media is legend is topography located in Europe",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q46 p:P1621 ?s . ?s ps:P1621 ?obj . ?s pq:P2096 ?x filter(contains(?x,'topography of Europe')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Commons category} for {Fernandel} has {place of burial} as {Abdul Majeed Didi} ?",
    "uid": 31479,
    "subgraph": "statement_property",
    "template_index": 1135,
    "question": "In what area is Fernandel buried at the Abdul Majeed Didi?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q129092 p:P119 ?s . ?s ps:P119 wd:Q4665517 . ?s pq:P373 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Where at Abdul Majeed Didi is Fernandel buried?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q129092 p:P119 ?s . ?s ps:P119 wd:Q1092107 . ?s pq:P373 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located in the administrative territorial entity} of {place of death} of {James, son of Alphaeus} ?",
    "uid": 30736,
    "subgraph": "right-subgraph",
    "template_index": 1311,
    "question": "What administrative territorial entity did James, son of Alphaeus die?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q44047 wdt:P20 ?X . ?X wdt:P131 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What administrative territorial entity did James, child of Alphaeus pass on?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q44047 wdt:P20 ?X . ?X wdt:P150 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {art genre} that {studied by} {ballet studies} and which contains the word {ballet} in their name",
    "uid": 25272,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1972,
    "question": "Name an art genre that contains the word \"ballet\" in its name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1792379 . ?sbj wdt:P2579 wd:Q4076591 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ballet')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1792379>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2579> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q4076591>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ballet')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Name an artwork style that incorporates the phrase \"ballet\" in its title",
    "answers": [
      "ballet"
    ]
  },
  {
    "NNQT_question": "Give me {Pavo} that starts with {'p'}",
    "uid": 24500,
    "subgraph": "string matching simple contains word",
    "template_index": 2256,
    "question": "Tell me a constellation that starts with {'p'}",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3917160 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3917160>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Let me know a group of stars that begins with {'p'}",
    "answers": [
      "peafowl"
    ]
  },
  {
    "NNQT_question": "What is the {start time} for {Republican Party} has {volume as quantity} as {Ronna Romney McDaniel} ?",
    "uid": 31510,
    "subgraph": "statement_property",
    "template_index": 2508,
    "question": "When did Ronna Romney McDaniel become volume as quantity of the Republican Party?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q29468 p:P2234 ?s . ?s ps:P2234 wd:Q27899325 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "In what year did the Republican Party deem its volume as quantity Ronna Romney McDaniel?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q29468 p:P488 ?s . ?s ps:P488 wd:Q27899325 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {language regulatory body} of {official language} of {Duchy of Brittany} ?",
    "uid": 30715,
    "subgraph": "right-subgraph",
    "template_index": 1105,
    "question": "Who is the regulatory body of the official language of the Duchy of Brittany?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q71747 wdt:P37 ?X . ?X wdt:P1018 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who is the official language regulatory body of the Duchy of Brittany?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q4948 wdt:P37 ?X . ?X wdt:P1018 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {field of this occupation} of {located in the administrative territorial entity} of {Markwayne Mullin} ?",
    "uid": 30667,
    "subgraph": "left-subgraph",
    "template_index": 25,
    "question": "Which role does Markwayne Mullin location in administrative territorial entity have?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3448772 wdt:P131 ?X . ?X wdt:P425 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which part does Markwayne Mullin location in administrative territorial entity have?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q3448772 wdt:P106 ?X . ?X wdt:P425 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {capital} that {twinned administrative body} {Groningen} and which contains the word {tallinn} in their name",
    "uid": 31929,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2525,
    "question": "What is the capital city twinned to Groningen that contains the word \"tallinn \" in its name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5119 . ?sbj wdt:P190 wd:Q749 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tallinn')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What is the capital sister to Groningen that contains the word 'tallinn'?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5119 . ?sbj wdt:P190 wd:Q1707 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tallinn')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]