[
  {
    "NNQT_question": "What is the {point in time} for {Saint-Étienne} has {twinned administrative body} as {Fez} ?",
    "uid": 31648,
    "subgraph": "statement_property",
    "template_index": 1251,
    "question": "On what point in time was Saint-Étienne twinned with Fes?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q42716 p:P190 ?s . ?s ps:P190 wd:Q80985 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "On what point in time did Saint-Étienne become coupled with Fes?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q42716 p:P190 ?s . ?s ps:P190 wd:Q80985 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {astronaut mission} are for {Virgil} ?",
    "uid": 31691,
    "subgraph": "statement_property",
    "template_index": 68,
    "question": "How many space missions did Virgil complete?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q1398 wdt:P450 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Virgil has done several flights How many?\n ",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q446720 wdt:P450 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {association football club} that starts with {'w'}",
    "uid": 24319,
    "subgraph": "string matching simple contains word",
    "template_index": 2469,
    "question": "WHICH IS THE ASSOCIATION OF FOOTCLUB THAT STARTS WITH W",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q476028 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q476028>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "NAME THE ASSOCIATION OF FOOTCLUB THAT STARTS WITH THE LETTER W",
    "answers": [
      "Wrexham A.F.C.",
      "Wycombe Wanderers F.C.",
      "Wellington Amateurs F.C.",
      "Walsall F.C.",
      "Whitby Town F.C.",
      "Worksop Town F.C.",
      "Witton Albion F.C.",
      "Wakefield F.C.",
      "West Didsbury & Chorlton A.F.C.",
      "Warrington Town F.C.",
      "West Bromwich Albion F.C.",
      "Watford F.C.",
      "Woking F.C.",
      "West Ham United F.C.",
      "Wigan Athletic F.C.",
      "Wolverhampton Wanderers F.C.",
      "Wimbledon F.C.",
      "Warriors FC",
      "Wealdstone F.C.",
      "Willem II",
      "Wanderers F.C.",
      "Wisłoka Dębica",
      "Western Union FC",
      "Wembley F.C.",
      "Wuppertaler SV"
    ]
  },
  {
    "NNQT_question": "What is {bite force quotient} of {Hereford}",
    "uid": 30962,
    "subgraph": "center",
    "template_index": 1484,
    "question": "Which is bite force quotient for Hereford?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q737173 wdt:P3485 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q737173 wdt:P3380 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Zuckerart} that contains the word {syrup} in their name",
    "uid": 23921,
    "subgraph": "string matching simple contains word",
    "template_index": 1005,
    "question": "WHICH IS THE ZUCKERART THAT CONTAINS WITH THE WORD SYRUP IN THER NAME",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q227790 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'syrup')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q227790>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'syrup')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "WHICH IS THE ZUCKERART THAT CONTAINS WITH THE WORD SYRUP IN THER NAME",
    "answers": [
      "glucose syrup",
      "inverted sugar syrup"
    ]
  },
  {
    "NNQT_question": "What is {Flanders Arts Institute person ID} of {Alicia de Larrocha}",
    "uid": 31049,
    "subgraph": "center",
    "template_index": 3098,
    "question": "Which is the Flanders Arts Institute person ID for Alicia de Larrocha?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q232255 wdt:P5068 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q232255 wdt:P2498 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Richard M. Karp} that is {end time} is {1985-01-01} ?",
    "uid": 31466,
    "subgraph": "statement_property",
    "template_index": 2488,
    "question": "What is award received of Richard M. Karp that is end time is 1985-1-1?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q92612 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1985')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which was the award received by Richard M. Karp until 1985?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q92612 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1985')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {participant} of {conflict} of {Iwaki} ?",
    "uid": 30524,
    "subgraph": "left-subgraph",
    "template_index": 3345,
    "question": "What agent had conflict with Iwaki, Fukushima?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q274384 wdt:P607 ?X . ?X wdt:P710 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What operator had strife with Iwaki, Fukushima?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q6693201 wdt:P607 ?X . ?X wdt:P710 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {taxon} with the {MAX(conferred by)} whose {taxon rank} is {genus} ?",
    "uid": 31107,
    "subgraph": "rank",
    "template_index": 356,
    "question": "What is the genus with the highest conferred by in the taxon rank?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P1027 ?obj . ?ent wdt:P105 wd:Q34740 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Name the genus with the highest conferred by in taxon rank.",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P5230 ?obj . ?ent wdt:P105 wd:Q34740 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {tertiary sector of the economy} that starts with {'s'}",
    "uid": 31224,
    "subgraph": "string matching simple contains word",
    "template_index": 2299,
    "question": "WHAT ARE TERTIARY SECTOR WHICH START WITH THE LETTER N.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55638 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "WHAT ARE Tertiary Segment WHICH Begin WITH THE LETTER N.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3958441 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {federal holidays in the United States} that starts with {'t'}",
    "uid": 24137,
    "subgraph": "string matching simple contains word",
    "template_index": 2424,
    "question": "what is federal holidays in the united states that starts with t",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5440534 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q5440534>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "what is government occasions within the joined together states that begins with t",
    "answers": [
      "Thanksgiving"
    ]
  },
  {
    "NNQT_question": "How many {composer} are to/by {John Carmack} ?",
    "uid": 31770,
    "subgraph": "statement_property",
    "template_index": 1210,
    "question": "How many composers work for John Carmack?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P86 wd:Q92605 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Which is the number of composers that work for John Carmack?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P943 wd:Q92605 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Microsoft MVP profile ID} of {Nevermind}, that has {inception} is {1991-01-01} ?",
    "uid": 30429,
    "subgraph": "right-subgraph",
    "template_index": 1152,
    "question": "Who is the Microsoft MVP profile ID for Nevermind, that was produced on 1991-0-0?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q17444 wdt:P9125 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1991'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the Microsoft MVP profile ID for Nevermind, that was once produced on 1991-0-0?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q17444 wdt:P1411 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1991'))}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {alternative comic} that starts with {'z'}",
    "uid": 31181,
    "subgraph": "string matching simple contains word",
    "template_index": 3680,
    "question": "What are the alternative comic which start with the letter z",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q438464 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the alternative comic starting with the letter z?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q838795 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {IHO Hydrographic Dictionary (S-32) Number} of {Mihira Bhoja}",
    "uid": 30824,
    "subgraph": "center",
    "template_index": 1789,
    "question": "What is  in the IHO Hydrographic Dictionary (S-32) Number of Mihira Bhoja ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1279558 wdt:P2480 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q39715 wdt:P2480 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {county seat for} of {died in} of {Innokenty Smoktunovsky} ?",
    "uid": 14574,
    "subgraph": "right-subgraph",
    "template_index": 1234,
    "question": "who county seat for  died in of Innokenty smoktunovsky ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q380250 wdt:P20 ?X . ?X wdt:P1376 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q380250> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1376> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who died in Innokenty smoktunovsky county seat?",
    "answers": [
      "Russia",
      "Moscow Oblast",
      "Central Federal District"
    ]
  },
  {
    "NNQT_question": "What is {country} of {Algeria} that is {statement is subject of} is {Algeria–Indonesia relations} ?",
    "uid": 31444,
    "subgraph": "statement_property",
    "template_index": 380,
    "question": "What is the country of Algeria subject to Algeria and Indonesia relations?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q262 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P805 wd:Q15948965 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Describe country of Algeria subject to Algeria and Indonesia relations.",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q262 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q15948965 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Kobe Bryant} that is {end time} is {2007-01-01} ?",
    "uid": 31449,
    "subgraph": "statement_property",
    "template_index": 3186,
    "question": "Which award was received by Kobe Bryant until 2007?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q25369 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2007')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which award did Kobe Bryant receive until 2007?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q25369 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {manner of death} and the {cause of death} of {Paul_Allen} ?",
    "uid": 9721,
    "subgraph": "two intentions right subgraph",
    "template_index": 45,
    "question": "What was the {manner of death} and the {cause of death} of {Paul_Allen} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q162005 wdt:P1196 ?ans_1 . wd:Q162005 wdt:P509 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q162005> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1196> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q162005> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P509> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "How and why did Paul Allen die?",
    "answers": [
      "natural causes",
      "non-Hodgkin lymphoma"
    ]
  },
  {
    "NNQT_question": "Give me {organization} that contains the word {zollkriminalamt} in their name",
    "uid": 23339,
    "subgraph": "string matching simple contains word",
    "template_index": 2519,
    "question": "Tell me organization whose name has the word  zollkriminalamt  in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43229 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zollkriminalamt')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q43229>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zollkriminalamt')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know organization whose title has the word zollkriminalamt in it.",
    "answers": [
      "Zollkriminalamt"
    ]
  },
  {
    "NNQT_question": "What is the {steam engine} for {discoverer or inventor} of {Arturo Alessandri}",
    "uid": 30281,
    "subgraph": "simple question left",
    "template_index": 514,
    "question": "What kind of steam engine was invented by Arturo Alessandri",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P61 wd:Q848 . ?sbj wdt:P31 wd:Q12760 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Arturo Alessandri invented what kind of steam engine?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P61 wd:Q9041 . ?sbj wdt:P31 wd:Q12760 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {academic area} of {works at} of {Viktor Bespalov} ?",
    "uid": 14881,
    "subgraph": "left-subgraph",
    "template_index": 43,
    "question": "What is the academic area of work of Viktor Bespalov?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q28792298 wdt:P108 ?X . ?X wdt:P101 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q28792298> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P108>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P101> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the scholarly region of work of Viktor Bespalov?",
    "answers": [
      "acoustics",
      "electronic engineering",
      "nonlinear optics"
    ]
  },
  {
    "NNQT_question": "What is the {association football tournament} with the {MIN(frequency of event)} whose {competition class} is {women's association football}  ?",
    "uid": 3197,
    "subgraph": "rank",
    "template_index": 419,
    "question": "Name the women's association football team who play the least in tournaments.",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q1478437 . ?ent wdt:P2257 ?obj . ?ent wdt:P2094 wd:Q606060. } ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q1478437>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2257>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2094> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q606060> .\n\n}\nORDER BY ASC(?obj1)\nLIMIT 5",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Who play the least in tournaments, is what women's association football team?",
    "answers": [
      "Cyprus Cup",
      "Lithuanian Women's Cup",
      "Svenska Supercupen",
      "ACC Women's Soccer Tournament"
    ]
  },
  {
    "NNQT_question": "What is {location} of {conflict} of {Triple Alliance} ?",
    "uid": 30693,
    "subgraph": "right-subgraph",
    "template_index": 52,
    "question": "What is the event location in action of the Triple Alliance?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q153867 wdt:P607 ?X . ?X wdt:P276 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the occasion area in activity of the Triple Alliance?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q215669 wdt:P607 ?X . ?X wdt:P276 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {history of topic} and the {significant person} of {Melbourne} ?",
    "uid": 31955,
    "subgraph": "two intentions right subgraph",
    "template_index": 141,
    "question": "Which {history of topic} and the {significant person} is {Melbourne} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q3141 wdt:P2184 ?ans_1 . wd:Q3141 wdt:P3342 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "{Melbourne} has a {history of topic} and {significant person}",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q3141 wdt:P2184 ?ans_1 . wd:Q3141 wdt:P2633 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {superhero} that contains the word {wolfsbane} in their name",
    "uid": 23440,
    "subgraph": "string matching simple contains word",
    "template_index": 3011,
    "question": "Tell me superhero that contains the word wolfsbane in their name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188784 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wolfsbane')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q188784>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wolfsbane')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know superhero that contains the word wolfsbane in their title",
    "answers": [
      "Wolfsbane"
    ]
  },
  {
    "NNQT_question": "What is the {Mohammad bin Salman} for {designed by} of {Dennis M. Ritchie}",
    "uid": 30232,
    "subgraph": "simple question left",
    "template_index": 979,
    "question": "Dennis M. Ritchie designed which Mohammed bin Salman?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P287 wd:Q45575 . ?sbj wdt:P31 wd:Q6892571 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Dennis M. Ritchie outlined which Mohammad bin Salman?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P287 wd:Q45575 . ?sbj wdt:P31 wd:Q28920117 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {student} are for {Claudius Popelin} ?",
    "uid": 31707,
    "subgraph": "statement_property",
    "template_index": 475,
    "question": "How many students does Claudius Popelin teach?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q1098330 wdt:P802 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Give me the number of students Claudius Popelin teaches.",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q83155 wdt:P802 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {programmer} are to/by {Yuji Naka} ?",
    "uid": 2250,
    "subgraph": "statement_property",
    "template_index": 1594,
    "question": "How many programmers does Yuji Naka have?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P943 wd:Q726119 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P943> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q726119 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Yuji Naka has what number of programmers?",
    "answers": [
      "8"
    ]
  },
  {
    "NNQT_question": "What is {approved by} of {Le Havre}",
    "uid": 30778,
    "subgraph": "center",
    "template_index": 3053,
    "question": "What does Le Havre approve?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P790 wd:Q42810}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P790 wd:Q8889}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {electric charge} of {Michael Collins}",
    "uid": 30832,
    "subgraph": "center",
    "template_index": 274,
    "question": "Which is the electric charge for Michael Collins?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q173196 wdt:P2200 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q216121 wdt:P2200 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Naamloze vennootschap} that contains the word {yandex} in their name",
    "uid": 31222,
    "subgraph": "string matching simple contains word",
    "template_index": 314,
    "question": "Tell me Naamloze vennootschap whose name has the word yandex in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1436139 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yandex')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know Naamloze vennootschap whose title has the word yandex in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q891723 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yandex')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]