[
  {
    "NNQT_question": "What is {place of death} of {David Alaba}, that has {Dewey Decimal Classification} is {2--43613} ?",
    "uid": 30457,
    "subgraph": "right-subgraph",
    "template_index": 420,
    "question": "Where did David Alaba die that has 2--43613 as Dewey Decimal Classification?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q31981 wdt:P20 ?answer . ?answer wdt:P1036 ?x FILTER(contains(?x,'2--43613'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Where did David Alaba die that has 2--43613 as Dewey Decimal Classification?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q78619 wdt:P20 ?answer . ?answer wdt:P1036 ?x FILTER(contains(?x,'2--43613'))}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {occupation} of {Allen Ginsberg}, that has {SSYK 2012 The Swedish Standard Classification of Occupations} is {theatre} ?",
    "uid": 30435,
    "subgraph": "right-subgraph",
    "template_index": 5393,
    "question": "In what theatrical SSYK 2012 The Swedish Standard Classification of Occupations was Allen Ginsberg employed?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q6711 wdt:P106 ?answer . ?answer wdt:P8654 wd:Q17172848}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "In what dramatic SSYK 2012 The Swedish Standard Classification of Occupations was Allen Ginsberg employed?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q6711 wdt:P106 ?answer . ?answer wdt:P425 wd:Q17172848}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {DDB ID} are for {icebreaker} ?",
    "uid": 31701,
    "subgraph": "statement_property",
    "template_index": 572,
    "question": "What's the icebreaker for the DDB ID?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q14978 wdt:P4948 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "For the DDB ID, what is the icebreaker?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q14978 wdt:P1225 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {IdRef ID} of {Hobart}",
    "uid": 31059,
    "subgraph": "center",
    "template_index": 3540,
    "question": "Which is IdRef ID for Hobart?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q40191 wdt:P269 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q40191 wdt:P4014 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {significant event} of {Gina Rinehart} that is {end time} is {1981-1-1} ?",
    "uid": 5315,
    "subgraph": "statement_property",
    "template_index": 1760,
    "question": "What was the significant event happend when Gina Rinehart was came to an end in 1981",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q242982 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1981')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q242982> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P793> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P582> <1981-1-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What historical event marked Gina Rinehart's death in 1981?",
    "answers": [
      "marriage"
    ]
  },
  {
    "NNQT_question": "What is {studied by} of {facet of} of {Fuenlabrada} ?",
    "uid": 30528,
    "subgraph": "right-subgraph",
    "template_index": 9,
    "question": "What domain has the aspect of Fuenlabrada?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q54902 wdt:P1269 ?X . ?X wdt:P2579 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which domain has the Fuenlabrada aspect?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q178149 wdt:P1269 ?X . ?X wdt:P2579 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located in the administrative territorial entity} of {Paroo River}, that has {contains administrative territorial entity} is {Sonam Gyatso} ?",
    "uid": 30362,
    "subgraph": "right-subgraph",
    "template_index": 2020,
    "question": "What is in the region of Paroo River, that contains Sonam Gyatso?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1628056 wdt:P131 ?answer . ?answer wdt:P150 wd:Q25256}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is within the locale of Paroo Stream, that contains Sonam Gyatso?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1628056 wdt:P131 ?answer . ?answer wdt:P150 wd:Q133642}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {place of birth} of {Mitchell Watt}, that has {postal code} is {E} ?",
    "uid": 30402,
    "subgraph": "right-subgraph",
    "template_index": 1503,
    "question": "Who is born at Mitchell Watt, which has a zip code of E?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1747 wdt:P19 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'E'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is born in Mitchell Watt with an E zip code?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q272533 wdt:P19 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'E'))}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Emmerson Mnangagwa} has {educated at} as {Rennes} ?",
    "uid": 31477,
    "subgraph": "statement_property",
    "template_index": 1972,
    "question": "When did Emmerson Mnangagwa begin going to the Rennes?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q510523 p:P69 ?s . ?s ps:P69 wd:Q647 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What year did Emmerson Mnangagwa start at the Rennes?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q510523 p:P69 ?s . ?s ps:P69 wd:Q2096836 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {writer} of {The Murder of Roger Ackroyd}, that has {active since} is {1920-0-0} ?",
    "uid": 13851,
    "subgraph": "right-subgraph",
    "template_index": 2217,
    "question": "Who is the writer of \"The Murder of Roger Ackroyd\", which has been active since 1920-0-0?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q224078 wdt:P50 ?answer . ?answer wdt:P2031 ?x FILTER(contains(YEAR(?x),'1920'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q224078> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P50>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2031> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <1920-0-0> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the writer of \"The Murder of Roger Ackroyd\", which has been energetic when you consider that 1920-0-0?",
    "answers": [
      "Agatha Christie"
    ]
  },
  {
    "NNQT_question": "What is the {sovereign state} for {authority} of {Emmanuel Macron}",
    "uid": 30295,
    "subgraph": "simple question left",
    "template_index": 555,
    "question": "Emmanuel Macron is the authority of which sovereign state?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P797 wd:Q3052772 . ?sbj wdt:P31 wd:Q3624078 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "The authority of which sovereign state is Emmanuel Macron?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P35 wd:Q3052772 . ?sbj wdt:P31 wd:Q3624078 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Hunterian transliteration} of {regulates} of {hsa-miR-5006-3p} ?",
    "uid": 30552,
    "subgraph": "left-subgraph",
    "template_index": 517,
    "question": "Who regulates the Hunterian transliteration of hsa-miR-5006-3p in molecular biology",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q27593301 wdt:P128 ?X . ?X wdt:P7605 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who regulates does hsa-miR-5006-3p Hunterian transliteration in molecular biology?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q27593301 wdt:P128 ?X . ?X wdt:P2293 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {position held} of {Louis X of France} that is {end time} is {1314-12-07} ?",
    "uid": 31453,
    "subgraph": "statement_property",
    "template_index": 3888,
    "question": "What position did Louis X of France hold until 11/29/1314?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q8384 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1314')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Until November 29 1314 what position did Louis X of France hold?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q8384 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1314')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Viktor Orbán} that contains the word {ürümqi} in their name",
    "uid": 31148,
    "subgraph": "string matching simple contains word",
    "template_index": 1834,
    "question": "What are the Viktor Orbán  which start with the letter ürümqi",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q57641 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ürümqi')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the Viktor Orbán which start with the letter ürümqi",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q748149 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ürümqi')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {honorific suffix} of {Arthur Griffith} that is {electoral district} is {East Cavan} ?",
    "uid": 31443,
    "subgraph": "statement_property",
    "template_index": 35,
    "question": "What honorific suffix did Arthur Griffith have in East Cavan?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q342765 p:P1035 ?s . ?s ps:P1035 ?obj . ?s pq:P768 wd:Q5328039 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which was the honorific suffix that Arthur Griffith had in East Cavan?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q342765 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 wd:Q5328039 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {twinned administrative body} of {Huechuraba}, that has {licence plate code} is {沪A} ?",
    "uid": 30416,
    "subgraph": "right-subgraph",
    "template_index": 795,
    "question": "What is the twin town of Huechuraba, with the license plate code 沪A?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q14433 wdt:P190 ?answer . ?answer wdt:P395 ?x FILTER(contains(?x,'沪A'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the twin town of Huechuraba, with the license plate code 沪A?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q37806 wdt:P190 ?answer . ?answer wdt:P395 ?x FILTER(contains(?x,'沪A'))}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {has kid} of {has brother} of {Frederick IV, Duke of Austria} ?",
    "uid": 15301,
    "subgraph": "left-subgraph",
    "template_index": 47,
    "question": "Did the brother of Frederick IV, Duke of Austria have any children?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q550692 wdt:P3373 ?X . ?X wdt:P40 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q550692> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3373>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P40> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Is it true that the brother of Frederick IV, Duke of Austria had children?",
    "answers": [
      "Margaret of Austria",
      "Catherine of Austria",
      "Albert VI, Archduke of Austria",
      "Frederick III, Holy Roman Emperor",
      "Alexander von Habsburg",
      "Rudolf von Habsburg",
      "Leopold von Habsburg",
      "Ernst II von Habsburg",
      "Anna von Habsburg"
    ]
  },
  {
    "NNQT_question": "What is the {Universiade sports} for {headquarters location} of {European Union}",
    "uid": 31788,
    "subgraph": "simple question right",
    "template_index": 3283,
    "question": "Which is the universiade sports that has the headquarters location of European Union?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q458 wdt:P159 ?obj . ?obj wdt:P31 wd:Q7894227 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name the Universiade sports located in the European Union.",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q458 wdt:P159 ?obj . ?obj wdt:P31 wd:Q493522 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {free or open-source video game} with the {MAX(maximum number of players)} ?",
    "uid": 31092,
    "subgraph": "rank",
    "template_index": 110,
    "question": "What is that has free video game as operating system and the highest amount of players?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P306 wd:Q21125433 . ?ent wdt:P1873 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "What is that has free video game as operating system and the most players?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q21125433 . ?ent wdt:P1873 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {enterprise} for {owned by} of {Uber Technology}",
    "uid": 31894,
    "subgraph": "simple question right",
    "template_index": 49,
    "question": "What is organisation owned by Uber",
    "sparql_wikidata": " select distinct ?obj where { wd:Q780442 wdt:P127 ?obj . ?obj wdt:P31 wd:Q6881511 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which organisation is owned by Uber?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q780442 wdt:P749 ?obj . ?obj wdt:P31 wd:Q6881511 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {agent} of {in conflict} of {Lowell English} ?",
    "uid": 16188,
    "subgraph": "left-subgraph",
    "template_index": 3345,
    "question": "What agent had conflict with Lowell English?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q6693201 wdt:P607 ?X . ?X wdt:P710 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q6693201> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P607>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P710> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What operator had strife with Lowell English?",
    "answers": [
      "Axis",
      "Allies of the Second World War",
      "Canada",
      "United States of America",
      "Belgium",
      "Luxembourg",
      "Greece",
      "Turkey",
      "Netherlands",
      "Ethiopia",
      "France",
      "United Kingdom",
      "People's Republic of China",
      "South Africa",
      "Australia",
      "North Korea",
      "New Zealand",
      "Colombia",
      "Thailand",
      "South Korea",
      "Philippines",
      "Soviet Union",
      "United States of America",
      "People's Republic of China",
      "Australia",
      "North Korea",
      "New Zealand",
      "Colombia",
      "Thailand",
      "South Korea",
      "Philippines",
      "North Vietnam",
      "National Front for the Liberation of South Vietnam",
      "South Vietnam",
      "Khmer Rouge",
      "GRUNK",
      "Pathet Lao",
      "Kingdom of Laos",
      "Khmer Republic",
      "Kingdom of Cambodia"
    ]
  },
  {
    "NNQT_question": "What is {born at} of {Charlotte Dujardin}, that has {zip code} is {E} ?",
    "uid": 12725,
    "subgraph": "right-subgraph",
    "template_index": 1503,
    "question": "Who is born at Charlotte Dujardin, which has a zip code of E?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q272533 wdt:P19 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'E'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q272533> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P281> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <E> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is born in Charlotte Dujardin with an E zip code?",
    "answers": [
      "London Borough of Enfield",
      "London Borough of Enfield"
    ]
  },
  {
    "NNQT_question": "What is {drainage basin} of {affiliation} of {Terje Langli} ?",
    "uid": 30573,
    "subgraph": "left-subgraph",
    "template_index": 5314,
    "question": "What is drainage basin for affiliated with Terje Langli ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q954719 wdt:P1416 ?X . ?X wdt:P4614 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is drainage basin out for partnered with Terje Langli ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q954719 wdt:P1416 ?X . ?X wdt:P452 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {present in work} of {depicts} of {Lady with an Ermine} ?",
    "uid": 30604,
    "subgraph": "left-subgraph",
    "template_index": 318,
    "question": "who  work of motif of Lady with an Ermine ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q474338 wdt:P180 ?X . ?X wdt:P1441 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "who work of theme of Lady with an Ermine ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q20354514 wdt:P180 ?X . ?X wdt:P1441 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {city} for {parallel street} of {Wales}",
    "uid": 31803,
    "subgraph": "simple question right",
    "template_index": 23,
    "question": "who  is the city for parallel street of wales?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q25 wdt:P8702 ?obj . ?obj wdt:P31 wd:Q515 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "who is the city for parallel street of wales?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q25 wdt:P36 ?obj . ?obj wdt:P31 wd:Q515 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {legal status} that starts with {'s'}",
    "uid": 24505,
    "subgraph": "string matching simple contains word",
    "template_index": 878,
    "question": "Tell me a legal status that begins with the letter s.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2628882 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2628882>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Let me know a legitimate status that starts with the letter s.",
    "answers": [
      "Status in Roman legal system"
    ]
  },
  {
    "NNQT_question": "what is the {point in time} for {Robert De Niro} has {residence} as {Marbletown} ?",
    "uid": 6819,
    "subgraph": "statement_property",
    "template_index": 3264,
    "question": "When did Robert De Niro reside in Marbletown?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q36949 p:P551 ?s . ?s ps:P551 wd:Q3708911 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q36949> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P551> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3708911> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Robert De Nirolive in Marbletown?",
    "answers": [
      "1997-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "How many {discoverer or inventor} are for {Halley's Comet} ?",
    "uid": 31717,
    "subgraph": "statement_property",
    "template_index": 61,
    "question": "How mant are Halley's Comet discoverers?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q23054 wdt:P61 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Halley's Comet was discovered by how many people?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q23054 wdt:P575 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Sebileau's muscle} that contains the word {thalamus} in their name",
    "uid": 31187,
    "subgraph": "string matching simple contains word",
    "template_index": 3407,
    "question": "Tell me the Sebileau's muscle that contains the word thalamus in their name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7442781 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'thalamus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know the Sebileau's muscle that contains the word thalamus in their name",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1620186 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'thalamus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {work location} of {Bob Weinstein}, that has {postal code} is {11100–11499} ?",
    "uid": 30485,
    "subgraph": "right-subgraph",
    "template_index": 2493,
    "question": "What is the location of work of Bob Weinstein, who has a PIN Code of 11100-11499?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q888311 wdt:P937 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'11100–11499'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the area of work of Sway Weinstein, who incorporates a Stick Code of 11100-11499?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q888311 wdt:P19 ?answer . ?answer wdt:P281 ?x FILTER(contains(?x,'11100–11499'))}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {input method} are for {Star Wars: Battlefront (2004 video game)} ?",
    "uid": 31692,
    "subgraph": "statement_property",
    "template_index": 439,
    "question": "How many input methods does Star Wars: Battlefront (2004 video game) possess?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q54859 wdt:P479 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "How many Star Wars: Battlefront (2004 video game) input methods are there?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q49740 wdt:P479 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {basic form of government} of {place of birth} of {Jerry Lucas} ?",
    "uid": 30635,
    "subgraph": "right-subgraph",
    "template_index": 1768,
    "question": "What basic form of government is Jerry Lucas?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q366505 wdt:P19 ?X . ?X wdt:P122 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What basic form of government is Jerry Lucas?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q366505 wdt:P27 ?X . ?X wdt:P122 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {country} for {unemployment rate} of {pound sterling}",
    "uid": 30294,
    "subgraph": "simple question left",
    "template_index": 1984,
    "question": "What country uses the sterling pound as its unemployment rate?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1198 wd:Q25224 . ?sbj wdt:P31 wd:Q6256 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What nation employments the sterling pound as its unemployment rate?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P38 wd:Q25224 . ?sbj wdt:P31 wd:Q6256 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]