[
  {
    "NNQT_question": "What is the {owner of} and the {member of} of {Barack Obama} ?",
    "uid": 31961,
    "subgraph": "two intentions right subgraph",
    "template_index": 85,
    "question": "What is the owner of and the member of of Barack Obama ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q76 wdt:P1830 ?ans_1 . wd:Q76 wdt:P463 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "what is the name of the owner of and the member of Barack Obama.",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q30487 wdt:P1830 ?ans_1 . wd:Q30487 wdt:P463 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {opposite of} and the {tributary orientation} of {Jewish people} ?",
    "uid": 31956,
    "subgraph": "two intentions right subgraph",
    "template_index": 70,
    "question": "What are Jews the opposite of and what is their tributary orientation?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q7325 wdt:P461 ?ans_1 . wd:Q7325 wdt:P3871 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What is the opposite of Jews, and what is their tributary orientation?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q7325 wdt:P461 ?ans_1 . wd:Q7325 wdt:P138 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {historical comics} that starts with {'n'}",
    "uid": 31229,
    "subgraph": "string matching simple contains word",
    "template_index": 843,
    "question": "WHAT ARE HISTORICAL COMICS WHICH START WITH THE LETTER N",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2882223 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "WHAT ARE HISTORICAL COMICS WHICH Begin WITH THE LETTER N",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20087698 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {diplomatic relation} of {basin countries} of {Lake Okeechobee} ?",
    "uid": 15632,
    "subgraph": "right-subgraph",
    "template_index": 4911,
    "question": "What is the diplomatic relations like in basin countries of Lake Okeechobee?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q202905 wdt:P205 ?X . ?X wdt:P530 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q202905> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P205>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P530> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "The basin countries of Lake Okeechobee has what diplomatic relations?",
    "answers": [
      "Canada",
      "Japan",
      "Norway",
      "Ireland",
      "Hungary",
      "Belgium",
      "Luxembourg",
      "Finland",
      "Sweden",
      "Denmark",
      "Poland",
      "Lithuania",
      "Italy",
      "Switzerland",
      "Greece",
      "Turkey",
      "Portugal",
      "Netherlands",
      "Uruguay",
      "Mexico",
      "Ethiopia",
      "Ghana",
      "France",
      "United Kingdom",
      "People's Republic of China",
      "Brazil",
      "Russia",
      "Germany",
      "Belarus",
      "Iceland",
      "Estonia",
      "Latvia",
      "Ukraine",
      "Czech Republic",
      "Slovakia",
      "Slovenia",
      "Moldova",
      "Romania",
      "North Macedonia",
      "Albania",
      "Croatia",
      "Bosnia and Herzegovina",
      "Azerbaijan",
      "Andorra",
      "Cyprus",
      "Georgia",
      "Kazakhstan",
      "Malta",
      "Monaco",
      "Montenegro"
    ]
  },
  {
    "NNQT_question": "What is the {Gorakhpur} for {student of} of {Ivan Pavlov}",
    "uid": 31777,
    "subgraph": "simple question right",
    "template_index": 491,
    "question": "Who is the Gorakhpur that was a student of Ivan Pavlov?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q42985 wdt:P1066 ?obj . ?obj wdt:P31 wd:Q5584396 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the Gorakhpur Ivan Pavlov's student?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q42985 wdt:P1066 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {present in work} of {present in work} of {Batman} ?",
    "uid": 30730,
    "subgraph": "right-subgraph",
    "template_index": 11437,
    "question": "What is present in work present in Batman ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2695156 wdt:P1441 ?X . ?X wdt:P1441 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "WHAT IS MENTIONED IN WORK PRESENT IN BATMAN?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q2695156 wdt:P1441 ?X . ?X wdt:P674 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {date of baptism in early childhood} of {Juan Antonio Rios}",
    "uid": 31010,
    "subgraph": "center",
    "template_index": 3138,
    "question": "Which is the date of baptism in early childhood of Juan Antonio Rios?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q820 wdt:P1636 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q297 wdt:P1636 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {country} {Wikimedia set index article} that contains the word {typhoon} in their name",
    "uid": 31216,
    "subgraph": "string matching simple contains word",
    "template_index": 33,
    "question": "What are the object from Wikimedia set index article which start with the letter typhoon",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P17 wd:Q15623926 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'typhoon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the element from Wikimedia set index article which start with the letter storm",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15623926 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'typhoon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {object has role} for {John Hope Franklin} has {member of} as {American Historical Association} ?",
    "uid": 31640,
    "subgraph": "statement_property",
    "template_index": 4713,
    "question": "John Hope Franklin was a member of the American Historical Association and the role of what object?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q1367397 p:P463 ?s . ?s ps:P463 wd:Q464915 . ?s pq:P3831 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What object has John Hope Franklin, member of the AHA, as role?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q1367397 p:P463 ?s . ?s ps:P463 wd:Q464915 . ?s pq:P2868 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nominated for} of {Carol Ann Duffy} that is {point in time} is {2011-0-0} ?",
    "uid": 4288,
    "subgraph": "statement_property",
    "template_index": 733,
    "question": "What was Carol Ann Duffy nominated for in 2011?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q237994 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q237994> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2011-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which Nominations did Carol Anne Duffy for in 2011",
    "answers": [
      "Carnegie Medal"
    ]
  },
  {
    "NNQT_question": "What is {present in work} of {inspired by} of {The Lion King} ?",
    "uid": 30753,
    "subgraph": "right-subgraph",
    "template_index": 9422,
    "question": "Which is the source of inspiration for what is present in The Lion King?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q36479 wdt:P941 ?X . ?X wdt:P1441 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is the source of motivation for what is present in The Lion King?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q36479 wdt:P941 ?X . ?X wdt:P674 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {wingspan} of {producer} of {My Blue Heaven} ?",
    "uid": 30566,
    "subgraph": "left-subgraph",
    "template_index": 207,
    "question": "which is wingspan of film producer of My Blue Heaven ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q733607 wdt:P162 ?X . ?X wdt:P2050 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "which is wingspan of film maker of My Blue Paradise ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q733607 wdt:P162 ?X . ?X wdt:P108 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {male given name} for {part of} of {Russian}",
    "uid": 30301,
    "subgraph": "simple question left",
    "template_index": 9,
    "question": "Which is the male given name for the part of in Russian?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P361 wd:Q7737 . ?sbj wdt:P31 wd:Q12308941 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Part of in Russian is what male given name?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P407 wd:Q7737 . ?sbj wdt:P31 wd:Q12308941 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {has brother} of {Nefertiti}, that has {daddy} is {Ay} ?",
    "uid": 12946,
    "subgraph": "right-subgraph",
    "template_index": 819,
    "question": "Who is the father of Nefertiti?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q40930 wdt:P3373 ?answer . ?answer wdt:P22 wd:Q146029}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q40930> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3373>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P22> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q146029> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the father of Nefertiti?",
    "answers": [
      "Mutnedjmet"
    ]
  },
  {
    "NNQT_question": "What is the {chemical compound} with the {MAX(fax number)} ?",
    "uid": 31077,
    "subgraph": "rank",
    "template_index": 212,
    "question": "Which chemical compound has the greatest fax number?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2900 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "Which chemical mixture has the greatest fax number?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2154 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {military pentathlon} for {headquarters location} of {Lyon}",
    "uid": 30241,
    "subgraph": "simple question left",
    "template_index": 3499,
    "question": "Name a military pentathlon whose heaquarters are located in Lyon",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P159 wd:Q456 . ?sbj wdt:P31 wd:Q1466233 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name a military pentathlon with headquarters in Lyon",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P159 wd:Q456 . ?sbj wdt:P31 wd:Q4830453 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {VAT-rate} of {Canada}",
    "uid": 30929,
    "subgraph": "center",
    "template_index": 2062,
    "question": "What is the VAT rate in Canada?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q16 wdt:P2855 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q28 wdt:P2855 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {owned by} of {drafted by} of {Milt Palacio} ?",
    "uid": 30760,
    "subgraph": "left-subgraph",
    "template_index": 330,
    "question": "who is owner of drafted by Milt Palacio ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2449958 wdt:P647 ?X . ?X wdt:P127 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "who is proprietor of drafted by Milt Palacio ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q2449958 wdt:P54 ?X . ?X wdt:P127 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {dissipation factor} of {alpha decay}",
    "uid": 30784,
    "subgraph": "center",
    "template_index": 2621,
    "question": "Which is the dissipation factor of alpha decay?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P5678 wd:Q179856}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P817 wd:Q179856}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {fantastique genre} that starts with {'s'}",
    "uid": 24275,
    "subgraph": "string matching simple contains word",
    "template_index": 1045,
    "question": "Tell me the name of a fantastique genre that starts with the letter s.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20076756 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q20076756>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Let me know the title of a fantastique sort that begins with the letter s.",
    "answers": [
      "speculative fiction video game",
      "science fiction literature",
      "science fiction action film",
      "sword and sorcery"
    ]
  },
  {
    "NNQT_question": "What is {route of administration} of {linguistic typology} of {cyclohexane} ?",
    "uid": 30563,
    "subgraph": "right-subgraph",
    "template_index": 61,
    "question": "Who gave the{route of administration} of {linguistic typology} of {cyclohexane} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q211433 wdt:P4132 ?X . ?X wdt:P636 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who gave the { administration route } of the { linguistic typology } consistency?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q211433 wdt:P1542 ?X . ?X wdt:P636 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Japanese} for {Wikimedia language code} of {Japanese}",
    "uid": 31838,
    "subgraph": "simple question right",
    "template_index": 153,
    "question": "Which is the Japanese Wikimedia language code for the Wikimedia language code of Japanese?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q5287 wdt:P424 ?obj . ?obj wdt:P31 wd:Q190502 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me the Japanese Wikimedia language code for Japanese.",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q5287 wdt:P282 ?obj . ?obj wdt:P31 wd:Q190502 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of sports team} of {Iker Casillas} that is {start time} is {1999-1-1} ?",
    "uid": 8544,
    "subgraph": "statement_property",
    "template_index": 4989,
    "question": "What is the member of a sports team of Iker Casillas that starts January 1st, 1991?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q11584 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1999')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q11584> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P54> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1999-1-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Who became a member of the sports team Iker Casillas on January 1st, 1991?",
    "answers": [
      "Real Madrid CF",
      "Real Madrid Cddastilla",
      "Spain national under-18 football team",
      "Spain national under-20 football team",
      "Real Madrid Cddastilla",
      "Spain national under-21 football team"
    ]
  },
  {
    "NNQT_question": "What is the {point in time} for {Cardinal Mazarin} has {position held} as {Bishop of Metz} ?",
    "uid": 31661,
    "subgraph": "statement_property",
    "template_index": 4211,
    "question": "At which point in time has Cardinal Mazarin been the Bishop of Metz",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q166056 p:P39 ?s . ?s ps:P39 wd:Q15729481 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was the point in time in which Cardinal Mazarin served as Bishop of Metz?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q166056 p:P39 ?s . ?s ps:P39 wd:Q15729481 . ?s pq:P582 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Wikimedia list article} for {Wikidata property example for properties} of {Autobahn in Germany}",
    "uid": 30303,
    "subgraph": "simple question left",
    "template_index": 1858,
    "question": "What Wikidata property example for properties is the wikipedia list article for Autobahns in Germany?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2271 wd:Q313301 . ?sbj wdt:P31 wd:Q13406463 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the What Wikidata property example for properties that is the wikipedia list article for Autobahns in Germany",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P360 wd:Q313301 . ?sbj wdt:P31 wd:Q13406463 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {native language} of {languages spoken, written or signed} of {Giovanni Battista Rubini} ?",
    "uid": 30762,
    "subgraph": "right-subgraph",
    "template_index": 1203,
    "question": "WHICH IS THE NATIVE LANGUAGE OF GIOVANNI BATTISTA RUBINI?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q941040 wdt:P1412 ?X . ?X wdt:P103 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the native language of Giovanni Battista Rubini.",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q941040 wdt:P1412 ?X . ?X wdt:P1705 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {pressure} and {temperature} of {water} has {phase point} as {Túpac Amara}",
    "uid": 32044,
    "subgraph": [],
    "template_index": 385,
    "question": "When will the pressure and temperature of water reach the Túpac Amaru stage?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q283 p:P873 ?s . ?s ps:P873 wd:Q296269 . ?s pq:P2077 ?value1 . ?s pq:P2076 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When does the temperature and pressure of water hit the Túpac Amaru stage?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q283 p:P873 ?s . ?s ps:P873 wd:Q106410 . ?s pq:P2077 ?value1 . ?s pq:P2076 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Pekalongan} with the {MAX(event interval)} ?",
    "uid": 31074,
    "subgraph": "rank",
    "template_index": 19,
    "question": "WHICH IS THE PEKALONGAN WITH THE MAXIMUM FREQUENCY OF EVENT",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q11026 . ?ent wdt:P2257 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "WHAT IS THE MAXIMUM FREQUENCY OF PEKALONGAN",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q1318941 . ?ent wdt:P2257 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Pedro Aguirre Cerda} that is {point in time} is {2011-04-12} ?",
    "uid": 31355,
    "subgraph": "statement_property",
    "template_index": 1132,
    "question": "What award was received by Pedro Aguirre Cerda on April 4, 2011?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q845 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was the award Pedro Aguirre Cerda received on April 4th 2011",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q317792 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {MSX} with the {MAX(clock speed)} whose {developer} is {Radofin}  ?",
    "uid": 3148,
    "subgraph": "rank",
    "template_index": 347,
    "question": "Which Radofin MSX has the fastest clock speed?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q853547 . ?ent wdt:P2149 ?obj . ?ent wdt:P178 wd:Q3928891 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q853547>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2149>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P178> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3928891> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Out of all the Radofin MSX, which has the overall fastest clock speed?",
    "answers": [
      "Dragon MSX"
    ]
  },
  {
    "NNQT_question": "What is the {point in time} for {Pedro I of Brazil} has {child} as {Pedro II of Brazil} ?",
    "uid": 31649,
    "subgraph": "statement_property",
    "template_index": 4709,
    "question": "On what point in time was Pedro I(who has a son, Pedro II of Brazil) born?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q156774 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What is the point in time of Pedro I (whose son is Pedro II of Brazil)?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q156774 . ?s pq:P569 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {sovereign state} for {participant} of {Iraq War}",
    "uid": 31863,
    "subgraph": "simple question right",
    "template_index": 3578,
    "question": "Which sovereign state participated in the Iraq War?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q545449 wdt:P710 ?obj . ?obj wdt:P31 wd:Q3624078 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What centralized indipendent nation participated in the Iraq Conflict?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q218678 wdt:P710 ?obj . ?obj wdt:P31 wd:Q3624078 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {flag image} of {alto saxophone}",
    "uid": 30947,
    "subgraph": "center",
    "template_index": 3398,
    "question": "What flag image does the alto saxophone have?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q445275 wdt:P41 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q445275 wdt:P2343 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {end cause} and {elected in} of {Greg Rutherford} has {position held} as {Member of the 12th Parliament of the United Kingdom}",
    "uid": 32068,
    "subgraph": [],
    "template_index": 145,
    "question": "When did Greg Rutherford, the Member of the 12th Parliament of the United Kingdom, end his position?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q1745 p:P39 ?s . ?s ps:P39 wd:Q41582548 . ?s pq:P1534 ?value1 . ?s pq:P2715 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When did Greg Rutherford of the United Kindom's 12th Paliment, leave his position?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q334239 p:P39 ?s . ?s ps:P39 wd:Q41582548 . ?s pq:P1534 ?value1 . ?s pq:P2715 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {father} of {Isaac}, that has {child} is {David Lynch} ?",
    "uid": 30408,
    "subgraph": "right-subgraph",
    "template_index": 1134,
    "question": "Which son of Isaac has a son named David Lynch?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q671872 wdt:P22 ?answer . ?answer wdt:P40 wd:Q2071}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which Isaac son has a David Lynch son?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q671872 wdt:P22 ?answer . ?answer wdt:P40 wd:Q369850}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]