[
  {
    "NNQT_question": "What is {Commons gallery} of {Sekondi-Takoradi}",
    "uid": 30853,
    "subgraph": "center",
    "template_index": 2606,
    "question": "Which is the Commons gallery for Sekondi-Takoradi?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q243293 wdt:P935 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q34013 wdt:P935 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {AFL Tables coach ID} of {François Villon}",
    "uid": 30908,
    "subgraph": "center",
    "template_index": 2008,
    "question": "Which is the AFL Tables coach ID for François Villon?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q849 wdt:P4885 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q3441366 wdt:P4885 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Ann Arbor} that starts with {'m'}",
    "uid": 31154,
    "subgraph": "string matching simple contains word",
    "template_index": 3322,
    "question": "What are the Ann Arbor which start with the letter m",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q485172 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the Ann Arbor that starts with the letter m.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1968435 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {borough of New York City} that {located in or next to body of water} {Upper New York Bay} and which that starts with {'m'}",
    "uid": 25525,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2548,
    "question": "Name a borough of New York City closed to water that starts with letter M",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q408804 . ?sbj wdt:P206 wd:Q1064776 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q408804>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P206> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1064776>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "Name a borough of New York City closed to water that starts offevolved with letter M",
    "answers": [
      "Manhattan"
    ]
  },
  {
    "NNQT_question": "What is {number of matches played/races/starts} and {series ordinal} of {Just Fontaine} has {member of sports team} as {OGC Nice}",
    "uid": 32054,
    "subgraph": [],
    "template_index": 675,
    "question": "How many games did Just Fontaine play for the O.G.C. Nice and what is their series ordinal?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q192749 p:P54 ?s . ?s ps:P54 wd:Q185163 . ?s pq:P1350 ?value1 . ?s pq:P1545 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When Just Fontaine played for the O.G.C. Nice, how many games did he participate in and what is the position in the corresponding Wikidata list?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q192749 p:P54 ?s . ?s ps:P54 wd:Q185163 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {office held by head of government} of {operator} of {Boomerang} ?",
    "uid": 30590,
    "subgraph": "right-subgraph",
    "template_index": 800,
    "question": "Which is {position of head of government} of {service operator} {Boomerang} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1116425 wdt:P137 ?X . ?X wdt:P1313 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "{Service Operator} {Boomerang} is what {position of head of government}?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q150609 wdt:P137 ?X . ?X wdt:P1313 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {mathematical formula} of {measure of} of {horsepower} ?",
    "uid": 17771,
    "subgraph": "right-subgraph",
    "template_index": 14,
    "question": "Which equation do I use to measure horsepower ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q160857 wdt:P111 ?X . ?X wdt:P2534 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q160857> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P111>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2534> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What equation should I use to measure horsepower?",
    "answers": [
      "math>"
    ]
  },
  {
    "NNQT_question": "Give me {investigated by} {phantom island} that starts with {'t'}",
    "uid": 31163,
    "subgraph": "string matching simple contains word",
    "template_index": 3464,
    "question": "What are the elements investigated by phantom island which start with the letter T",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P1840 wd:Q129264 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the element investigated by fantasy island that begins with the letter T",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q129264 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {measured physical quantity} of {millimetre}, that has {Freebase ID} is {L} ?",
    "uid": 30489,
    "subgraph": "right-subgraph",
    "template_index": 2,
    "question": "The measured physical quantity of a millimetre is represented by the symbol L. Which is it?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q174789 wdt:P111 ?answer . ?answer wdt:P646 ?x FILTER(contains(?x,'L'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "The symbol L represents the measured physical quantity of a millimetre. Which one is that?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q174789 wdt:P111 ?answer . ?answer wdt:P416 ?x FILTER(contains(?x,'L'))}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {foods traditionally associated} are for {Eros} ?",
    "uid": 31683,
    "subgraph": "statement_property",
    "template_index": 480,
    "question": "How many foods traditionally associated did Eros have?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q121973 wdt:P868 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Which is the number of foods traditionally associated that Eros had?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q121973 wdt:P25 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {field of view} of {KGB}",
    "uid": 30261,
    "subgraph": "simple question left",
    "template_index": 1898,
    "question": "Who is the person for the field of view of KGB?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P4036 wd:Q80919 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who is the individual for the field of view of KGB?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P241 wd:Q80919 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {official language} of {World Baseball Softball Confederation}, that has {subject item of this property} is {nominative–accusative language} ?",
    "uid": 30393,
    "subgraph": "right-subgraph",
    "template_index": 867,
    "question": "What is the language official of World Baseball Softball Confederation whose subject item is nominative–accusative language?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q11362472 wdt:P37 ?answer . ?answer wdt:P1629 wd:Q178435}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the dialect official of World Baseball Softball Confederation whose subject item is nominative–accusative language?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q11362472 wdt:P37 ?answer . ?answer wdt:P4132 wd:Q178435}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {source of material} of {Lan Xang}, that has {local dialing code} is {071} ?",
    "uid": 30436,
    "subgraph": "right-subgraph",
    "template_index": 9,
    "question": "Which source of material of Lan Xang has STD code of 071?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q853477 wdt:P2647 ?answer . ?answer wdt:P473 ?x FILTER(contains(?x,'071'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which Lan Xang source of material has STD code of 071?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q853477 wdt:P36 ?answer . ?answer wdt:P473 ?x FILTER(contains(?x,'071'))}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {central government debt as a percent of GDP} of {Nokia} that is {point in time} is {2012-12-31} ?",
    "uid": 31378,
    "subgraph": "statement_property",
    "template_index": 1187,
    "question": "On December 31, 2012, what were Nokia's central government debt as a percent of GDP?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1418 p:P1689 ?s . ?s ps:P1689 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2012')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Considering the date of December 31, 2012, what were Nokia's central government debt as a percent of GDP?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q1418 p:P2403 ?s . ?s ps:P2403 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2012')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {significant event} of {Laser Interferometer Gravitational Wave Observatory} that is {point in time} is {1994-01-01} ?",
    "uid": 31447,
    "subgraph": "statement_property",
    "template_index": 2141,
    "question": "What is the significant event held in the beginning of Laser Interferometer Gravitational-Wave Observatory in 1994",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q255371 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1994')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What happened in 1994 at the start of the Observatory?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q255371 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1994')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {plea} are to/by {Supreme Court of Canada} ?",
    "uid": 31749,
    "subgraph": "statement_property",
    "template_index": 1738,
    "question": "How many pleas are there in the Supreme Court of Canada?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1437 wd:Q196615 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "The Supreme Court of Canada has how many pleas?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P4884 wd:Q196615 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Pedro Aguirre Cerda} has {award received} as {American Book Awards} ?",
    "uid": 31628,
    "subgraph": "statement_property",
    "template_index": 5530,
    "question": "When was Pedro Aguirre Cerda granted the American Book Awards?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q845 p:P166 ?s . ?s ps:P166 wd:Q463606 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Pedro Aguirre Cerda recieve the American Book Award?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q431085 p:P166 ?s . ?s ps:P166 wd:Q463606 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nominated for} of {Carol Ann Duffy} that is {spacecraft docking/undocking date} is {2011-01-01} ?",
    "uid": 31389,
    "subgraph": "statement_property",
    "template_index": 733,
    "question": "What was Carol Ann Duffy nominated for in spacecraft docking/undocking date of 2011?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q237994 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P622 ?x filter(contains(YEAR(?x),'2011')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which Nominations did Carol Anne Duffy for in spacecraft docking/undocking date of 2011",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q237994 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {translated work} for {total assets} of {Othello}",
    "uid": 31809,
    "subgraph": "simple question right",
    "template_index": 3429,
    "question": "How many editions are Othello total assets?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q26833 wdt:P2403 ?obj . ?obj wdt:P31 wd:Q39811647 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "How numerous versions are Othello total assets?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q26833 wdt:P747 ?obj . ?obj wdt:P31 wd:Q39811647 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {replaced by} of {Mie Prefecture}, that has {contains administrative territorial entity} is {Funai district} ?",
    "uid": 30477,
    "subgraph": "right-subgraph",
    "template_index": 832,
    "question": "what has been replaced by Mie Prefecture, that has arrondissements in the Funai District ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q128196 wdt:P1366 ?answer . ?answer wdt:P150 wd:Q1078679}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "what has been replaced by Mie Prefecture, that has arrondissements in the Funai District ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q128196 wdt:P47 ?answer . ?answer wdt:P150 wd:Q1078679}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {position of head of government} of {service operator} of {MiG-21} ?",
    "uid": 15772,
    "subgraph": "right-subgraph",
    "template_index": 800,
    "question": "Which is {position of head of government} of {service operator} {MiG-21} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q150609 wdt:P137 ?X . ?X wdt:P1313 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q150609> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P137>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1313> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "{Service Operator} {MiG-21} is what {position of head of government}?",
    "answers": [
      "Premier of the State Council of the People's Republic of China",
      "Prime Minister of Russia",
      "Prime Minister of Albania",
      "Prime Minister of Azerbaijan",
      "Prime Minister of Algeria",
      "Prime minister of India",
      "Chief Executive Officer of Afghanistan",
      "President of Angola",
      "Chairman of the Council of Ministers of the USSR"
    ]
  },
  {
    "NNQT_question": "What is {career} of {Grigori Kozintsev}, that has {field of this career} is {screenwriting} ?",
    "uid": 13957,
    "subgraph": "right-subgraph",
    "template_index": 1422,
    "question": "What kind of career does Grigori Kozintsev have in the screenwriting field?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q553072 wdt:P106 ?answer . ?answer wdt:P425 wd:Q3429919}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q553072> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P425> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3429919> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What kind of career in the screenwriting field does Grigori Kozintsev have?",
    "answers": [
      "screenwriter"
    ]
  },
  {
    "NNQT_question": "What is {occupation} of {students count} of {Andreas Vesalius} ?",
    "uid": 30648,
    "subgraph": "right-subgraph",
    "template_index": 1439,
    "question": "What is students count Andreas Vesalius' career?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q170267 wdt:P2196 ?X . ?X wdt:P106 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who is the students count of Andreas Vesalius?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q170267 wdt:P1066 ?X . ?X wdt:P106 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {alphabet} of {language signed} of {Ōe no Yoshitoki} ?",
    "uid": 17184,
    "subgraph": "left-subgraph",
    "template_index": 33170,
    "question": "What is alphabet  language signed of  Ōe no Yoshitoki ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3594014 wdt:P1412 ?X . ?X wdt:P282 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q3594014> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1412>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P282> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Ōe no Yoshitoki signed what alphabet language?",
    "answers": [
      "hiragana",
      "kanji",
      "Katakana",
      "kana"
    ]
  },
  {
    "NNQT_question": "Give me {use} that starts with {'t'}",
    "uid": 24398,
    "subgraph": "string matching simple contains word",
    "template_index": 3015,
    "question": "tell me about use starts with t",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1724915 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1724915>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "let me know approximately utilize begins with t",
    "answers": [
      "tinder",
      "thickener",
      "Twitter usage"
    ]
  },
  {
    "NNQT_question": "What is {INSEE countries and foreign territories code} of {Otto Strasser}",
    "uid": 30833,
    "subgraph": "center",
    "template_index": 2238,
    "question": "What is the INSEE countries and foreign territories code for Otto Strasser?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q76640 wdt:P3422 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q974 wdt:P3422 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {substitute/deputy/replacement of office/officeholder} for {Julie Andrews} has {spouse} as {Tony Walton} ?",
    "uid": 31529,
    "subgraph": "statement_property",
    "template_index": 514,
    "question": "Who was Tony Walton officeholder replacement when he became the spouse of Julie Andrews?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q161819 p:P26 ?s . ?s ps:P26 wd:Q2803671 . ?s pq:P2098 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What person was the officeholder replacement of Tony Walton when he became the husband of Julie Andrews?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q161819 p:P26 ?s . ?s ps:P26 wd:Q2803671 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {time of the day} that contains the word {morning} in their name",
    "uid": 23551,
    "subgraph": "string matching simple contains word",
    "template_index": 183,
    "question": "which time of the day contains the word morning in their name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1260524 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'morning')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1260524>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'morning')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "which time of the day contains the word morning in their title",
    "answers": [
      "morning"
    ]
  },
  {
    "NNQT_question": "What is {twinned administrative body} of {Attnang-Puchheim} that is {start time} is {1990-01-01} ?",
    "uid": 31337,
    "subgraph": "statement_property",
    "template_index": 3243,
    "question": "What city became a twin city of Attnang-Puchheim in 1990?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q261216 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1990')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1990, what city became a twin city of Attnang-Puchheim?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q41753 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1990')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Sherlock} that is {judge} is {Andrew Scott} ?",
    "uid": 31388,
    "subgraph": "statement_property",
    "template_index": 4843,
    "question": "Which award was received by Andrew Scott and judged by Sherlock?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q192837 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1594 wd:Q507322 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Andrew scott received which award judged by Sherlock?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q192837 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 wd:Q507322 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {vehicles per thousand people} of {Oracle Corporation}",
    "uid": 30254,
    "subgraph": "simple question left",
    "template_index": 1512,
    "question": "Name a vehicle per thousand people of the Oracle Corporation",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P5167 wd:Q19900 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Title a vehicle per thousand people of the Prophet Enterprise",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P463 wd:Q19900 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {local dialing code} of {folio} of {The Dallas Morning News} ?",
    "uid": 30577,
    "subgraph": "right-subgraph",
    "template_index": 7227,
    "question": "What is the local dialling code of Dallas Morning News folio?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q889935 wdt:P7416 ?X . ?X wdt:P473 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the Dallas Morning News folio local dialing code?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q889935 wdt:P291 ?X . ?X wdt:P473 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {owner} of {The Kiss}, that has {member of} is {G20} ?",
    "uid": 12888,
    "subgraph": "right-subgraph",
    "template_index": 5339,
    "question": "whos is owner of the kiss that have members of is g20",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2418237 wdt:P127 ?answer . ?answer wdt:P463 wd:Q19771}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2418237> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P127>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P463> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q19771> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "whos is proprietor of the kiss that have individuals of is g20",
    "answers": [
      "France"
    ]
  }
]