[
  {
    "NNQT_question": "what is the {point in time} for {Vasily Chuikov} has {award received} as {Order of Lenin} ?",
    "uid": 7291,
    "subgraph": "statement_property",
    "template_index": 3736,
    "question": "When was Vasily Chuikov awarded the Order of Lenin?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q157594 p:P166 ?s . ?s ps:P166 wd:Q185493 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q157594> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q185493> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Vasily Chuikov win the Order of Lenin?",
    "answers": [
      "1943-10-26T00:00:00Z",
      "1975-02-11T00:00:00Z",
      "1960-02-11T00:00:00Z",
      "1950-02-11T00:00:00Z",
      "1944-03-19T00:00:00Z",
      "1980-02-11T00:00:00Z",
      "1970-02-12T00:00:00Z",
      "1978-02-21T00:00:00Z",
      "1945-02-21T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {nominated for} of {Cate Blanchett} that is {for work} is {Ptolemy XII Auletes} ?",
    "uid": 31275,
    "subgraph": "statement_property",
    "template_index": 5269,
    "question": "What was Cate Blanchett nominated for her work in Ptolemy XII Auletes?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q80966 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q39991 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was Cate blanchett work 'Ptolemy XII Auletes' nominated for",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q80966 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q816772 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {employer} of {Michelle Wolf}, that has {location of formation} is {Yokosuka} ?",
    "uid": 30361,
    "subgraph": "right-subgraph",
    "template_index": 843,
    "question": "Who are worked for Michelle Wolf and its source location of group/organisation is located in Yokosuka?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q23883085 wdt:P108 ?answer . ?answer wdt:P740 wd:Q200578}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who are labored for Michelle Wolf and its source place of group/organisation is placed in Yokosuka?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q23883085 wdt:P108 ?answer . ?answer wdt:P740 wd:Q60}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {author} of {Julius Caesar}, that has {sibling} is {John Shakespeare} ?",
    "uid": 30459,
    "subgraph": "right-subgraph",
    "template_index": 181,
    "question": "who is the writer of Julius Caesar who has a sister named John Shakespeare?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q215750 wdt:P50 ?answer . ?answer wdt:P3373 wd:Q719706}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "who is the author of Julius Caesar who includes a sister named John Shakespeare?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q215750 wdt:P50 ?answer . ?answer wdt:P3373 wd:Q6205446}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {measured physical quantity} {physical constant} that starts with {'w'}",
    "uid": 31252,
    "subgraph": "string matching simple contains word",
    "template_index": 673,
    "question": "What are the measured physical quantity of physical constant which start with the letter w",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P111 wd:Q173227 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the measured physical quantity of physical consistent which begin with the letter w",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q173227 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nominated for} of {Gene Wolfe} that is {point in time} is {1990-0-0} ?",
    "uid": 5199,
    "subgraph": "statement_property",
    "template_index": 1644,
    "question": "What was Gene Wolfe nominated for in 1990?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q361149 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1990')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q361149> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1990-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which award was Gene Wolfe nominated for in 1990?",
    "answers": [
      "World Fantasy Award for Best Novel",
      "Locus Award for Best Fantasy Novel"
    ]
  },
  {
    "NNQT_question": "What is the {university} for {employer} of {Charles Lewis Gazin}",
    "uid": 31861,
    "subgraph": "simple question right",
    "template_index": 3052,
    "question": "At which university does Charles Lewis Gazin work?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q37223 wdt:P108 ?obj . ?obj wdt:P31 wd:Q3918 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "At which college does Charles Lewis Gazin work?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q48983 wdt:P108 ?obj . ?obj wdt:P31 wd:Q3918 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {musical score by} of {Missa Solemnis}, that has {has mother} is {Maria Magdalena van Beethoven} ?",
    "uid": 12032,
    "subgraph": "right-subgraph",
    "template_index": 178,
    "question": "What is the musical score by Missa Solemnis that has mother Maria Magdalena van Beethoven?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q723790 wdt:P86 ?answer . ?answer wdt:P25 wd:Q14507972}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q723790> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P86>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P25> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q14507972> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the musical rating by means of Missa Solemnis that has mother Maria Magdalena van Beethoven?",
    "answers": [
      "Ludwig van Beethoven"
    ]
  },
  {
    "NNQT_question": "Give me {catalog} {audio and video interfaces and connectors} that contains the word {ypbpr} in their name",
    "uid": 31162,
    "subgraph": "string matching simple contains word",
    "template_index": 1618,
    "question": "tell me catalogs of audio and video interfaces and connectors are name has the word ypbpr in it",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P972 wd:Q1153429 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ypbpr')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "let me know catalogs of sound and video interfacing and connectors are title has the word ypbpr in it",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1153429 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ypbpr')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {chemical structure} are for {mineralocorticoids} ?",
    "uid": 31706,
    "subgraph": "statement_property",
    "template_index": 112,
    "question": "How much chemical structure are for mineralocorticoids?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q422519 wdt:P117 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What is the checmical structure ofr mineralocorticoids?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q169960 wdt:P117 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {using} of {sport played} of {World Rugby} ?",
    "uid": 14778,
    "subgraph": "right-subgraph",
    "template_index": 233,
    "question": "What is the use of playing World Rugby?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q369225 wdt:P641 ?X . ?X wdt:P2283 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q369225> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P641>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2283> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the utilize of playing World Rugby?",
    "answers": [
      "rugby union ball",
      "rugby union ball"
    ]
  },
  {
    "NNQT_question": "What is the {end time} for {Macrinus} has {work location} as {Netherlands} ?",
    "uid": 31561,
    "subgraph": "statement_property",
    "template_index": 3226,
    "question": "When Macrinus ended to work at Netherlands?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q1752 p:P937 ?s . ?s ps:P937 wd:Q55 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Macrinus end her work in the Netherlands?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q134741 p:P937 ?s . ?s ps:P937 wd:Q55 . ?s pq:P582 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {phantom island} that starts with {'t'}",
    "uid": 24358,
    "subgraph": "string matching simple contains word",
    "template_index": 3464,
    "question": "What are the phantom island which start with the letter T",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q129264 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q129264>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the fantasy island that begins with the letter T",
    "answers": [
      "Thule",
      "Thompson Island",
      "Tuanaki",
      "Terra Nova Islands"
    ]
  },
  {
    "NNQT_question": "What is the {pilgrimage} for {participant} of {Emmanuel Macron}",
    "uid": 30271,
    "subgraph": "simple question left",
    "template_index": 1840,
    "question": "Emmanuel Macron participated in which pilgrimage?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P710 wd:Q3052772 . ?sbj wdt:P31 wd:Q1644573 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "In which pilgrimage did Emmanuel Macron participate?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P710 wd:Q3052772 . ?sbj wdt:P31 wd:Q17561488 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {manner of death} and the {position played on team / speciality} of {Babe_Ruth} ?",
    "uid": 9833,
    "subgraph": "two intentions right subgraph",
    "template_index": 475,
    "question": "What is the {manner of death} and the {position played on team / speciality} by {Babe_Ruth} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q213812 wdt:P1196 ?ans_1 . wd:Q213812 wdt:P413 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q213812> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1196> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q213812> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P413> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What is the {way of passing} and the {position played on group / strength} by {Babe_Ruth} ?",
    "answers": [
      "natural causes",
      "left fielder"
    ]
  },
  {
    "NNQT_question": "What is {ranking} of {George Washington} that is {sport} is {tennis singles} ?",
    "uid": 31405,
    "subgraph": "statement_property",
    "template_index": 4327,
    "question": "What is the rank was held by George Washington as tennis singles?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q23 p:P1352 ?s . ?s ps:P1352 ?obj . ?s pq:P641 wd:Q18123880 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In tennis singles, what rank was held by George Washington?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q53393 p:P1352 ?s . ?s ps:P1352 ?obj . ?s pq:P641 wd:Q18123880 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {sex or gender} and the {country of citizenship} of {Rose Nadler} ?",
    "uid": 31960,
    "subgraph": "two intentions right subgraph",
    "template_index": 63,
    "question": "What is the sex and the country of citizenship of Rose Nadler?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q51344 wdt:P21 ?ans_1 . wd:Q51344 wdt:P27 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Name Rose Nadler's sex, besidex tell me her country of citizenship.",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q329466 wdt:P21 ?ans_1 . wd:Q329466 wdt:P27 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {represents} for {North Atlantic Treaty} has {signatory} as {Dean Acheson} ?",
    "uid": 4003,
    "subgraph": "statement_property",
    "template_index": 448,
    "question": "what is the {represents} for {North Atlantic Treaty} that has {signatory} as {Dean Acheson} ?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q877399 p:P1891 ?s . ?s ps:P1891 wd:Q214758 . ?s pq:P1268 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q877399> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1891> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q214758> .\n?statement <http://www.wikidata.org/entity/P1268> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "what signature represents Dean Acheson regarding the North Atlantic Treaty?",
    "answers": [
      "Federal Government of the United States of America"
    ]
  },
  {
    "NNQT_question": "What is the {type of quantum particle} for {subclass of} of {photon}",
    "uid": 30345,
    "subgraph": "simple question left",
    "template_index": 1445,
    "question": "What type of quantum particle is a sublcass of photon?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P279 wd:Q3198 . ?sbj wdt:P31 wd:Q22675015 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What kind of quantum molecule is a subclass of photon?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2152 wd:Q3198 . ?sbj wdt:P31 wd:Q22675015 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {candidate} of {University of Tehran}",
    "uid": 30867,
    "subgraph": "center",
    "template_index": 753,
    "question": "what is the candidate of  Univirsity of Tahran",
    "sparql_wikidata": "select distinct ?answer where { wd:Q737835 wdt:P726 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q737835 wdt:P4171 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {CEGEP} for {affiliation} of {Columbia University}",
    "uid": 30269,
    "subgraph": "simple question left",
    "template_index": 173,
    "question": "Which is the CEGEP that is affiliated with Columbia University?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1416 wd:Q49088 . ?sbj wdt:P31 wd:Q1110056 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the CEGEP affiliated with Columbia University",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1416 wd:Q49088 . ?sbj wdt:P31 wd:Q1377182 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {start time} for {Henry Steele Commager} has {educated at} as {University of Chicago} ?",
    "uid": 9423,
    "subgraph": "statement_property",
    "template_index": 5868,
    "question": "When did Henry Steele Commager receive his education from the University of Chicago ?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q3785004 p:P69 ?s . ?s ps:P69 wd:Q131252 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q3785004> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P69> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q131252> .\n?statement <http://www.wikidata.org/entity/P580> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Henry Steele Commager went to the University of Chicago when?",
    "answers": [
      "1925-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {discoverer or inventor} of {Robert Bellarmine}, that has {family name} is {Halley} ?",
    "uid": 30368,
    "subgraph": "right-subgraph",
    "template_index": 95,
    "question": "Who proved the theory of Robert Bellarmine? Their surname is Halley.",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q298664 wdt:P61 ?answer . ?answer wdt:P734 wd:Q16870415}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who proved Robert Bellarmine's theory? Halley is their surname.",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q193223 wdt:P61 ?answer . ?answer wdt:P734 wd:Q16870415}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {position held} of {Mahathir Mohamad} that is {point in time} is {2018-05-10} ?",
    "uid": 31445,
    "subgraph": "statement_property",
    "template_index": 1738,
    "question": "What position did Mahathir Mohamad hold in 2018-5-10?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q181383 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2018')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 2018-5-10, what position did Mahathir Mohamad hold?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q181383 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2018')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {classical language} that {has grammatical gender} {feminine} and which contains the word {ancient} in their name",
    "uid": 31933,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3301,
    "question": "Tell me the classical language that contains the word 'ancient' in its name and that has the grammatical feminine gender.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q949174 . ?sbj wdt:P5109 wd:Q1775415 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ancient')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Tell me the classical language that contains the phrase 'ancient' in its identify and that has the grammatical feminine gender.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2315359 . ?sbj wdt:P5109 wd:Q1775415 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ancient')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {occupation} and {field of work} of {Bram Stoker} has {employer} as {Sapporo}",
    "uid": 32048,
    "subgraph": [],
    "template_index": 1480,
    "question": "What is Bram Stoker's occupation and field of work and did he work in Sapporo?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q36184 p:P108 ?s . ?s ps:P108 wd:Q37951 . ?s pq:P106 ?value1 . ?s pq:P101 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is Bram Stoker's occupation and field of work and did he work in Sapporo?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q36184 p:P108 ?s . ?s ps:P108 wd:Q742767 . ?s pq:P106 ?value1 . ?s pq:P101 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {appointed by} of {Legationsrat}",
    "uid": 30934,
    "subgraph": "center",
    "template_index": 651,
    "question": "Who is appointed by the Legationsrat?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1491183 wdt:P748 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q81066 wdt:P748 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {work location} of {Ruth Bernhard} that is {end time} is {1953-1-1} ?",
    "uid": 6478,
    "subgraph": "statement_property",
    "template_index": 2923,
    "question": "Where Ruth Bernhard stoped working on 1953?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q2177580 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1953')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2177580> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P937> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P582> <1953-1-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What did Ruth Bernhard stop working on in 1953?",
    "answers": [
      "Los Angeles"
    ]
  },
  {
    "NNQT_question": "What is {commanded by} of {Triple Alliance} that is {start time} is {1967-04-12} ?",
    "uid": 31422,
    "subgraph": "statement_property",
    "template_index": 5822,
    "question": "What is governed by the Triple Alliance effective from 12th March 1967?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q3998983 p:P4791 ?s . ?s ps:P4791 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1967')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Effective as of the 12th of March, 1967, what does the Triple Alliance govern?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q41644 p:P4791 ?s . ?s ps:P4791 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1967')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {discoverer or inventor} of {political ideology} of {Social Democratic Party of Lithuania} ?",
    "uid": 30607,
    "subgraph": "left-subgraph",
    "template_index": 302,
    "question": "What is the first described of the ideology of Social Democratic Party of Lithuania?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q4362 wdt:P1142 ?X . ?X wdt:P61 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the primary depicted of the philosophy of Social Democratic Party of Lithuania?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q7248784 wdt:P1142 ?X . ?X wdt:P61 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {candidacy in election} of {Florentino Pérez} that is {start time} is {1982-01-01} ?",
    "uid": 31439,
    "subgraph": "statement_property",
    "template_index": 2173,
    "question": "Florentino Perez has what candidacy in election whose start time was 1982-0-0",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q245207 p:P3602 ?s . ?s ps:P3602 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1982')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What candidacy in election does Florentino Perez have since 1982?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q245207 p:P102 ?s . ?s ps:P102 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1982')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {brain region} that contains the word {thalamus} in their name",
    "uid": 23202,
    "subgraph": "string matching simple contains word",
    "template_index": 3407,
    "question": "Tell me the brain region that contains the word thalamus in their name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1620186 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'thalamus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1620186>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'thalamus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know the brain locale that contains the word thalamus in their name",
    "answers": [
      "thalamus",
      "Paraventricular nucleus of hypothalamus",
      "epithalamus",
      "subthalamus",
      "human thalamus",
      "lateral hypothalamus"
    ]
  }
]