[
  {
    "NNQT_question": "What is the {characteristic length} for {measured physical quantity} of {joule}",
    "uid": 31832,
    "subgraph": "simple question right",
    "template_index": 1024,
    "question": "Which is the characteristic length of the measured physical quantity of joule?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q25269 wdt:P111 ?obj . ?obj wdt:P31 wd:Q1062974 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the characteristic length of the quantity of joule measured physically?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q25269 wdt:P111 ?obj . ?obj wdt:P31 wd:Q900800 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {public holiday} that {official religion} {21 Tishrei} and which contains the word {sukkot} in their name",
    "uid": 31911,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3357,
    "question": "Which is the public holiday typical of the official religion of 21 Tishrei and containing the word sukkot in it's name?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1197685 . ?sbj wdt:P3075 wd:Q2912454 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'sukkot')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Which is the open occasion that's a day in year for official religion of 21 Tishrei and contains the word sukkot in it's name?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1197685 . ?sbj wdt:P837 wd:Q2912454 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'sukkot')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {biobased content weight percentage} of {product or material produced} of {textile art} ?",
    "uid": 30644,
    "subgraph": "right-subgraph",
    "template_index": 6,
    "question": "What is the biobased content weight percentage used by textile artists?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q10988986 wdt:P1056 ?X . ?X wdt:P6076 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Textile artists use what biobased content weight percentage?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q10988986 wdt:P1056 ?X . ?X wdt:P186 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {developer} are to/by {PlayStation} ?",
    "uid": 31753,
    "subgraph": "statement_property",
    "template_index": 1246,
    "question": "How does it developes in the {PlayStation} ?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P178 wd:Q10677 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "How does PlayStation do it's development?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P4043 wd:Q10677 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of sports team} of {Ranjitsinhji} that is {start time} is {1893-0-0} ?",
    "uid": 4958,
    "subgraph": "statement_property",
    "template_index": 1403,
    "question": "What member of the Ranjitsinhji sports team joined in 1893 ?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q2757835 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1893')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2757835> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P54> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1893-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "which member of sports joined Ranjitsinhji joined in 1893?",
    "answers": [
      "Cambridge University Cricket Club"
    ]
  },
  {
    "NNQT_question": "Give me {Greek deity} that {sibling} {Kadapa} and which contains the word {poseidon} in their name",
    "uid": 31904,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3714,
    "question": "Tell me the Greek deity of sibling of Kadapa and that contains the word poseidon in it's name?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22989102 . ?sbj wdt:P3373 wd:Q30651 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'poseidon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Let me know the Greek deity of kin of Kadapa which contains the word poseidon in it's name?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22989102 . ?sbj wdt:P3373 wd:Q34201 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'poseidon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {head of government} of {Islamic Republic of Qaim} that is {start time} is {2014-06-02} ?",
    "uid": 31335,
    "subgraph": "statement_property",
    "template_index": 3549,
    "question": "Who was the head of government in Islamic Republic of Qaim on June 2, 2014?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q21076535 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2014')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "On June 2, 2014 who was the leader of Islamic Republic of Qaim?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q219060 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2014')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {membership} of {member of party} of {Denis Sassou Nguesso} ?",
    "uid": 17510,
    "subgraph": "right-subgraph",
    "template_index": 55,
    "question": "Which is the membership as a member party of Denis Sassou Nguesso?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q57418 wdt:P102 ?X . ?X wdt:P2124 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q57418> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P102>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2124> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is the participation as a part party of Denis Sassou Nguesso",
    "answers": [
      "250000"
    ]
  },
  {
    "NNQT_question": "What is the {narrator} for {Po} has {coordinate location} as {12.5469} ?",
    "uid": 31515,
    "subgraph": "statement_property",
    "template_index": 3326,
    "question": "What is Po narrator into the location 12.5469?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q643 p:P625 ?s . ?s ps:P625 ?x filter(contains(?x,'12.5469')) . ?s pq:P2438 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "At location 12.5469, what is Po narrator?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q643 p:P625 ?s . ?s ps:P625 ?x filter(contains(?x,'12.5469')) . ?s pq:P518 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {genre} {feature film} that starts with {'t'}",
    "uid": 31243,
    "subgraph": "string matching simple contains word",
    "template_index": 2853,
    "question": "What are genre of feature film which start with the letter t",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P136 wd:Q24869 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are genre of include film which begin with the letter t",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24869 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {species kept} of {György Ligeti} that is {point in time} is {2000-01-01} ?",
    "uid": 31326,
    "subgraph": "statement_property",
    "template_index": 3957,
    "question": "What were the species kept by Gyorgy Ligeta in 2000-0-0?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q154331 p:P1990 ?s . ?s ps:P1990 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2000')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Gyorgy Ligeta kept what species in 2000?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q154331 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2000')) }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {coat of arms} of {Honda} that is {postal code} is {107-8556} ?",
    "uid": 31386,
    "subgraph": "statement_property",
    "template_index": 4573,
    "question": "What is the coat of arms of the Honda headquarters with the postal code 107-8556?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q9584 p:P237 ?s . ?s ps:P237 ?obj . ?s pq:P281 ?x filter(contains(?x,'107-8556')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What is the coat of arms of Honda headquarters with postal code 107-8556?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q9584 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P281 ?x filter(contains(?x,'107-8556')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {birth place} of {Gerard Reve}, that has {earliest record} is {1275-0-0} ?",
    "uid": 13096,
    "subgraph": "right-subgraph",
    "template_index": 2900,
    "question": "In the birth place of Gerard Reve, what is the earliest record of 1275-0-0?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q364153 wdt:P19 ?answer . ?answer wdt:P1249 ?x FILTER(contains(YEAR(?x),'1275'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q364153> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1249> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <1275-0-0> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "In the start region of Gerard Reve, what is the earliest document of 1275-0-0?",
    "answers": [
      "Amsterdam"
    ]
  },
  {
    "NNQT_question": "What is {relative} of {child} of {Sanada Nobumasa} ?",
    "uid": 30728,
    "subgraph": "left-subgraph",
    "template_index": 174,
    "question": "WHO IS SISTER OR BROTHER OF SANADA NOBUMASA'S CHILD?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q11583366 wdt:P40 ?X . ?X wdt:P1038 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "WHO IS SISTER OR BROTHER OF SANADA NOBUMASA'S CHILD?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q11583366 wdt:P3373 ?X . ?X wdt:P1038 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {origin of the watercourse} are to/by {Portable Document Format} ?",
    "uid": 31735,
    "subgraph": "statement_property",
    "template_index": 1452,
    "question": "How many origins of the watercourse are done on Portable Document Format?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P885 wd:Q42332 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "How many different origins of the watercourse are support by the Portable Document Format",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2701 wd:Q42332 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Theatricalia theatre ID} of {2011 Tōhoku earthquake and tsunami}",
    "uid": 30956,
    "subgraph": "center",
    "template_index": 2434,
    "question": "What is the Theatricalia theatre ID for the 2011 Tohoku Earthquake and tsunami?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q36204 wdt:P2468 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q36204 wdt:P5182 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {OmegaWiki Defined Meaning} of {cell signaling}",
    "uid": 31046,
    "subgraph": "center",
    "template_index": 3715,
    "question": "Which is the OmegaWiki Defined Meaning for cell signaling?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q210973 wdt:P1245 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q210973 wdt:P3471 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {enterprise} for {collection creator} of {Sears}",
    "uid": 31800,
    "subgraph": "simple question right",
    "template_index": 1823,
    "question": "Which is the enterprise for the collection creator of Sears?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q6499202 wdt:P6241 ?obj . ?obj wdt:P31 wd:Q6881511 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which is the endeavor for the collection creator of Burns?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q6499202 wdt:P749 ?obj . ?obj wdt:P31 wd:Q6881511 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {instrumentalist playing this instrument} that contains the word {van} in their name",
    "uid": 31189,
    "subgraph": "string matching simple contains word",
    "template_index": 1974,
    "question": "What are the instrumentalists playing this instrument which start with the letter van",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q66712069 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'van')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the musicians playing this instrument which begin with the letter van",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15729598 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'van')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {has states} of {deathplace} of {Pyotr Zakharov-Chechenets} ?",
    "uid": 15034,
    "subgraph": "right-subgraph",
    "template_index": 92,
    "question": "Who gave the  {has states} of {deathplace} of {Pyotr Zakharov-Chechenets} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2366448 wdt:P20 ?X . ?X wdt:P150 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2366448> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P150> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Pyotr Zakharov-Chechenet's deathplace was authorized by who?",
    "answers": [
      "South-Eastern Administrative Okrug",
      "Konkovo District",
      "Kuntsevo District",
      "Central Administrative Okrug",
      "Troitsk",
      "Shcherbinka",
      "Zelenogradsky Administrative Okrug",
      "Eastern Administrative Okrug",
      "Beskudnikovsky District",
      "Northern Administrative Okrug",
      "North-Eastern Administrative Okrug",
      "Southern Administrative Okrug",
      "South-Western Administrative Okrug",
      "Western Administrative Okrug",
      "North-Western Administrative Okrug",
      "Novomoskovsky Administrative Okrug",
      "Troitsky Administrative Okrug",
      "Moskovsky Settlement",
      "Krylatskoye District",
      "Solntsevo District",
      "Tsaritsyno District",
      "Vykhino-Zhulebino District",
      "Kryukovo District",
      "Shchukino District",
      "Arbat District",
      "Khoroshevo-Mnevniki District",
      "Izmaylovo District",
      "Kurkino District",
      "Severny District, Moscow",
      "Preobrazhenskoye District",
      "Vnukovo District",
      "Khamovniki District",
      "Zamoskvorechye District",
      "Tagansky District",
      "Vostochnoye Izmaylovo District",
      "Filyovsky park District",
      "Golovinsky District",
      "Veshnyaki District",
      "Cheryomushki District",
      "Lefortovo District",
      "Basmanny District",
      "Sokolniki District",
      "Maryino District",
      "Orekhovo-Borisovo Severnoye District",
      "Gagarinsky District",
      "Chertanovo Severnoye District",
      "Chertanovo Tsentralnoye District",
      "Prospekt Vernadskogo District",
      "Obruchevsky District",
      "Biryulyovo Zapadnoye District"
    ]
  },
  {
    "NNQT_question": "What is {acreage} of {deathplace} of {Saul Bass} ?",
    "uid": 15887,
    "subgraph": "right-subgraph",
    "template_index": 1069,
    "question": "How much acreage is the death place of Saul Bass?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q536884 wdt:P20 ?X . ?X wdt:P2046 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q536884> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2046> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "At the death place of Saul Bass, how much acreage was there?",
    "answers": [
      "1.65"
    ]
  },
  {
    "NNQT_question": "What is {BDCYL authority ID} of {Mikhail Bulgakov}",
    "uid": 31001,
    "subgraph": "center",
    "template_index": 3891,
    "question": "Which is the BDCYL authority ID for Mikhail Bulgakov?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q835 wdt:P3964 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q127349 wdt:P3964 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {influenced by} {Greco-Roman mysteries} that starts with {'m'}",
    "uid": 31245,
    "subgraph": "string matching simple contains word",
    "template_index": 3829,
    "question": "What are the element influenced by Greco-Roman mysteries which start with the letter M",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P737 wd:Q505821 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the object influenced by Greco-Roman secrets which begin with the letter M",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q505821 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {product or material produced} of {Kyōto Prefecture}",
    "uid": 30876,
    "subgraph": "center",
    "template_index": 936,
    "question": "Which is the product or material produced by Kyōto Prefecture?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q120730 wdt:P1056 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q120730 wdt:P429 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Alec Guinness} has {nominated for} as {Academy Award for Technical Achievement} ?",
    "uid": 31553,
    "subgraph": "statement_property",
    "template_index": 483,
    "question": "When Alec Guinness was nominated as Academy Award for Technical Achievement?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q103894 p:P1411 ?s . ?s ps:P1411 wd:Q8636 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "In what year did Alex Guinness receive an Academy Award for Technical Achievement nomination?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q103894 p:P1411 ?s . ?s ps:P1411 wd:Q103916 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {solvent} with the {MIN(refractive index)} whose {has part} is {carbon} ?",
    "uid": 31126,
    "subgraph": "rank",
    "template_index": 542,
    "question": "What solvent that's part carbon has the lowest refractive index?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q146505 . ?ent wdt:P1109 ?obj . ?ent wdt:P527 wd:Q623} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Which carbon solvent has the lowest refractive index?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q902638 . ?ent wdt:P1109 ?obj . ?ent wdt:P527 wd:Q623} ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {grinder model} with the {MIN(sound power level)} whose {subclass of} is {Tyumen} ?",
    "uid": 31101,
    "subgraph": "rank",
    "template_index": 649,
    "question": "What is the grinder model with the lowest sound power level whose subclass of is Tyumen?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q23811263 . ?ent wdt:P2797 ?obj . ?ent wdt:P279 wd:Q5815} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "In the subclass of Tyumen, which grinder model has the quietest power level?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q23811263 . ?ent wdt:P2797 ?obj . ?ent wdt:P279 wd:Q245761} ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {has proponent} of {subject of the statement} of {language change} ?",
    "uid": 16585,
    "subgraph": "right-subgraph",
    "template_index": 21,
    "question": "What drives the subject of the language change statement",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q524648 wdt:P805 ?X . ?X wdt:P3095 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q524648> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P805>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3095> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What drives the subject of the dialect alter statement",
    "answers": [
      "sociolinguist",
      "historical linguist"
    ]
  },
  {
    "NNQT_question": "What is {Todotango.com work ID} of {Hades}",
    "uid": 30972,
    "subgraph": "center",
    "template_index": 2429,
    "question": "Which is the Todotango.com work ID of Hades?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q41410 wdt:P4932 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q41410 wdt:P2272 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {SSYK 2012 The Swedish Standard Classification of Occupations} of {occupation} of {Fernand Maillaud} ?",
    "uid": 30642,
    "subgraph": "left-subgraph",
    "template_index": 266,
    "question": "What SSYK 2012 The Swedish Standard Classification of Occupations does Fernand Maillaud work in?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3069252 wdt:P106 ?X . ?X wdt:P8654 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What SSYK 2012 The Swedish Standard Classification of Occupations does Fernand Maillaud work in?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q3069252 wdt:P106 ?X . ?X wdt:P425 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {employer} of {director / manager} of {École normale supérieure de Rennes} ?",
    "uid": 30617,
    "subgraph": "left-subgraph",
    "template_index": 6,
    "question": "Who worked as the manager/director of École Normale Supérieure de Rennes?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2852691 wdt:P1037 ?X . ?X wdt:P108 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Give me the name of the manager/director of École Normale Supérieure de Rennes?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q83259 wdt:P1037 ?X . ?X wdt:P108 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {sport} of {Francis}",
    "uid": 31037,
    "subgraph": "center",
    "template_index": 2107,
    "question": "What is Francis's sport?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q450675 wdt:P641 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q450675 wdt:P1635 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]