[
  {
    "NNQT_question": "What is {natural product of taxon} of {Barquisimeto}, that has {taxon common name} is {Domestic Goat} ?",
    "uid": 30360,
    "subgraph": "right-subgraph",
    "template_index": 21,
    "question": "Which is made from the Barquisimeto having a common name as Domestic Goat?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q4709 wdt:P1582 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'Domestic Goat'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which is made from the Barquisimeto having a common title as Domestic Goat?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q449506 wdt:P1582 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'Domestic Goat'))}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {removed feature} of {iTunes}",
    "uid": 30798,
    "subgraph": "center",
    "template_index": 1262,
    "question": "Which is the removed feature of iTunes?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P756 wd:Q9589}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P4387 wd:Q9589}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {point in time} for {Le Corbusier} has {award received} as {Frank P. Brown Medal} ?",
    "uid": 3994,
    "subgraph": "statement_property",
    "template_index": 439,
    "question": "What year did Le Corbusier win the Frank P. Brown Medal?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q4724 p:P166 ?s . ?s ps:P166 wd:Q19873358 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q4724> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q19873358> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was the year when Le Corbusier had received the Frank P. Brown Medal?",
    "answers": [
      "1961-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "Give me {prefecture-level city} that contains the word {ürümqi} in their name",
    "uid": 23258,
    "subgraph": "string matching simple contains word",
    "template_index": 1834,
    "question": "What are the prefecture-level city  which start with the letter ürümqi",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q748149 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ürümqi')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q748149>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ürümqi')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the prefecture-level metropolis which start with the letter ürümqi",
    "answers": [
      "Ürümqi"
    ]
  },
  {
    "NNQT_question": "What is the {format as a regular expression} for {red} has {name in kana} as {R} ?",
    "uid": 31582,
    "subgraph": "statement_property",
    "template_index": 3918,
    "question": "What is the format for regular expression for red, which name in kana is R?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q3142 p:P1814 ?s . ?s ps:P1814 ?x filter(contains(?x,'R')) . ?s pq:P1793 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "R is the name in kana for red, what is its format for a regular expression?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q3142 p:P1813 ?s . ?s ps:P1813 ?x filter(contains(?x,'R')) . ?s pq:P1793 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {urban municipality of Germany} for {applies to taxon} of {Cardiff}",
    "uid": 31807,
    "subgraph": "simple question right",
    "template_index": 3169,
    "question": "Which German city is the taxon to which Cardiff is applied?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q10690 wdt:P2352 ?obj . ?obj wdt:P31 wd:Q42744322 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What other german city is the taxon to which Cardiff constitutes an application?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q10690 wdt:P190 ?obj . ?obj wdt:P31 wd:Q42744322 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Claude Brasseur} that is {point in time} is {1977-0-0} ?",
    "uid": 6326,
    "subgraph": "statement_property",
    "template_index": 2771,
    "question": "What award did Claude Brasseur receive in 1977-0-0?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q106544 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1977')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q106544> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1977-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which award was given to Claude Brasseur in 1977?",
    "answers": [
      "César Award for Best Supporting Actor"
    ]
  },
  {
    "NNQT_question": "Give me {demigod of Greek mythology} that {Wylie transliteration} {hide} and which that starts with {'h'}",
    "uid": 31909,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1726,
    "question": "tell me demigod of Greek mythology with hide as Wylie transliteration that starts with h",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23015925 . ?sbj wdt:P4187 wd:Q3291230 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "Which hide-Wylie transliterating demigod in Greek mythology has a name starting with letter H?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23015925 . ?sbj wdt:P3828 wd:Q3291230 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'h')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {number of branches} for {Baidu} has {headquarters location} as {Beijing} ?",
    "uid": 31575,
    "subgraph": "statement_property",
    "template_index": 2972,
    "question": "Get  the number of branches for Baidu that is headquartered at Beijing?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q14772 p:P159 ?s . ?s ps:P159 wd:Q956 . ?s pq:P8368 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Headquartered at Beijing, what is the number of branches of Baidu?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q14772 p:P159 ?s . ?s ps:P159 wd:Q956 . ?s pq:P281 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {end time} for {Wes Craven} has {spouse} as {Bonnie Broecker} ?",
    "uid": 4051,
    "subgraph": "statement_property",
    "template_index": 496,
    "question": "When did Wes Craven divorce Bonnie Broecker?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q223992 p:P26 ?s . ?s ps:P26 wd:Q20894422 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q223992> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q20894422> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Wes Craven and  Bonnie Broecker get separated?",
    "answers": [
      "1969-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "Give me {organization} that starts with {'z'}",
    "uid": 24149,
    "subgraph": "string matching simple contains word",
    "template_index": 3584,
    "question": "which organization name starts with z",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43229 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q43229>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "which organization title begins with z",
    "answers": [
      "Zionist Federation of Germany",
      "Zionites",
      "Znak",
      "Zollkriminalamt",
      "Zollverein School of Management and Design",
      "Zoll- und Handelsverein der Thüringischen Staaten",
      "Zeche Graf Schwerin",
      "Zentraldienststelle T4",
      "Zentrale Ermittlungsgruppe für Regierungs- und Vereinigungskriminalität",
      "Zweckverband Verkehrsverbund OWL",
      "Zentralarbeitsgemeinschaft",
      "zbMATH",
      "Zentralstelle für das Auslandsschulwesen",
      "Zentralstelle für Agrardokumentation und -Information",
      "Zentralstelle für Prüfungsaufgaben Nord-West",
      "Zentralinstitut für sozialistische Wirtschaftsführung",
      "Zentralkommission für Sport und Körperpflege",
      "Zentralgericht des Heeres",
      "Zentralstelle der Länder für Gesundheitsschutz bei Arzneimitteln und Medizinprodukten",
      "Zentralverband Deutscher Rasse-Kaninchenzüchter",
      "Zigarettenfabrik Derwisch",
      "Zomi Revolutionary Army",
      "Zentrum für Biodokumentation",
      "Zentralverband Elektrotechnik- und Elektronikindustrie",
      "Zentralvereinigung der Architekten Österreichs"
    ]
  },
  {
    "NNQT_question": "What is {twinned administrative body} of {Nagoya} that is {point in time} is {1978-02-16} ?",
    "uid": 31457,
    "subgraph": "statement_property",
    "template_index": 5245,
    "question": "Which city was twinned with Nagoya on 21st December, 1978?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q11751 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1978')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Give me the name of the city that was twinned with Nagoya on 21st December, 1978",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q11751 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1978')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {official name} for {Taos Pueblo} has {heritage designation} as {National Historic Landmark} ?",
    "uid": 31609,
    "subgraph": "statement_property",
    "template_index": 4176,
    "question": "What is the official name for Taos Pueblo which is designated as a National Historic Landmark?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q252814 p:P1435 ?s . ?s ps:P1435 wd:Q624232 . ?s pq:P1448 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "The designated National Historic Landmark, Taos Pueblo, has what official name?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q252814 p:P1435 ?s . ?s ps:P1435 wd:Q9259 . ?s pq:P1448 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Bandysidan player ID} of {Shimonoseki}",
    "uid": 30839,
    "subgraph": "center",
    "template_index": 2252,
    "question": "What is Bandysidan player ID for Shimonoseki ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q203308 wdt:P4831 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q542364 wdt:P4831 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Mannheim}, that has {winner} is {Patrick Alfred Buxton} ?",
    "uid": 30370,
    "subgraph": "right-subgraph",
    "template_index": 2173,
    "question": "What is the honorary title given to Mannheim which was won by P.A. Buxton?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2119 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q15994338}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the privileged title given to Mannheim which was won by P.A. Buxton?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q57514 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q15994338}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {chemical compound} with the {MAX(Scoville grade)} whose {from narrative universe} is {Qutenza} ?",
    "uid": 31119,
    "subgraph": "rank",
    "template_index": 11,
    "question": "Which of the chemical compounds from the narrative universe of Qutenza has the highest Scoville grade?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2658 ?obj . ?ent wdt:P1080 wd:Q29006389 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Name the chemical compounds from the narrative universe of Qutenza that has the highest Scoville grade",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2658 ?obj . ?ent wdt:P3780 wd:Q29006389 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {cast member} of {The Big Lebowski} that is {character role} is {Bunny Lebowski} ?",
    "uid": 7062,
    "subgraph": "statement_property",
    "template_index": 3507,
    "question": "Who is the cast member for the role of Bunny Lebowski in the Big Lebowski?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q337078 p:P161 ?s . ?s ps:P161 ?obj . ?s pq:P453 wd:Q55717001 }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q337078> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P161> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P453> <http://wikidata.dbpedia.org/resource/Q55717001>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Who played Bunny Lebowski in The Big Lebowski?",
    "answers": [
      "Tara Reid"
    ]
  },
  {
    "NNQT_question": "What is the {powered by} and the {architectural style} of {B-1 Lancer} ?",
    "uid": 31966,
    "subgraph": "two intentions right subgraph",
    "template_index": 240,
    "question": "What power plant and architectural style is responsible for the Rockwell B-1 Lancer?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q218636 wdt:P516 ?ans_1 . wd:Q218636 wdt:P149 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What control plant and architectural style is capable for the Rockwell B-1 Lancer?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q218636 wdt:P516 ?ans_1 . wd:Q218636 wdt:P176 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {category of people buried here} for {Bjรธrnstjerne Bjรธrnson} has {place of burial} as {Vรฅr Frelsers gravlund} ?",
    "uid": 31581,
    "subgraph": "statement_property",
    "template_index": 5512,
    "question": "What is Bjørnstjerne Bjørnson's burial category in Vår Frelsers gravlund?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q46405 p:P119 ?s . ?s ps:P119 wd:Q1069938 . ?s pq:P1791 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "In Var Freslers gravlund what is Bjornstjerne Bjornson burial category?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q46405 p:P119 ?s . ?s ps:P119 wd:Q1069938 . ?s pq:P965 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {notable work} of {main subject} of {Sonnet 72} ?",
    "uid": 30751,
    "subgraph": "left-subgraph",
    "template_index": 44,
    "question": "What is the notable work of the main subject of Sonnet 72?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3490580 wdt:P921 ?X . ?X wdt:P800 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Tell me the notable work of Sonnet 72 main subject.",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q3490580 wdt:P50 ?X . ?X wdt:P800 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {safety classification and labelling} of {acetylene} that is {NFPA Instability} is {0} ?",
    "uid": 31418,
    "subgraph": "statement_property",
    "template_index": 3259,
    "question": "What is the safety classification and labelling of acetylene that's NFPA Instability is 0?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q133145 p:P4952 ?s . ?s ps:P4952 ?obj . ?s pq:P995 ?x filter(contains(?x,'0')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "According to the NFPA Instability, what is the safety classification and labelling of acetylene 0?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q2025 p:P4952 ?s . ?s ps:P4952 ?obj . ?s pq:P995 ?x filter(contains(?x,'0')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {subclass of} of {thunder}",
    "uid": 30817,
    "subgraph": "center",
    "template_index": 2651,
    "question": "Which is the subclass of thunder?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P279 wd:Q83301}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P4733 wd:Q83301}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {afflicts} of {Syrie Maugham} that is {end time} is {1927-04-12} ?",
    "uid": 31304,
    "subgraph": "statement_property",
    "template_index": 1868,
    "question": "What was Syrie Maugham's affliction in 1927?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q7663337 p:P689 ?s . ?s ps:P689 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1927')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1927, what was Syrie Maugham's affliction?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q7663337 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1927')) }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {women's rugby league} for {commanded by} of {Stonewall Jackson}",
    "uid": 30229,
    "subgraph": "simple question left",
    "template_index": 2139,
    "question": "Stonewall Jackson commanded what women's rugby league?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P4791 wd:Q216124 . ?sbj wdt:P31 wd:Q3452887 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Let me know ethnolect whose title has the word perkerdansk in it.",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P4791 wd:Q216124 . ?sbj wdt:P31 wd:Q178561 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {connects with} of {Chicago Cubs}",
    "uid": 30878,
    "subgraph": "center",
    "template_index": 3369,
    "question": "The Chicago Cubs is connected with what?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q246782 wdt:P2789 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q246782 wdt:P505 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {spouse} of {Diane von Fürstenberg} that is {start time} is {1969-1-1} ?",
    "uid": 5390,
    "subgraph": "statement_property",
    "template_index": 1835,
    "question": "Who did Diane von Furstenberg marry in 1969MacGraw",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q272438 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1969')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q272438> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1969-1-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Name the person whom Diane von Furstenberg married during the year 1969.",
    "answers": [
      "Prince Egon von Fürstenberg",
      "Prince Egon von Fürstenberg"
    ]
  },
  {
    "NNQT_question": "What is the {Greek nymph} for {residence} of {Apollo}",
    "uid": 30253,
    "subgraph": "simple question left",
    "template_index": 3057,
    "question": "Which is Greek nymph which was the residence of Apollo?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P551 wd:Q37340 . ?sbj wdt:P31 wd:Q3346693 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is Greek fairy which was the residence of Apollo?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P451 wd:Q37340 . ?sbj wdt:P31 wd:Q3346693 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {educated at} of {George Washington} and {academic degree}",
    "uid": 32033,
    "subgraph": [],
    "template_index": 755,
    "question": "Where was George Washington educated and what academic degree was earned?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q23 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Where was the education given to George Washington and what academic degree was earned?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q1058 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {official language} of {conversion to SI unit} of {Pasi Siltakorpi} ?",
    "uid": 30542,
    "subgraph": "left-subgraph",
    "template_index": 26613,
    "question": "What is the official language of conversion to SI unit in Pasi Siltakorpi?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q28786447 wdt:P2370 ?X . ?X wdt:P37 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which is the official language for conversion to SI unit in Pasi Siltakorpi",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q28786447 wdt:P551 ?X . ?X wdt:P37 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {head of state} and the {office held by head of state} of {Soviet_Union} ?",
    "uid": 10204,
    "subgraph": "two intentions right subgraph",
    "template_index": 630,
    "question": "What are the head of state and the office held by head of state of the Soviet Union?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q15180 wdt:P35 ?ans_1 . wd:Q15180 wdt:P1906 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q15180> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P35> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q15180> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1906> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What is the head of state of the Soviet Union?",
    "answers": [
      "Mikhail Gorbachev",
      "President of the Soviet Union"
    ]
  },
  {
    "NNQT_question": "What is {found in taxon} of {editor} of {post-traumatic stress disorder} ?",
    "uid": 30568,
    "subgraph": "right-subgraph",
    "template_index": 932,
    "question": "What is the editor that can be found in species with post-traumatic stress disorder?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q202387 wdt:P98 ?X . ?X wdt:P703 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the editor found in post - traumatic stress disorder species?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q202387 wdt:P2293 ?X . ?X wdt:P703 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {end time} for {Stuart Broad} has {member of sports team} as {Nottinghamshire County Cricket Club} ?",
    "uid": 31618,
    "subgraph": "statement_property",
    "template_index": 2943,
    "question": "when did Stuart Broad end his contract as a player with Nottinghamshire County Cricket Club?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q3140358 p:P54 ?s . ?s ps:P54 wd:Q3344790 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Give me the date that Stuart Broad ended his contract as a player with Nottinghamshire County Cricket Club.",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q3140358 p:P54 ?s . ?s ps:P54 wd:Q3229147 . ?s pq:P582 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {publication date} and {place of publication} of {Freedom Force vs the 3rd Reich} has {publisher} as {Midway Games}",
    "uid": 32062,
    "subgraph": [],
    "template_index": 323,
    "question": "What is the date did Midway games publish the video game Freedom Force vs the 3rd Reich, and where was it published?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q2440 p:P123 ?s . ?s ps:P123 wd:Q149947 . ?s pq:P577 ?value1 . ?s pq:P291 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When and on what date did Midway games publish the Freedom Force vs the 3rd Reich video game?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q173626 p:P123 ?s . ?s ps:P123 wd:Q149947 . ?s pq:P577 ?value1 . ?s pq:P291 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]