[
  {
    "NNQT_question": "What is {immediate cause of} of {has cause} of {Kollam temple fire} ?",
    "uid": 30714,
    "subgraph": "left-subgraph",
    "template_index": 461,
    "question": "What was the immediate outcome  originating  from the Kollam temple fire?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q23772755 wdt:P828 ?X . ?X wdt:P1536 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which was the immediate outcome originating from the Kollam temple fire?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q3960716 wdt:P828 ?X . ?X wdt:P1536 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {describes a project that uses} of {Strange Case of Dr Jekyll and Mr Hyde}",
    "uid": 31847,
    "subgraph": "simple question right",
    "template_index": 1626,
    "question": "Strange Case of Dr Jekyll and Mr Hyde describes a project used by who?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q217352 wdt:P4510 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who was used in a project described by Dr Jekyll's and Mr Hyde's Strange Case?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q217352 wdt:P50 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {novel series} that starts with {'t'}",
    "uid": 24337,
    "subgraph": "string matching simple contains word",
    "template_index": 3032,
    "question": "What's the name of a novel series that starts with the letter \"t\"?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1667921 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1667921>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name a novel series that begins with \"t\".",
    "answers": [
      "The Wheel of Time",
      "The Hunger Games",
      "Twilight",
      "The Book of Dust",
      "The Hitchhiker's Guide to the Galaxy pentalogy",
      "The Once and Future King",
      "The Sisterhood of the Traveling Pants",
      "The Alexandria Quartet",
      "The Thibaults",
      "The Littles",
      "The Angels cycle",
      "The 39 Clues",
      "Trixie Belden",
      "Thrawn trilogy",
      "The Pardaillan",
      "The Enemy Within",
      "The Sarantine Mosaic",
      "The Ki and Vandien Quartet",
      "The Baby-Sitters Club",
      "The Age of Unreason",
      "The Axis trilogy",
      "The Roman Mysteries",
      "The Darkwar Saga",
      "The Caravan Family",
      "The Caretaker Trilogy"
    ]
  },
  {
    "NNQT_question": "What is {member of sports team} of {Alex Ferguson} that is {start time} is {1973-1-1} ?",
    "uid": 5422,
    "subgraph": "statement_property",
    "template_index": 1867,
    "question": "Is Alex Ferguson is the member of sports team which was started in 1-1-1973?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q44980 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1973')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q44980> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P54> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1973-1-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Is it correct that Alex Ferguson is the member of sports team which was started in 1-1-1973?",
    "answers": [
      "Ayr United F.C."
    ]
  },
  {
    "NNQT_question": "What is the {from narrative universe} and the {creator} of {Black Spider} ?",
    "uid": 31977,
    "subgraph": "two intentions right subgraph",
    "template_index": 591,
    "question": "What fictional universe did Black Spider take place in and who create Black Spider?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q465458 wdt:P1080 ?ans_1 . wd:Q465458 wdt:P170 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Who created Black Spider, and which fictional universe did it take place in?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q32884 wdt:P1080 ?ans_1 . wd:Q32884 wdt:P170 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Austrian municipality key} of {Port Moresby}",
    "uid": 30829,
    "subgraph": "center",
    "template_index": 493,
    "question": "WHICH IS THE AUSTRIAN MUNICIPALITY KEY OF  PORT MORESBY",
    "sparql_wikidata": "select distinct ?answer where { wd:Q36526 wdt:P964 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q41753 wdt:P964 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {winner} of {followed by} of {Lanzhou} ?",
    "uid": 30497,
    "subgraph": "left-subgraph",
    "template_index": 20,
    "question": "Who won the prize at the sequel of Lanzhou?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q183584 wdt:P156 ?X . ?X wdt:P1346 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who won the prize at the spin-off of the Lanzhou?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1356316 wdt:P156 ?X . ?X wdt:P1346 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {tonal language} that contains the word {thai} in their name",
    "uid": 31236,
    "subgraph": "string matching simple contains word",
    "template_index": 4,
    "question": "Tell me tonal language whose name has the word thai in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q191328 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'thai')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me tonal language whose identify has the phrase thai in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33742 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'thai')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {series ordinal} for {Waseda University} has {chairperson} as {Kaoru Kamata} ?",
    "uid": 5976,
    "subgraph": "statement_property",
    "template_index": 2421,
    "question": "What is the series ordinal for chairperson Kaoru Kamata at Waseda University?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q274486 p:P488 ?s . ?s ps:P488 wd:Q10854980 . ?s pq:P1545 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q274486> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P488> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q10854980> .\n?statement <http://www.wikidata.org/entity/P1545> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Chairperson Kaoru Kamata of Waseda University has what series ordinal?",
    "answers": [
      "16"
    ]
  },
  {
    "NNQT_question": "Give me {security agency} that contains the word {state} in their name",
    "uid": 23914,
    "subgraph": "string matching simple contains word",
    "template_index": 2320,
    "question": "Tell me  security agency whose name has the word state in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3238445 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'state')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3238445>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'state')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know security office whose title has the word state in it.",
    "answers": [
      "State Security Investigations Service",
      "Ministry of State Security of the People's Republic of China",
      "United States Army Security Agency",
      "State Security Presidium",
      "Special State Protection Service",
      "State Security Administration",
      "State Investigation and Protection Agency",
      "Belgian State Security Service"
    ]
  },
  {
    "NNQT_question": "How many {social classification} are to/by {boyar} ?",
    "uid": 2226,
    "subgraph": "statement_property",
    "template_index": 1570,
    "question": "How many different boyar social classifications are there?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3716 wd:Q203563 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3716> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q203563 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "What is the number of different boyar social classifications?",
    "answers": [
      "17"
    ]
  },
  {
    "NNQT_question": "What is the {music movement} for {movement} of {Igor Stravinsky}",
    "uid": 31873,
    "subgraph": "simple question right",
    "template_index": 3562,
    "question": "To which musical movement did Igor Stravinsky belong?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q7314 wdt:P135 ?obj . ?obj wdt:P31 wd:Q12020884 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "To which melodic development did Igor Stravinsky have a place?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q180727 wdt:P135 ?obj . ?obj wdt:P31 wd:Q12020884 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {country for sport} and the {sport} of {Novak_Djokovic} ?",
    "uid": 9552,
    "subgraph": "two intentions right subgraph",
    "template_index": 456,
    "question": "Which is the {country for sport} and the {sport} of {Novak_Djokovic} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q5812 wdt:P1532 ?ans_1 . wd:Q5812 wdt:P641 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q5812> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1532> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q5812> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P641> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What country is Novak Djokovic from, and what sport does he play?",
    "answers": [
      "Serbia",
      "tennis"
    ]
  },
  {
    "NNQT_question": "What is the {film production company} for {owner of} of {Jetix}",
    "uid": 30316,
    "subgraph": "simple question left",
    "template_index": 2371,
    "question": "What film production company owns the Jetix?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1830 wd:Q156073 . ?sbj wdt:P31 wd:Q1762059 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the film production company owner of Jetix",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1830 wd:Q169889 . ?sbj wdt:P31 wd:Q1762059 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {total fertility rate} of {Sudan} that is {doubles record} is {estimation process} ?",
    "uid": 31302,
    "subgraph": "statement_property",
    "template_index": 4780,
    "question": "What is the total fertility rate of Sudan that doubled record of estimation process?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1049 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P555 wd:Q791801 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Doubling record of estimation process, Sudan has a total fertility rate of what?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q1049 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P459 wd:Q791801 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {partner town} of {hometown} of {Ivan Turgenev} ?",
    "uid": 15479,
    "subgraph": "right-subgraph",
    "template_index": 8067,
    "question": "What is the sister city of Ivan Turgenev's hometown?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q42831 wdt:P551 ?X . ?X wdt:P190 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q42831> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P551>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the sister city of Ivan Turgenev's hometown?",
    "answers": [
      "Los Angeles",
      "London",
      "Paris",
      "City of Brussels",
      "Tashkent",
      "Warsaw",
      "Istanbul",
      "Sofia",
      "Moscow",
      "Beijing",
      "Prague",
      "Buenos Aires",
      "Mexico City",
      "Tokyo",
      "Copenhagen",
      "Budapest",
      "Kyiv",
      "Madrid",
      "Brasília",
      "Algiers",
      "Tehran",
      "Jakarta",
      "Windhoek",
      "Seville",
      "Santo Domingo",
      "Seto",
      "Los Angeles",
      "Alexandria",
      "Paris",
      "Vilnius",
      "Tashkent",
      "Warsaw",
      "Istanbul",
      "Lyon",
      "Plovdiv",
      "Sofia",
      "Milan",
      "Turin",
      "Oslo",
      "Venice",
      "Krasnoyarsk",
      "Beijing",
      "Tbilisi",
      "Maribor",
      "Hamburg",
      "Prague",
      "Mumbai",
      "Montevideo",
      "Zagreb",
      "Genoa"
    ]
  },
  {
    "NNQT_question": "What is {work location} of {Willem de Kooning} that is {point in time} is {1926-07-18} ?",
    "uid": 31456,
    "subgraph": "statement_property",
    "template_index": 631,
    "question": "Where did Willem de Kooning work on 7-18-1926?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q132305 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1926')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "At what place worked Willem de Kooning in 1926?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q132305 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1926')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {American football team} that {occupant} {Lambeau Field} and which contains the word {bay} in their name",
    "uid": 31938,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3865,
    "question": "tell  me American football team that occupies Lambeau Field  name has the  the word bay in it",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17156793 . ?sbj wdt:P466 wd:Q860790 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'bay')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "tell me American soccer group that occupies Lambeau Field title has the the word bay in it",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17156793 . ?sbj wdt:P115 wd:Q860790 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'bay')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {main food source} of {vitamin E}",
    "uid": 30796,
    "subgraph": "center",
    "template_index": 354,
    "question": "Which is the main food source of vitamin E?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1034 wd:Q141180}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P4543 wd:Q141180}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {publisher} of {follows} of {Opie's Newspaper} ?",
    "uid": 30638,
    "subgraph": "left-subgraph",
    "template_index": 430,
    "question": "What publisher preceded Opie's Newspapers?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q51231142 wdt:P155 ?X . ?X wdt:P123 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What publisher gone before Opie's Newspapers?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q51231142 wdt:P155 ?X . ?X wdt:P179 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {series ordinal} for {Waseda University} has {chairperson} as {Ōkuma Shigenobu} ?",
    "uid": 31616,
    "subgraph": "statement_property",
    "template_index": 2421,
    "question": "What is the series ordinal for chairperson Ōkuma Shigenobu at Waseda University?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q274486 p:P488 ?s . ?s ps:P488 wd:Q243141 . ?s pq:P1545 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Chairperson Ōkuma Shigenobu of Waseda University has what series ordinal?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q274486 p:P488 ?s . ?s ps:P488 wd:Q10854980 . ?s pq:P1545 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {record held} of {Pedro Aguirre Cerda} and {height}",
    "uid": 32030,
    "subgraph": [],
    "template_index": 151,
    "question": "What is the height record held by Pedro Aguirre Cerda?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q845 p:P1000 ?s . ?s ps:P1000 ?obj . ?s pq:P2048 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What is the tallness record held by Pedro Aguirre Cerda?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q1742 p:P1000 ?s . ?s ps:P1000 ?obj . ?s pq:P2048 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {cuisine} for {flag} of {veganism}",
    "uid": 31850,
    "subgraph": "simple question right",
    "template_index": 1252,
    "question": "Which is the flag for the veganism cuisine?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q181138 wdt:P163 ?obj . ?obj wdt:P31 wd:Q1778821 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What flag is used in a vegan diet?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q181138 wdt:P2012 ?obj . ?obj wdt:P31 wd:Q1778821 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {conflict} are to/by {Crusades} ?",
    "uid": 2307,
    "subgraph": "statement_property",
    "template_index": 1651,
    "question": "How many Crusade conflicts were there?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P607 wd:Q12546 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P607> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q12546 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "What is the number of Crusade conflicts?",
    "answers": [
      "8"
    ]
  },
  {
    "NNQT_question": "Give me {decimal classification} that {has edition or translation} {New Classification Scheme for Chinese Libraries} and which contains the word {classification} in their name",
    "uid": 31932,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2711,
    "question": "Name a decimal classification that has an edition or a translation in the New Classification Scheme for Chinese Libraries and contains the word \"classification \" in its name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1207369 . ?sbj wdt:P747 wd:Q13652821 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'classification')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Name a decimal classification that is present in the New Classification Scheme for Chinese Libraries and includes the word \"classification \" in its name",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1207369 . ?sbj wdt:P747 wd:Q15222117 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'classification')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {twin town} of {Port Vila}, that has {license plate code} is {沪A} ?",
    "uid": 12087,
    "subgraph": "right-subgraph",
    "template_index": 795,
    "question": "What is the twin town of Port Vila, with the license plate code 沪A?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q37806 wdt:P190 ?answer . ?answer wdt:P395 ?x FILTER(contains(?x,'沪A'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q37806> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P395> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <沪A> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the twin town of Port Vila, with the license plate code 沪A?",
    "answers": [
      "Shanghai"
    ]
  },
  {
    "NNQT_question": "What is {signature} of {Viola Davis}",
    "uid": 31052,
    "subgraph": "center",
    "template_index": 1333,
    "question": "Which is signature of Viola Davis?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q229181 wdt:P109 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q229181 wdt:P2471 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {American football team} that {home venue} {Lambeau Field} and which contains the word {bay} in their name",
    "uid": 24941,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3865,
    "question": "tell  me American football team that home venue Lambeau Field  name has the  the word bay in it",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17156793 . ?sbj wdt:P115 wd:Q860790 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'bay')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q17156793>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P115> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q860790>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'bay')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "tell me American soccer group that domestic venue Lambeau Field title has the the word bay in it",
    "answers": [
      "Green Bay Packers"
    ]
  },
  {
    "NNQT_question": "How many {influenced by} are to/by {Otto Dietze} ?",
    "uid": 31763,
    "subgraph": "statement_property",
    "template_index": 1690,
    "question": "How many are influenced by Otto Dietze?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P737 wd:Q7076958 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "How many people are there that are influenced by Otto Dietze?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P737 wd:Q34618 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {designed by} are for {Thomas Cromwell} ?",
    "uid": 31677,
    "subgraph": "statement_property",
    "template_index": 236,
    "question": "How many things are designed for Thomas Cromwell?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q294435 wdt:P287 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What is the total number of things designed for Thomas Cromwell?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q189784 wdt:P287 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {mathematical notation} that starts with {'s'}",
    "uid": 24695,
    "subgraph": "string matching simple contains word",
    "template_index": 2992,
    "question": "what are the mathematical notation which start with the letter s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1140046 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1140046>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "what are the numerical documentation which begin with the letter s",
    "answers": [
      "Sweedler notation",
      "Schläfli symbol"
    ]
  }
]