[
  {
    "NNQT_question": "What is {electoral district} and {represents} of {Jacinda Ardern} has {position held} as {President of the European Commission}",
    "uid": 32063,
    "subgraph": [],
    "template_index": 1552,
    "question": "What electoral district does President of the European Commission Jacinda Ardern represent?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q3606816 p:P39 ?s . ?s ps:P39 wd:Q8882 . ?s pq:P768 ?value1 . ?s pq:P1268 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What constituent area does President of the European Commission Jacinda Ardern speak to?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q3606816 p:P39 ?s . ?s ps:P39 wd:Q18145518 . ?s pq:P768 ?value1 . ?s pq:P1268 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {feast day} are for {David J. Eagle} ?",
    "uid": 31710,
    "subgraph": "statement_property",
    "template_index": 225,
    "question": "How many Feast Days are for David J. Eagle?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q5235416 wdt:P841 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Which is the number of Feast Days that there are for David J. Eagle?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q44024 wdt:P841 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Yukon Quest} with the {MIN(size of team at finish)} whose {location} is {Braeburn Lodge}  ?",
    "uid": 3229,
    "subgraph": "rank",
    "template_index": 451,
    "question": "Name the Yukon quest with the minimum size of team at finish whose location is braeburn lodge?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q2301224 . ?ent wdt:P2105 ?obj . ?ent wdt:P276 wd:Q4955299. } ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q2301224>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2105>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P276> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q4955299> .\n\n}\nORDER BY ASC(?obj1)\nLIMIT 5",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Which Yukon quest in Braeburn Lodge finished with the smallest size team?",
    "answers": [
      "Yukon Quest 2015",
      "Yukon Quest 2016"
    ]
  },
  {
    "NNQT_question": "Give me {winged horse} that contains the word {pegasus} in their name",
    "uid": 23249,
    "subgraph": "string matching simple contains word",
    "template_index": 3863,
    "question": "What are the winged horse which start with the letter pegasus",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2537829 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'pegasus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2537829>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'pegasus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which winged horses begin with the word \"pegasus\"?",
    "answers": [
      "Pegasus",
      "Ethiopian pegasus"
    ]
  },
  {
    "NNQT_question": "What is the {end time} for {Edward IV of England} has {unmarried partner} as {Fernande Olivier} ?",
    "uid": 31476,
    "subgraph": "statement_property",
    "template_index": 2160,
    "question": "When was Edward IV of England's partnership with Fernade Oliver over?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q160341 p:P451 ?s . ?s ps:P451 wd:Q453775 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "On what date did Edward IV of England end his partnership with Fernade Oliver?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q5593 p:P451 ?s . ?s ps:P451 wd:Q453775 . ?s pq:P582 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {represents organisation} of {brother or sister} of {Louis Gigante} ?",
    "uid": 16021,
    "subgraph": "left-subgraph",
    "template_index": 8,
    "question": "What represents the organization of the siblings of Louis Gigante?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q6687246 wdt:P3373 ?X . ?X wdt:P1268 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q6687246> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3373>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1268> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "The organization of the siblings of Louis Gigante is represented by what?",
    "answers": [
      "Sicilian Mafia"
    ]
  },
  {
    "NNQT_question": "What is {country of citizenship} of {place of burial} of {Harald III of Norway} ?",
    "uid": 30643,
    "subgraph": "right-subgraph",
    "template_index": 736,
    "question": "What is the country of citizenship of resting place of Harald III of Norway?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q203647 wdt:P119 ?X . ?X wdt:P27 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is Norway's Harald III resting place country of citizenship?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q203647 wdt:P119 ?X . ?X wdt:P131 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {used by} are to/by {Fukuoka} ?",
    "uid": 31750,
    "subgraph": "statement_property",
    "template_index": 1142,
    "question": "What is the number of those used by Fukuoka?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1535 wd:Q26600 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Which is the number of those used by Fukuoka?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P126 wd:Q26600 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {coat of arms image} are for {Labour Party} ?",
    "uid": 31702,
    "subgraph": "statement_property",
    "template_index": 587,
    "question": "How many coat of arms images are in the Labour Party?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q9630 wdt:P94 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Which is the number of coat of arms images that are in the Labour Party?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q9630 wdt:P2124 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {property} for {normalized Unicode character} of {biology}",
    "uid": 31851,
    "subgraph": "simple question right",
    "template_index": 1184,
    "question": "WHat normalized Unicode character does biology study ?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q420 wdt:P5591 ?obj . ?obj wdt:P31 wd:Q937228 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What topics about normalized Unicode characters are covered in biology?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q420 wdt:P2578 ?obj . ?obj wdt:P31 wd:Q937228 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {production date} are for {Doctor Who} ?",
    "uid": 31697,
    "subgraph": "statement_property",
    "template_index": 481,
    "question": "How many Doctor Who production dates are there?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q34316 wdt:P2754 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Which is the number of Doctor Who production dates?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q34316 wdt:P2512 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {executive director} of {working place} of {Christopher Wylie} ?",
    "uid": 14568,
    "subgraph": "left-subgraph",
    "template_index": 10,
    "question": "Who is the executive director at Christopher Wylie's company?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q50845422 wdt:P108 ?X . ?X wdt:P169 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q50845422> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P108>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P169> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is the executive director at Christopher Wylie's company?",
    "answers": [
      "Alexander Nix"
    ]
  },
  {
    "NNQT_question": "Give me {highly urbanized city} that {language used} {Tagalog} and which that starts with {'v'}",
    "uid": 25450,
    "subgraph": "string matching type + relation contains word",
    "template_index": 503,
    "question": "what is highly urbanized city language used by tagalog and also which starts with letter v",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29946056 . ?sbj wdt:P2936 wd:Q34057 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q29946056>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2936> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q34057>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "what is particularly urbanized metropolis language used by using tagalog and also which starts offevolved with letter v",
    "answers": [
      "Valenzuela"
    ]
  },
  {
    "NNQT_question": "What is {country of citizenship} of {Marlene Dietrich} that is {date of birth} is {1939-01-01} ?",
    "uid": 31390,
    "subgraph": "statement_property",
    "template_index": 2540,
    "question": "In 1939, what country was Marlene Dietrich born in?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q4612 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P569 ?x filter(contains(YEAR(?x),'1939')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which country was Marlene Dietrich born in 1939?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q4612 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1939')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {end time} for {Sarah Bernhardt} has {spouse} as {Jacques Damala} ?",
    "uid": 7376,
    "subgraph": "statement_property",
    "template_index": 3821,
    "question": "When did Sarah Bernhardt and Jacques Damala split up?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q4605 p:P26 ?s . ?s ps:P26 wd:Q6120528 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q4605> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q6120528> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Sarah Bernhardt and Jacques divorce?",
    "answers": [
      "1889-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {instrument} of {performer} of {Bleed Well} ?",
    "uid": 30616,
    "subgraph": "left-subgraph",
    "template_index": 45,
    "question": "Which {musical instrument} of {musician}  is used on {Bleed Well} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q26630 wdt:P175 ?X . ?X wdt:P1303 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which {melodic instrument} of {artist} is utilized on {Bleed Well} ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q51801055 wdt:P175 ?X . ?X wdt:P1303 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {author} are to/by {E. H. Shepard} ?",
    "uid": 31766,
    "subgraph": "statement_property",
    "template_index": 1506,
    "question": "How many works have by E. H. Shepard as author?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P50 wd:Q382031 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "In regards to E.H. Shepard, how many works did he realize?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P110 wd:Q382031 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {informed by} of {Friedrich Schiller}, that has {father-in-law} is {Peter Im Baumgarten} ?",
    "uid": 12157,
    "subgraph": "right-subgraph",
    "template_index": 4063,
    "question": "Who is informed by Friedrich Schiller, that has a father-in-law named Peter Im Baumgarten?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q22670 wdt:P737 ?answer . ?answer wdt:P1038 wd:Q2079256}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q22670> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P737>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1038> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2079256> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is informed about a father - in - law named Peter I m Baumgarten by Friedrich Schiller?",
    "answers": [
      "Johann Wolfgang von Goethe"
    ]
  },
  {
    "NNQT_question": "Give me {concept map} that contains the word {model} in their name",
    "uid": 31196,
    "subgraph": "string matching simple contains word",
    "template_index": 3260,
    "question": "Tell me concept map whose name has the word model in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q830115 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'model')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know concept map whose title has the word show in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q356674 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'model')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {diocese} are to/by {aircraft} ?",
    "uid": 31731,
    "subgraph": "statement_property",
    "template_index": 1744,
    "question": "How many diocese does the aircraft has?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P708 wd:Q11436 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "What are all the kinds of dioceses on this aircraft?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P520 wd:Q11436 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {temperature} and {phase of matter} of {water} has {phase point} as {Jean-Jacques Dessalines}",
    "uid": 32045,
    "subgraph": [],
    "template_index": 426,
    "question": "Mention the temperature and the state of the matter of water upon achieving the Jean-Jacques Dessalines",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q283 p:P873 ?s . ?s ps:P873 wd:Q212068 . ?s pq:P2076 ?value1 . ?s pq:P515 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the temperature and state of matter of water when it reaches the Jean-Jacques Dessalines?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q283 p:P873 ?s . ?s ps:P873 wd:Q111059 . ?s pq:P2076 ?value1 . ?s pq:P515 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {food ingredient} that contains the word {zucchini} in their name",
    "uid": 23463,
    "subgraph": "string matching simple contains word",
    "template_index": 3842,
    "question": "What are the food ingredient which start with the letter zucchini",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25403900 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zucchini')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q25403900>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zucchini')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name the food ingredient that starts with the letter zicchini",
    "answers": [
      "zucchini"
    ]
  },
  {
    "NNQT_question": "Give me {historical language} that {has grammatical gender} {feminine} and which contains the word {ancient} in their name",
    "uid": 25039,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3301,
    "question": "Tell me the historical language that contains the word 'ancient' in its name and that has the grammatical feminine gender.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2315359 . ?sbj wdt:P5109 wd:Q1775415 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ancient')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2315359>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P5109> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1775415>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ancient')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Tell me the historical language that contains the phrase 'ancient' in its identify and that has the grammatical feminine gender.",
    "answers": [
      "Ancient Greek"
    ]
  },
  {
    "NNQT_question": "What is {educated at} of {Christopher Wren} that is {academic major} is {Latin} ?",
    "uid": 7276,
    "subgraph": "statement_property",
    "template_index": 3721,
    "question": "Where did Christopher Wren major in Latin?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q170373 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 wd:Q397 }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q170373> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P69> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P812> <http://wikidata.dbpedia.org/resource/Q397>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "At what location did Christopher Wren major in Latin?",
    "answers": [
      "Wadham College"
    ]
  },
  {
    "NNQT_question": "What is {point in time} and {together with} of {Dan Rowan} has {chord progression} as {star on Hollywood Walk of Fame}",
    "uid": 32058,
    "subgraph": [],
    "template_index": 936,
    "question": "When did Dan Rowan have a star on the Hollywood Walk of Fame as chord prograssion",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q3013195 p:P6116 ?s . ?s ps:P6116 wd:Q17985761 . ?s pq:P585 ?value1 . ?s pq:P1706 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What date did Dan Rowan get a star on the Hollywood Walk of Fame as chord progression?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q3013195 p:P166 ?s . ?s ps:P166 wd:Q17985761 . ?s pq:P585 ?value1 . ?s pq:P1706 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {contains administrative territorial entity} of {part of} of {Dubrovka} ?",
    "uid": 30669,
    "subgraph": "left-subgraph",
    "template_index": 2097,
    "question": "What contains administrative territorial entity of the land of Dubrovka ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q4903 wdt:P361 ?X . ?X wdt:P150 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What contains territorial entities of the land of Dubrovka?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q4903 wdt:P17 ?X . ?X wdt:P150 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {for work} for {Ringo Starr} has {nominated for} as {Academy Award for Best Foreign Language Film} ?",
    "uid": 31560,
    "subgraph": "statement_property",
    "template_index": 336,
    "question": "Which song was Ringo Starr nominated for the Academy Award for Best Foreign Language Film?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q2632 p:P1411 ?s . ?s ps:P1411 wd:Q105304 . ?s pq:P1686 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Ringo Starr was nominated  for the Best Foreign Language Film by the Academy Award for which track?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q2632 p:P1411 ?s . ?s ps:P1411 wd:Q22344608 . ?s pq:P1686 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {game mode} are to/by {massively multiplayer online first-person shooter game} ?",
    "uid": 31756,
    "subgraph": "statement_property",
    "template_index": 1746,
    "question": "How many game modes are by a MMO FPS game game?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P404 wd:Q975060 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "In a MMO FPS game, how many game modes exist?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P404 wd:Q862490 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {label in sign language} of {February} that is {last line} is {Catalan Sign Language} ?",
    "uid": 31391,
    "subgraph": "statement_property",
    "template_index": 3302,
    "question": "What is the sign for February which last line is Catalan Sign Language?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q109 p:P2919 ?s . ?s ps:P2919 ?obj . ?s pq:P3132 wd:Q35768 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In the last line of Catalan Sign Language, how do you sign February?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q109 p:P2919 ?s . ?s ps:P2919 ?obj . ?s pq:P407 wd:Q35768 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Virgil} that is {point in time} is {1977-01-01} ?",
    "uid": 31340,
    "subgraph": "statement_property",
    "template_index": 2771,
    "question": "What award did Virgil receive in 1977-0-0?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1398 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1977')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which award was given to Virgil in 1977?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q106544 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1977')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {constraint clarification} of {desertion}",
    "uid": 30786,
    "subgraph": "center",
    "template_index": 185,
    "question": "What is the constraint clarification of desertion?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P6607 wd:Q633339}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1399 wd:Q633339}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {editor} of {IEEE 1394}, that has {subsidiary} is {IEEE Nuclear and Plasma Sciences Society} ?",
    "uid": 30484,
    "subgraph": "right-subgraph",
    "template_index": 46,
    "question": "What are the editors of IEEE 1394, that have subsidiary entities of IEEE Nuclear and Plasma Sciences Society?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q181693 wdt:P98 ?answer . ?answer wdt:P355 wd:Q3639101}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the editors of IEEE 1394, that have subsidiary entities of IEEE Nuclear and Plasma Sciences Society?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q181693 wdt:P1462 ?answer . ?answer wdt:P355 wd:Q3639101}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {possessed by spirit} of {draugr}",
    "uid": 30788,
    "subgraph": "center",
    "template_index": 3692,
    "question": "Which is possessed by draugr spirit?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P4292 wd:Q1255927}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P4292 wd:Q193291}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]