[
  {
    "NNQT_question": "Give me {game mechanics} {famine} that starts with {'t'}",
    "uid": 31165,
    "subgraph": "string matching simple contains word",
    "template_index": 660,
    "question": "Tell me the thing with famine game mechanic which starts with the letter t?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P4151 wd:Q168247 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me the thing with starvation game mechanic that begins with letter t?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q168247 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {musical instrument} of {musician} of {A Theme from The Threepenny Opera} ?",
    "uid": 15231,
    "subgraph": "left-subgraph",
    "template_index": 45,
    "question": "Which {musical instrument} of {musician}  is used on {A Theme from The Threepenny Opera} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q51801055 wdt:P175 ?X . ?X wdt:P1303 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q51801055> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P175>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1303> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which {melodic instrument} of {artist} is utilized on {A Subject from The Threepenny Musical drama} ?",
    "answers": [
      "trumpet",
      "cornet",
      "voice"
    ]
  },
  {
    "NNQT_question": "What is the {candlepin bowling} for {member of} of {University of Florida}",
    "uid": 31784,
    "subgraph": "simple question right",
    "template_index": 2495,
    "question": "The University of Florida is a member of which candlepin bowling?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q501758 wdt:P463 ?obj . ?obj wdt:P31 wd:Q5031973 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name the candlepin bowling having the University of Florida as member.",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q501758 wdt:P463 ?obj . ?obj wdt:P31 wd:Q124964 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Marco Polo} has {spouse} as {auto racing} ?",
    "uid": 31492,
    "subgraph": "statement_property",
    "template_index": 395,
    "question": "When did Marco Polo marry auto racing?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q6101 p:P26 ?s . ?s ps:P26 wd:Q5386 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When auto racing married Marco Polo",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q6101 p:P26 ?s . ?s ps:P26 wd:Q3713678 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {place of birth} of {Jamshid Mashayekhi}, that has {twinned administrative body} is {New York City} ?",
    "uid": 30399,
    "subgraph": "right-subgraph",
    "template_index": 1382,
    "question": "When is the location born in Jamshid Mashayekhi which is a partner town of New York City?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3026288 wdt:P19 ?answer . ?answer wdt:P190 wd:Q60}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "When is the area born in Jamshid Mashayekhi which may be a accomplice town of New York City?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q3026288 wdt:P19 ?answer . ?answer wdt:P190 wd:Q1563}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {present in work} of {Deadpool} that is {subject has role} is {dojikko} ?",
    "uid": 31343,
    "subgraph": "statement_property",
    "template_index": 2567,
    "question": "Who plays the current role of the dojikko in Deadpool?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1631090 p:P1441 ?s . ?s ps:P1441 ?obj . ?s pq:P2868 wd:Q164896 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What dojikko plays the currect role of Deadpool?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q1631090 p:P1441 ?s . ?s ps:P1441 ?obj . ?s pq:P2868 wd:Q3246821 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {lakes on river} are to/by {Lake Urmia} ?",
    "uid": 2140,
    "subgraph": "statement_property",
    "template_index": 1484,
    "question": "How many rivers and lakes are connected to Lake Urmia?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P469 wd:Q199551 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P469> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q199551 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Can you tell me the amount of lakes are rivers attached to Lake Urmia?",
    "answers": [
      "3"
    ]
  },
  {
    "NNQT_question": "What is the {historical period} for {day of week} of {Ancient Rome}",
    "uid": 31852,
    "subgraph": "simple question right",
    "template_index": 668,
    "question": "What historical period constituted Ancient Rome days of week ?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q1747689 wdt:P2894 ?obj . ?obj wdt:P31 wd:Q11514315 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What chronicled period was Antiquated Rome day of week ?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q1747689 wdt:P2348 ?obj . ?obj wdt:P31 wd:Q11514315 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nominated for} of {Douglas Adams} that is {statement is subject of} is {57th Academy Awards} ?",
    "uid": 31351,
    "subgraph": "statement_property",
    "template_index": 303,
    "question": "What was Douglas Adams nominated for in the 57th academy awards?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q42 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q427425 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "When Douglas Adams was nominated at the 57th academy awards, what category was the nomination for?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q181936 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q427425 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {theater} for {Thésaurus de la désignation des œuvres architecturales et des espaces aménagés ID} of {Frank Gehry}",
    "uid": 30290,
    "subgraph": "simple question left",
    "template_index": 3510,
    "question": "What theater is Frank Gehry Thésaurus de la désignation des œuvres architecturales et des espaces aménagés ID?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P4980 wd:Q180374 . ?sbj wdt:P31 wd:Q24354 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the theater that is Frank Gehry Thésaurus de la désignation des œuvres architecturales et des espaces aménagés ID",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P84 wd:Q180374 . ?sbj wdt:P31 wd:Q24354 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {constraint scope} of {Grand Theft Auto V}",
    "uid": 30892,
    "subgraph": "center",
    "template_index": 3825,
    "question": "What is the constraint scope of Grand Theft Auto V?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q17452 wdt:P4680 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q17452 wdt:P2769 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {significant event} of {legislative committee} of {SS Naronic} ?",
    "uid": 30557,
    "subgraph": "left-subgraph",
    "template_index": 360,
    "question": "What happened to the SS Naronic legislative committee?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1298146 wdt:P7727 ?X . ?X wdt:P793 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "When happened to the SS Naronic legislative committee?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1298146 wdt:P137 ?X . ?X wdt:P793 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {county seat} of {Lan Xang}, that has {STD code} is {071} ?",
    "uid": 12959,
    "subgraph": "right-subgraph",
    "template_index": 9,
    "question": "Which county seat of Lan Xang has STD code of 071?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q853477 wdt:P36 ?answer . ?answer wdt:P473 ?x FILTER(contains(?x,'071'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q853477> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P36>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P473> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <071> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which province situate of Lan Xang has STD code of 071?",
    "answers": [
      "Luang Prabang"
    ]
  },
  {
    "NNQT_question": "What is {award received} of {Brokeback Mountain} that is {for color scheme} is {78th Academy Awards} ?",
    "uid": 31383,
    "subgraph": "statement_property",
    "template_index": 3609,
    "question": "What award did Brokeback Mountain receive in the 78th Academy Awards color scheme?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q160618 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P8798 wd:Q319132 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which Oscar color scheme did Brokeback Mountain get?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q160618 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q319132 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {head of government} of {State of Palestine} that is {start time} is {2014-6-2} ?",
    "uid": 7104,
    "subgraph": "statement_property",
    "template_index": 3549,
    "question": "Who was the head of government in Palestine on June 2, 2014?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q219060 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2014')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q219060> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P6> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <2014-6-2>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "On June 2, 2014 who was the leader of Palestine?",
    "answers": [
      "Rami Hamdallah"
    ]
  },
  {
    "NNQT_question": "What is the {human settlement} for {patron saint} of {Rimini}",
    "uid": 30230,
    "subgraph": "simple question left",
    "template_index": 3918,
    "question": "What is the human settlement that is the patron saint of Rimini?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P417 wd:Q13369 . ?sbj wdt:P31 wd:Q486972 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the human settlement that is the patron saint of Rimini",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P417 wd:Q128267 . ?sbj wdt:P31 wd:Q486972 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {PO Box} of {forestry}",
    "uid": 30882,
    "subgraph": "center",
    "template_index": 2223,
    "question": "What is the PO Box of forestry ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q38112 wdt:P2918 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q38112 wdt:P3242 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {SAHRA heritage site ID} of {Onjo}",
    "uid": 30851,
    "subgraph": "center",
    "template_index": 2772,
    "question": "Which is the SAHRA heritage site ID for Onjo?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q497285 wdt:P3759 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q951305 wdt:P3759 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {sidekick of} of {David Lloyd George} and {elected in}",
    "uid": 31999,
    "subgraph": [],
    "template_index": 894,
    "question": "What sidekick does David Lloyd George have?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q134982 p:P2546 ?s . ?s ps:P2546 ?obj . ?s pq:P2715 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What is David Lloyd George's sidekick?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q134982 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {performer} of {followed by} of {Anaheim} ?",
    "uid": 30498,
    "subgraph": "left-subgraph",
    "template_index": 86,
    "question": "Who Anaheim, California succeeded in playing Anaheim, California?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q49247 wdt:P156 ?X . ?X wdt:P175 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who Anaheim, California succeeded in playing Anaheim, California?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q7539946 wdt:P156 ?X . ?X wdt:P175 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {population} of {Guinea} that is {point in time} is {1961-0-0} ?",
    "uid": 8159,
    "subgraph": "statement_property",
    "template_index": 4604,
    "question": "What was the population of Guinea in 1961?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1006 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1961')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1006> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1961-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1961, what was the population of Guinea?",
    "answers": [
      "3632778"
    ]
  },
  {
    "NNQT_question": "What is {member of sports team} of {George Washington} and {number of matches played/races/starts}",
    "uid": 32026,
    "subgraph": [],
    "template_index": 351,
    "question": "What sports team did George Washington belong to and how many matches did they play?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q23 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What sports group did George Washington have a place to and how numerous matches did they play?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q336916 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {author} of {cites work} of {New minerals from former Soviet Union countries, 1998-2006: minerals restored in the status of individual species in the period of 1998-2006} ?",
    "uid": 30597,
    "subgraph": "left-subgraph",
    "template_index": 12539,
    "question": "Who is {writer} of {bibliographic citation} of {New minerals from former Soviet Union countries, 1998-2006: minerals restored in the status of individual species in the period of 1998-2006} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q17457049 wdt:P2860 ?X . ?X wdt:P50 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "The bibliographic citation of New minerals from former Soviet Union countries, 1998-2006: minerals restored in the status of individual species in the period of 1998-2006 was written by whom?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q24645644 wdt:P2860 ?X . ?X wdt:P50 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {angular diameter} of {Marie Curie} that is {point in time} is {1911-01-01} ?",
    "uid": 31323,
    "subgraph": "statement_property",
    "template_index": 2704,
    "question": "What angular diameter did Marie Curie have in 1911?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q7186 p:P5348 ?s . ?s ps:P5348 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1911')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1911 what angular diameter did Marie Curie have?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q7186 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1911')) }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {habitat} of {found in species} of {hypothetical protein ECIAI39_4120} ?",
    "uid": 16243,
    "subgraph": "left-subgraph",
    "template_index": 32125,
    "question": "what is hypothetical protein ecia139-4120 habitat of found in species?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q22226273 wdt:P703 ?X . ?X wdt:P2974 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q22226273> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P703>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2974> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which species is the ecia139-4120 protein found in?",
    "answers": [
      "vagina"
    ]
  },
  {
    "NNQT_question": "What is the {architect} and the {heritage designation} of {Palace_of_Westminster} ?",
    "uid": 10093,
    "subgraph": "two intentions right subgraph",
    "template_index": 262,
    "question": "What is Palace of Westminster's architect and heritage designation?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q62408 wdt:P84 ?ans_1 . wd:Q62408 wdt:P1435 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q62408> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P84> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q62408> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1435> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Tell me the architect and heritage designation of Westminster Palace.",
    "answers": [
      "Charles Barry",
      "Grade I listed building"
    ]
  },
  {
    "NNQT_question": "Give me {cryptocurrency} that {stock exchange} {Bitfinex} and which contains the word {neo} in their name",
    "uid": 25107,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1709,
    "question": "Tell me me a cryptocurrenc whose name consist of the word \"neo\" and whose stock exchange bitfinex",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13479982 . ?sbj wdt:P414 wd:Q29647473 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'neo')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q13479982>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P414> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q29647473>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'neo')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Tell me me a cryptocurrenc whose title consist of the phrase \"neo\" and whose stock change bitfinex",
    "answers": [
      "NEO"
    ]
  },
  {
    "NNQT_question": "How many {Library of Congress authority ID} are for {ethyl acetate} ?",
    "uid": 31712,
    "subgraph": "statement_property",
    "template_index": 338,
    "question": "How many Library of Congress authority IDs are there for ethyl acetate?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q407153 wdt:P244 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "ethyl acetate includes how many Library of Congress authority IDs?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q407153 wdt:P3013 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {academic major} and {academic degree} of {{Robert J. Shiller} has {educated at} as {Massachusetts Institute of Technology}}",
    "uid": 10210,
    "subgraph": [],
    "template_index": 5,
    "question": "na",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q338151 p:P69 ?s . ?s ps:P69 wd:Q49108 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }",
    "sparql_dbpedia18": "select distinct ?value1 ?value2 where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q338151> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P69> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q49108>. ?statement <http://www.wikidata.org/entity/P580> ?value1 . ?statement <http://www.wikidata.org/entity/P2842> ?value2 } ",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "na",
    "answers": [
      "economics",
      "Doctor of Philosophy"
    ]
  },
  {
    "NNQT_question": "How many {country of citizenship} are for {Antonio José de Sucre Farell} ?",
    "uid": 1482,
    "subgraph": "statement_property",
    "template_index": 482,
    "question": "How many country citizenship are taken by Antonio José de Sucre Farell?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q189779 wdt:P27 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q189779> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P27> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Antionio Jose De Sucre Farell took how many country Citizenships?",
    "answers": [
      "2"
    ]
  },
  {
    "NNQT_question": "Give me {Nguni languages} that contains the word {zulu} in their name",
    "uid": 31238,
    "subgraph": "string matching simple contains word",
    "template_index": 1693,
    "question": "What are the Nguni languages which start with the letter zulu",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q961559 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zulu')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the Nguni languages which start with the letter zulu",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33146 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zulu')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {twinned administrative body} of {location of formation} of {Gomattō} ?",
    "uid": 30620,
    "subgraph": "right-subgraph",
    "template_index": 618,
    "question": "What town is twinned with Gomattō?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1198821 wdt:P740 ?X . ?X wdt:P190 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which town has Gomattō twinned?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q171885 wdt:P740 ?X . ?X wdt:P190 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Alice Munro} and {house publication}",
    "uid": 32004,
    "subgraph": [],
    "template_index": 697,
    "question": "When did award received of Alice Munro and house publication?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q234819 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2813 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "When did award received of Alice Munro and house publication?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q234819 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P156 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {made from material} and the {approved by} of {Rajpur Sonarpur} ?",
    "uid": 31943,
    "subgraph": "two intentions right subgraph",
    "template_index": 427,
    "question": "What is the material used and approved by Rajpur Sonarpur?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q261988 wdt:P186 ?ans_1 . wd:Q261988 wdt:P790 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What is the material used and accredited by means of Rajpur Sonarpur?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q487338 wdt:P186 ?ans_1 . wd:Q487338 wdt:P790 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  }
]