[
  {
    "NNQT_question": "What is {guilty of} of {presented by} of {Paris Hilton's My New BFF} ?",
    "uid": 17973,
    "subgraph": "left-subgraph",
    "template_index": 771,
    "question": "Who is guilty for Paris Hilton's My New BFF being presented?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1513736 wdt:P371 ?X . ?X wdt:P1399 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1513736> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P371>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1399> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is blameworthy for Paris Hilton's My Unused BFF being presented?",
    "answers": [
      "driving under the influence",
      "possession of a controlled substance"
    ]
  },
  {
    "NNQT_question": "What is {parent company of} of {alumnus of} of {Virgil Thomson} ?",
    "uid": 15500,
    "subgraph": "right-subgraph",
    "template_index": 5867,
    "question": "What college did Virgil Thomson attend?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q544485 wdt:P69 ?X . ?X wdt:P355 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q544485> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P69>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P355> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Where did Virgil Thomson attend college?",
    "answers": [
      "Harvard Medical School",
      "Harvard Law School",
      "Harvard Business School",
      "John F. Kennedy School of Government",
      "Center for Hellenic Studies",
      "Harvard–Smithsonian Center for Astrophysics",
      "Dumbarton Oaks",
      "Harvard University Press",
      "Harvard Museum of Natural History",
      "Harvard Graduate School of Design",
      "Harvard University Center for Italian Renaissance Studies",
      "Harvard Art Museums",
      "Fairbank Center for Chinese Studies",
      "Harvard University Faculty of Arts and Sciences",
      "Harvard Management Company",
      "Phillip T. and Susan M. Ragon Institute",
      "W. E. B. Du Bois Research Institute",
      "Harvard Division of Continuing Education",
      "Sleep and Human Health Institute",
      "Center for Systems Biology",
      "Berenson Allen Center for Noninvasive Brain Stimulation",
      "Center for Vascular Biology Research",
      "FAS Center for Systems Biology, Harvard University",
      "Edmond J. Safra Center for Ethics, Harvard University",
      "Society of Fellows, Harvard University",
      "Weatherhead Center for International Affairs, Harvard University",
      "Harvard Transdisciplinary Research in Energetics and Cancer Center, Harvard University",
      "Global Health and Health Policy, Harvard University",
      "Mahindra Humanities Center, Harvard University",
      "Center for Arabic Study Abroad, Harvard University Center for Middle Eastern Studies",
      "Davis Center for Russian and Eurasian Studies, Harvard University",
      "Harvard Athletic Association"
    ]
  },
  {
    "NNQT_question": "What is {number of points/goals/set scored} of {member of sports team} of {Gerry Brisson} ?",
    "uid": 30646,
    "subgraph": "left-subgraph",
    "template_index": 2467,
    "question": "How many number of points Captain Gerry Brisson plays for?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q746901 wdt:P54 ?X . ?X wdt:P1351 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Captain Gerry Brisson plays for what number of points?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q746901 wdt:P54 ?X . ?X wdt:P634 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {region of France} for {coextensive with} of {Mizoram}",
    "uid": 30274,
    "subgraph": "simple question left",
    "template_index": 153,
    "question": "What region of France is coextensive with Mizoram?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P3403 wd:Q1502 . ?sbj wdt:P31 wd:Q36784 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What French region is coextensive with Mizoram?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P3403 wd:Q1502 . ?sbj wdt:P31 wd:Q57156205 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {child} {Greek deity} that starts with {'z'}",
    "uid": 31250,
    "subgraph": "string matching simple contains word",
    "template_index": 1996,
    "question": "What are the child of Greek deity which start with the letter Z",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P40 wd:Q22989102 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the child of Greek divinity which begin with the letter Z",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22989102 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {presenter} of {Meet the Press} that is {start time} is {1984-9-16} ?",
    "uid": 7049,
    "subgraph": "statement_property",
    "template_index": 3494,
    "question": "Who was the presenter for Meet the Press starting on September 16, 1984?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1543066 p:P371 ?s . ?s ps:P371 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1984')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1543066> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P371> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1984-9-16>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Who served as the moderator for Meet the Press beginning September 16, 1984?",
    "answers": [
      "Roger Mudd"
    ]
  },
  {
    "NNQT_question": "What is the {religious text} for {shear modulus} of {Exodus}",
    "uid": 30297,
    "subgraph": "simple question left",
    "template_index": 3991,
    "question": "Which religious text was Exodus shear modulus?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P5673 wd:Q9190 . ?sbj wdt:P31 wd:Q179461 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which shear modulus did Mass migration follow?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P156 wd:Q9190 . ?sbj wdt:P31 wd:Q179461 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Pablo Neruda} has {nominated for} as {National Prize for Literature} ?",
    "uid": 31660,
    "subgraph": "statement_property",
    "template_index": 2656,
    "question": "When was Pablo Neruda nominated for the National Prize for Literature?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q34189 p:P1411 ?s . ?s ps:P1411 wd:Q860699 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "At which point in time did Pablo Neruda was nominated for the National Prize for Literature?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q34189 p:P166 ?s . ?s ps:P166 wd:Q860699 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {venue} of {Romania during World War I}, that has {diplomatic relation} is {Israel} ?",
    "uid": 14212,
    "subgraph": "right-subgraph",
    "template_index": 266,
    "question": "Name the venue in Romania that had diplomatic relations in Israel during World War I.",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q553157 wdt:P276 ?answer . ?answer wdt:P530 wd:Q801}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q553157> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P276>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P530> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q801> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Title the scene in Romania that had discretionary relations in Israel amid World War I.",
    "answers": [
      "Romania"
    ]
  },
  {
    "NNQT_question": "Give me {measurement scale} {biogeochemical cycle} that contains the word {cycle} in their name",
    "uid": 31167,
    "subgraph": "string matching simple contains word",
    "template_index": 1254,
    "question": "Tell me the thing using biogeochemical cycle as measurement scale whose name has the word cycle in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P1880 wd:Q846303 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cycle')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me about the element using biogeochemical cycle as measurement scale whose name contains the word cycle.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q846303 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cycle')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {farthest north} of {place held} of {Balkans Campaign} ?",
    "uid": 17140,
    "subgraph": "right-subgraph",
    "template_index": 635,
    "question": "Which  is farthest north of place held by Balkans Campaign?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q789406 wdt:P276 ?X . ?X wdt:P1332 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q789406> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P276>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1332> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is most remote north of put held by Balkans Campaign?",
    "answers": [
      "Point(26.7 48.27)",
      "Point(22.67 44.22)",
      "Point(19.67 46.18)"
    ]
  },
  {
    "NNQT_question": "What is the {applies to part} for {Augustus II the Strong} has {place of burial} as {Ponta Delgada} ?",
    "uid": 31493,
    "subgraph": "statement_property",
    "template_index": 3009,
    "question": "What was Augustus II the Strong part buried in Ponta Delgada?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q53437 p:P119 ?s . ?s ps:P119 wd:Q208149 . ?s pq:P518 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Tell me what is Augustus II the Strong part buried in Ponta Delgada.",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q53437 p:P119 ?s . ?s ps:P119 wd:Q666935 . ?s pq:P518 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Nobel prize ID} of {Laocoön and His Sons}",
    "uid": 30953,
    "subgraph": "center",
    "template_index": 2855,
    "question": "What is Nobel prize ID of Laocoön and His Sons?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q465762 wdt:P3188 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q465762 wdt:P4380 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Carlos Menem} that is {point in time} is {2015-01-01} ?",
    "uid": 31270,
    "subgraph": "statement_property",
    "template_index": 1995,
    "question": "What award did Carlos Menem receive in 2015?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q185107 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2015')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Carlos Menem was the winner of what award in 2015?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q254032 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2015')) }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {location of first performance} of {Martin McGuinness}, that has {followed by} is {Member of the 55th Parliament of the United Kingdom} ?",
    "uid": 30377,
    "subgraph": "right-subgraph",
    "template_index": 2059,
    "question": "What is the location of first performance of Martin McGuinness, which has been followed by the Member of the 55th Parliament of the United Kingdom?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q57689 wdt:P4647 ?answer . ?answer wdt:P156 wd:Q35494253}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is Martin McGuinnes' location of first performance, which was the prequel of the Member of the 55th Parliament of the UK?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q57689 wdt:P39 ?answer . ?answer wdt:P156 wd:Q35494253}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Federal Agency for Rail Transport} has {director / manager} as {Yuri Koptev} ?",
    "uid": 31612,
    "subgraph": "statement_property",
    "template_index": 3231,
    "question": "When did Yuri Koptev start as the manager and director of the Federal Agency for Rail Transport?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q4481706 p:P1037 ?s . ?s ps:P1037 wd:Q2895091 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Yuri Koptev serve as manager and director for Federal Agency for Rail Transport?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q190795 p:P1037 ?s . ?s ps:P1037 wd:Q2895091 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {city or town} for {enclave within} of {Arminius}",
    "uid": 30238,
    "subgraph": "simple question left",
    "template_index": 3672,
    "question": "Tell me the city which is enclaved within Arminius.",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P501 wd:Q68880 . ?sbj wdt:P31 wd:Q27676416 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Let me know the city which is enclaved inside Arminius.",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P501 wd:Q340 . ?sbj wdt:P31 wd:Q27676416 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Kylie Minogue} has {award received} as {Élie Lescot} ?",
    "uid": 31480,
    "subgraph": "statement_property",
    "template_index": 57,
    "question": "When did Kylie Minogue receive the Élie Lescot?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q11998 p:P166 ?s . ?s ps:P166 wd:Q274660 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "On what date did Kylie Minogue receive the Élie Lescot?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q11998 p:P166 ?s . ?s ps:P166 wd:Q16191288 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {league} of {record or record progression} of {Jurandir Fatori} ?",
    "uid": 30569,
    "subgraph": "left-subgraph",
    "template_index": 8478,
    "question": "What division does Jurandir Fatori's record for?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q21020118 wdt:P2869 ?X . ?X wdt:P118 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Name the division for which Jurandir Fatori has record.",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q21020118 wdt:P54 ?X . ?X wdt:P118 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {subclass of} {comedic genre} that starts with {'s'}",
    "uid": 31249,
    "subgraph": "string matching simple contains word",
    "template_index": 3367,
    "question": "What are the subclass of comedic genre which start with the letter s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P279 wd:Q5151404 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the subclass of comedic class which begin with the letter s",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5151404 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {population} of {Taguig} that is {determination method} is {Tilburg} ?",
    "uid": 31269,
    "subgraph": "statement_property",
    "template_index": 5802,
    "question": "What method did the Tilburg use to determine the population of Taguig?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1643 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q26430 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "wich method was used by the Tilburg to determine the population of Taguig?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q1643 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Douban film ID} of {Raiders of the Lost Ark}",
    "uid": 31055,
    "subgraph": "center",
    "template_index": 2243,
    "question": "What is the Douban film ID of the movie Raiders of the Lost Ark?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q174284 wdt:P4529 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q174284 wdt:P3593 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {start time} and {winner} of {Neil Gaiman} has {award received} as {Hugo Award for Best Dramatic Presentation (Long Form)}",
    "uid": 32093,
    "subgraph": [],
    "template_index": 60,
    "question": "From when did Neil Gaiman receive his award for Hugo?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q210059 p:P166 ?s . ?s ps:P166 wd:Q1056240 . ?s pq:P580 ?value1 . ?s pq:P1346 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "From when did Neil Gaiman get his award for Hugo?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q210059 p:P166 ?s . ?s ps:P166 wd:Q1056240 . ?s pq:P585 ?value1 . ?s pq:P1346 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located in the administrative territorial entity} of {residence} of {Julius Bien} ?",
    "uid": 30701,
    "subgraph": "right-subgraph",
    "template_index": 1023,
    "question": "Julius Bien lives in what administrative location?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q111094 wdt:P551 ?X . ?X wdt:P131 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Give me the administrative location of where Julius Bien is currently living in.",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q228822 wdt:P551 ?X . ?X wdt:P131 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {drafted by} of {Somalia}",
    "uid": 30776,
    "subgraph": "center",
    "template_index": 750,
    "question": "Who is drafted by Somalia?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P647 wd:Q1045}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P647 wd:Q131371}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {SSDN} that contains the word {state} in their name",
    "uid": 31191,
    "subgraph": "string matching simple contains word",
    "template_index": 2320,
    "question": "Tell me  SSDN whose name has the word state in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12334303 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'state')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know SSDN whose title has the word state in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3238445 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'state')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {place of birth} of {Natalia Molchanova} that is {located in the administrative territorial entity} is {Bashkir Autonomous Soviet Socialist Republic} ?",
    "uid": 7572,
    "subgraph": "statement_property",
    "template_index": 4017,
    "question": "Was Natalia Molchanova born in the Bashkir Autonomous Soviet Socialist Republic?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q59920 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q809806 }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q59920> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P131> <http://wikidata.dbpedia.org/resource/Q809806>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Was the Bashkir Autonomous Soviet Socialist Republic the birthplace of Natalia Molchanova?",
    "answers": [
      "Ufa"
    ]
  },
  {
    "NNQT_question": "What is {country} of {Samuel Butler}, that has {twinned administrative body} is {Jakarta} ?",
    "uid": 30430,
    "subgraph": "right-subgraph",
    "template_index": 1682,
    "question": "What is the country, whose partner city is Jakarta, of Samuel Butler?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q258766 wdt:P17 ?answer . ?answer wdt:P190 wd:Q3630}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the country, whose partner metropolis is Jakarta, of Samuel Butler?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q258766 wdt:P20 ?answer . ?answer wdt:P190 wd:Q3630}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {educated at} of {Al-Waleed bin Talal} that is {member of sports team} is {Master of Science} ?",
    "uid": 31373,
    "subgraph": "statement_property",
    "template_index": 547,
    "question": "What is the Master of Science member of sports team of Al-Waleed bin Talal?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q293679 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P54 wd:Q950900 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Al-Waleed bin Talal has obtained which Master of Science member of sports team?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q293679 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 wd:Q950900 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {student} are for {Jacques-Louis David} ?",
    "uid": 1475,
    "subgraph": "statement_property",
    "template_index": 475,
    "question": "How many students does Jacques-Louis David teach?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q83155 wdt:P802 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q83155> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P802> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Give me the number of students Jacques David teaches.",
    "answers": [
      "25"
    ]
  },
  {
    "NNQT_question": "How many {points classification} are to/by {Yuri Trofimov} ?",
    "uid": 31760,
    "subgraph": "statement_property",
    "template_index": 1002,
    "question": "Yuri Trofimov has how many points classifications?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3494 wd:Q32301 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Provide the number of points classifications for Yuri Trofimov.",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3494 wd:Q319591 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {academic major} for {interested in} of {Claude Shannon}",
    "uid": 31881,
    "subgraph": "simple question right",
    "template_index": 531,
    "question": "Claude Shannon was interested in what academic major?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q92760 wdt:P2650 ?obj . ?obj wdt:P31 wd:Q4671286 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name Claude Shannon interests about academic majors.",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q92760 wdt:P101 ?obj . ?obj wdt:P31 wd:Q4671286 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]