[
  {
    "NNQT_question": "What is {made of} of {maker of} of {tea house} ?",
    "uid": 15229,
    "subgraph": "right-subgraph",
    "template_index": 2,
    "question": "What is the tea house made of according to the creator?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1072166 wdt:P1056 ?X . ?X wdt:P186 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1072166> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1056>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P186> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "According to the creator tea house is made of which particle?",
    "answers": [
      "water",
      "sugar",
      "caffeine",
      "tannin",
      "warm water",
      "tea leaves"
    ]
  },
  {
    "NNQT_question": "What is {domain} of {aspect of} of {bodhisattva} ?",
    "uid": 14330,
    "subgraph": "right-subgraph",
    "template_index": 9,
    "question": "What domain has the aspect of bodhisattva?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q178149 wdt:P1269 ?X . ?X wdt:P2579 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q178149> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1269>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2579> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which domain has the bodhisattva aspect?",
    "answers": [
      "Buddhist studies"
    ]
  },
  {
    "NNQT_question": "What is the {nonprofit organization} with the {MAX(central bank/issuer)} ?",
    "uid": 31084,
    "subgraph": "rank",
    "template_index": 311,
    "question": "Which nonprofit organization has the highest issuer?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q163740 . ?ent wdt:P562 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "Give me the nonprofit organization with highest issuer.",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q163740 . ?ent wdt:P2402 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {coordinates of geographic center} of {Patanjali} that is {determination method} is {center of gravity of the surface} ?",
    "uid": 31268,
    "subgraph": "statement_property",
    "template_index": 3830,
    "question": "What are the coordinates for the geographic center of Patanjali, as determined by the center of gravity of the surface?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q231680 p:P5140 ?s . ?s ps:P5140 ?obj . ?s pq:P459 wd:Q53329492 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Where is the geographic center of Patanjali using the gravity center of the surface?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q1166 p:P5140 ?s . ?s ps:P5140 ?obj . ?s pq:P459 wd:Q53329492 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {dissolved, abolished or demolished date} of {term length of office} of {Calvin Harris} ?",
    "uid": 30634,
    "subgraph": "right-subgraph",
    "template_index": 2933,
    "question": "What date disbanded for term length of office of Calvin Harris ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q81637 wdt:P2097 ?X . ?X wdt:P576 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "on what date was the term length of office of Calvin Harris disbanded?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q81637 wdt:P264 ?X . ?X wdt:P576 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {ticker symbol} of {Malcolm Allison}, that has {shares border with} is {Purfleet-on-Thames} ?",
    "uid": 30394,
    "subgraph": "right-subgraph",
    "template_index": 2436,
    "question": "Which is the ticker symbol of Malcolm Allison, that is bordered by Purfleet?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1383862 wdt:P249 ?answer . ?answer wdt:P47 wd:Q1972020}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which is the ticker symbol of Malcolm Allison, that is bordered by way of Purfleet?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1383862 wdt:P19 ?answer . ?answer wdt:P47 wd:Q1972020}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Nguni languages} that starts with {'z'}",
    "uid": 31232,
    "subgraph": "string matching simple contains word",
    "template_index": 2453,
    "question": "Which are the Nguni languages which start with letter z?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q961559 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which are the Nguni dialects which begin with letter z?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33146 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {semimonthly} that starts with {'z'}",
    "uid": 31193,
    "subgraph": "string matching simple contains word",
    "template_index": 3530,
    "question": "which semimonthly starts with z",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2903810 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "which semimonthly begins with z",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41298 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Yukon Quest} with the {MIN(size of team at finish)} whose {location} is {Mojo Bones OV} ?",
    "uid": 31114,
    "subgraph": "rank",
    "template_index": 451,
    "question": "Name the Yukon quest with the minimum size of team at finish whose location is Mojo Bones OV?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q2301224 . ?ent wdt:P2105 ?obj . ?ent wdt:P276 wd:Q49199194. } ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Which Yukon quest in Mojo Bones OV finished with the smallest size team?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q2301224 . ?ent wdt:P2105 ?obj . ?ent wdt:P276 wd:Q4955299. } ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {legislative act} for {foundational text} of {Transcaucasian Socialist Federative Soviet Republic}",
    "uid": 31858,
    "subgraph": "simple question right",
    "template_index": 220,
    "question": "Which is the statue for the foundational text of Transcaucasian Socialist Federative Soviet Republic?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q545205 wdt:P457 ?obj . ?obj wdt:P31 wd:Q820655 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What legislative act is the main text of the foundation of the Transcaucasian Socialist Federative Soviet Republic?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q15180 wdt:P457 ?obj . ?obj wdt:P31 wd:Q820655 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {composer} of {The Rite of Spring}, that has {coordinates of southernmost point} is {New York City} ?",
    "uid": 30437,
    "subgraph": "right-subgraph",
    "template_index": 487,
    "question": "Who's coordinates of southernmost point is New York City and made the musical score from The Rite of Spring?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q206015 wdt:P86 ?answer . ?answer wdt:P1333 wd:Q60}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who's coordinates of southernmost point is Modern York City and made the melodic score from The Ceremony of Spring?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q206015 wdt:P86 ?answer . ?answer wdt:P551 wd:Q60}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {cryptocurrency} that {parent (unspecified)} {Bitfinex} and which contains the word {neo} in their name",
    "uid": 31908,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1709,
    "question": "Tell me me a cryptocurrenc whose name consist of the word \"neo\" and whose parent is bitfinex",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13479982 . ?sbj wdt:P8810 wd:Q29647473 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'neo')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Tell me me a cryptocurrenc whose title consist of the phrase \"neo\" and whose parent is bitfinex",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13479982 . ?sbj wdt:P414 wd:Q29647473 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'neo')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {architectural style} {Mahavidya} that contains the word {tara} in their name",
    "uid": 31214,
    "subgraph": "string matching simple contains word",
    "template_index": 149,
    "question": "Tell me object following Mahavidya architectural style whose name has the word tara in it",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P149 wd:Q1076022 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tara')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me thing following Mahavidya architectural style whose name contains the word tara.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1076022 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tara')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {end time} for {Auckland} has {head of government} as {Len Brown} ?",
    "uid": 4613,
    "subgraph": "statement_property",
    "template_index": 1058,
    "question": "When was Len Brown's last year as the mayor of Auckland?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q37100 p:P6 ?s . ?s ps:P6 wd:Q4116955 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q37100> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P6> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q4116955> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was the year that Len Brown left as mayor of Auckland?",
    "answers": [
      "2016-10-08T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is the {corollary} for {proved by} of {Grigori Perelman}",
    "uid": 30268,
    "subgraph": "simple question left",
    "template_index": 447,
    "question": "What corollary did Grigori Perelman prove?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1318 wd:Q117346 . ?sbj wdt:P31 wd:Q1343870 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What was Grigori Perelman's proven corollary?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1318 wd:Q117346 . ?sbj wdt:P31 wd:Q65943 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {service branch} of {consort} of {Myrna Loy} ?",
    "uid": 14877,
    "subgraph": "right-subgraph",
    "template_index": 982,
    "question": "In the consort of Myrna Loy, what is the service branch?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q105941 wdt:P26 ?X . ?X wdt:P241 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q105941> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P241> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "WHAT IS THE SERVICE BRANCH OF MYRNA LOY",
    "answers": [
      "United States Navy"
    ]
  },
  {
    "NNQT_question": "What is {has surname} of {Mireille Mathieu}, that has {similar to} is {Matías} ?",
    "uid": 13737,
    "subgraph": "right-subgraph",
    "template_index": 1796,
    "question": "Who has surname as Mireille Mathieu and similar to Matias?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q71452 wdt:P734 ?answer . ?answer wdt:P460 wd:Q29905256}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q71452> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P734>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P460> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q29905256> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who has surname as Mireille Mathieu and comparable to Matias?",
    "answers": [
      "Mathieu"
    ]
  },
  {
    "NNQT_question": "What is the {soccer competition} with the {MIN(display technology)} whose {competition class} is {women's association football} ?",
    "uid": 31104,
    "subgraph": "rank",
    "template_index": 419,
    "question": "Name the women's association football team who played the least display technology.",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q1478437 . ?ent wdt:P5307 ?obj . ?ent wdt:P2094 wd:Q606060. } ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Who played the least display technology, is what women's association football team?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q1478437 . ?ent wdt:P2257 ?obj . ?ent wdt:P2094 wd:Q606060. } ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {patron saint} of {place of death} of {Bashar al-Assad} ?",
    "uid": 30514,
    "subgraph": "left-subgraph",
    "template_index": 35623,
    "question": "Which is the patron saint of the place of death of Bashar al-Assad?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q44329 wdt:P20 ?X . ?X wdt:P417 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which is the benefactor holy person of the put of passing of Bashar al-Assad?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q3617854 wdt:P20 ?X . ?X wdt:P417 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {using} of {condensation}, that has {prequel of} is {plasma state of matter} ?",
    "uid": 14023,
    "subgraph": "right-subgraph",
    "template_index": 18,
    "question": "What prequel of plasma state of matter is using condensation?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q166583 wdt:P2283 ?answer . ?answer wdt:P156 wd:Q29148313}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q166583> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2283>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P156> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q29148313> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What's in the Cosmodrome Baikonur shire?",
    "answers": [
      "gaseous state of matter"
    ]
  },
  {
    "NNQT_question": "What is {foreign direct investment net inflow} of {participant in} of {Gustav Winckler} ?",
    "uid": 30572,
    "subgraph": "left-subgraph",
    "template_index": 66,
    "question": "Which is the foreign direct investment net inflow that Gustav Winckler took part of?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q715063 wdt:P1344 ?X . ?X wdt:P2141 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the foreign direct investment net inflow that Gustav Wincklet took part of?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q715063 wdt:P1344 ?X . ?X wdt:P710 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {World Athletics athlete ID} of {Mikhail Lermontov}",
    "uid": 31033,
    "subgraph": "center",
    "template_index": 2532,
    "question": "Which is the World Athletics athlete ID for Mikhail Lermontov?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q46599 wdt:P1146 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q46599 wdt:P2510 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {operator} and the {manufacturer} of {Bombardier_Dash_8} ?",
    "uid": 10135,
    "subgraph": "two intentions right subgraph",
    "template_index": 409,
    "question": "Who is the operator and builder of the Bombardier Dash 8?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q736765 wdt:P137 ?ans_1 . wd:Q736765 wdt:P176 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q736765> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P137> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q736765> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P176> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Who built and operated the Bombardier Dash 8?",
    "answers": [
      "de Havilland Canada",
      "British Airways",
      "Bombardier",
      "British Airways",
      "de Havilland Canada",
      "Flybe",
      "Bombardier",
      "Flybe",
      "de Havilland Canada",
      "Jazz",
      "Bombardier",
      "Jazz"
    ]
  },
  {
    "NNQT_question": "What is {nominated for} of {Maria Montessori} that is {point in time} is {1950-1-1} ?",
    "uid": 4917,
    "subgraph": "statement_property",
    "template_index": 1362,
    "question": "What award was Maria Montessori nominated for on January 1, 1950?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q131117 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1950')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q131117> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1950-1-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which was the award that Maria Monessori got nominated for in 1950?",
    "answers": [
      "Nobel Peace Prize"
    ]
  },
  {
    "NNQT_question": "What is the {number of matches played/races/starts} for {François Villon} has {member of sports team} as {Mushuc runa sporting} ?",
    "uid": 31556,
    "subgraph": "statement_property",
    "template_index": 1380,
    "question": "How many matches did François Villon participate in with the A.A. Argentinos Juniors?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q849 p:P54 ?s . ?s ps:P54 wd:Q220621 . ?s pq:P1350 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "While with the A.A. Argentinos Juniors, François Villon played how many games?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q17515 p:P54 ?s . ?s ps:P54 wd:Q220621 . ?s pq:P1350 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Isidora Duncan} has {significant event} as {Frank Forde} ?",
    "uid": 31497,
    "subgraph": "statement_property",
    "template_index": 1480,
    "question": "When was Isadora Duncan's Frank Forde?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q483512 p:P793 ?s . ?s ps:P793 wd:Q459146 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "At what time did Isadora Duncan's Frank Forde take place?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q483512 p:P793 ?s . ?s ps:P793 wd:Q201676 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {KML file} of {Meleagris gallopavo}",
    "uid": 30886,
    "subgraph": "center",
    "template_index": 3885,
    "question": "Which is the KML file of Meleagris gallopavo?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q26844 wdt:P3096 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q26844 wdt:P2426 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Karl von Frisch} that is {inventory number} is {1921-01-01} ?",
    "uid": 31442,
    "subgraph": "statement_property",
    "template_index": 3961,
    "question": "What award did Karl von Frisch receive with 1921 as inventory number?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q60060 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P217 ?x filter(contains(YEAR(?x),'1921')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "With 1921 inventory number, Karl von Firsch won what award?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q60060 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1921')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {director / manager} of {Arthur M. Sackler Gallery} that is {start time} is {1910-01-01} ?",
    "uid": 31346,
    "subgraph": "statement_property",
    "template_index": 3020,
    "question": "Who was the manager/director of the Arthur M. Sackler Gallery starting in 1910?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q259767 p:P1037 ?s . ?s ps:P1037 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1910')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Starting in 1910, who was the manager/director of the Arthur M. Sackler Gallery?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q160236 p:P1037 ?s . ?s ps:P1037 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1910')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {postal code} of {residence} of {Roland Freisler} ?",
    "uid": 30706,
    "subgraph": "right-subgraph",
    "template_index": 494,
    "question": "What is the zipcode of Roland Freisler?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q57601 wdt:P551 ?X . ?X wdt:P281 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Where is the central command for Roland Freisler?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q41508 wdt:P551 ?X . ?X wdt:P281 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {memory capacity} of {Xbox One}",
    "uid": 30966,
    "subgraph": "center",
    "template_index": 2876,
    "question": "How much memory capacity does Xbox one have?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q13361286 wdt:P2928 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q13361286 wdt:P1141 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {field of this occupation} of {identity of subject in context} of {José Luis Rodríguez Zapatero} ?",
    "uid": 30578,
    "subgraph": "right-subgraph",
    "template_index": 1548,
    "question": "In what field of work does José Luis Rodríguez Zapatero have identity?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q41395 wdt:P4649 ?X . ?X wdt:P425 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "In what discipline of work does José Luis Rodríguez Zapatero have identity?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q41395 wdt:P106 ?X . ?X wdt:P425 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {number of points/goals/set scored} and {number of matches played/races/starts} of {Pedro Aguirre Cerda} has {member of sports team} as {England national association football team}",
    "uid": 32064,
    "subgraph": [],
    "template_index": 138,
    "question": "Tell me the number of points and games played by Pedro Aguirre Cerda, member of the English national football team.",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q845 p:P54 ?s . ?s ps:P54 wd:Q47762 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me how many points and games Pedro Aguirre Cerda, an English national football team member, has played.",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q207658 p:P54 ?s . ?s ps:P54 wd:Q47762 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]