[
  {
    "NNQT_question": "What is {author} of {The Adventures of Tintin}, that has {game artist} is {Officer of the Order of the Crown} ?",
    "uid": 30438,
    "subgraph": "right-subgraph",
    "template_index": 902,
    "question": "\"What written by creator of The Adventures of Tintin, has the Officer of the Order of the Crown as game artist?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q744536 wdt:P50 ?answer . ?answer wdt:P3080 wd:Q17200760}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "\"What written by way of creator of The Adventures of Tintin, has the Officer of the Order of the Crown as game artist?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q744536 wdt:P50 ?answer . ?answer wdt:P166 wd:Q17200760}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nominee for} of {Nevermind}, that has {date constructed} is {1991-0-0} ?",
    "uid": 13295,
    "subgraph": "right-subgraph",
    "template_index": 1152,
    "question": "Who is the nominee for Nevermind, that was produced on 1991-0-0?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q17444 wdt:P1411 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1991'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q17444> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P571> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <1991-0-0> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the nominee for Nevermind, that was once produced on 1991-0-0?",
    "answers": [
      "Grammy Award for Best Alternative Music Album"
    ]
  },
  {
    "NNQT_question": "What is the {Sabzevar} for {medical condition treated} of {leprosy}",
    "uid": 30226,
    "subgraph": "simple question left",
    "template_index": 1439,
    "question": "What Sabzevar is needed to treat leprosy?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2175 wd:Q36956 . ?sbj wdt:P31 wd:Q765553 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What sabzevar is required to treat leprosy?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2175 wd:Q36956 . ?sbj wdt:P31 wd:Q35456 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located in the administrative unit} of {lives in} of {Ruth Benedict} ?",
    "uid": 15570,
    "subgraph": "right-subgraph",
    "template_index": 1023,
    "question": "Ruth Benedict lives in what administrative location?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q228822 wdt:P551 ?X . ?X wdt:P131 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q228822> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P551>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P131> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Give me the administrative location of where Ruth Benedict is currently living in.",
    "answers": [
      "New York"
    ]
  },
  {
    "NNQT_question": "What is the {human} for {relative} of {Hadrian}",
    "uid": 31889,
    "subgraph": "simple question right",
    "template_index": 259,
    "question": "Who is the relative of Hadrian?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q1427 wdt:P1038 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is Hadrian's relative?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q1427 wdt:P25 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human biblical figure} for {child} of {Jesus}",
    "uid": 31885,
    "subgraph": "simple question right",
    "template_index": 266,
    "question": "Who is the child of Jesus Christ",
    "sparql_wikidata": " select distinct ?obj where { wd:Q302 wdt:P40 ?obj . ?obj wdt:P31 wd:Q20643955 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the child of Jesus Christ",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q302 wdt:P25 ?obj . ?obj wdt:P31 wd:Q20643955 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Cyprinus rubrofuscus} that contains the word {koi} in their name",
    "uid": 23883,
    "subgraph": "string matching simple contains word",
    "template_index": 2297,
    "question": "Tell me cyprinus rubrofuscus whose name has the word koi in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3246258 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'koi')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3246258>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'koi')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know cyprinus rubrofuscus whose title has the word koi in it.",
    "answers": [
      "koi"
    ]
  },
  {
    "NNQT_question": "What is {British Book Trade Index ID} of {Mikhail Bulgakov}",
    "uid": 31005,
    "subgraph": "center",
    "template_index": 131,
    "question": "Which is the British Book Trade Index ID for Mikhail Bulgakov?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q835 wdt:P2945 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q189937 wdt:P2945 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {audio and video interfaces and connectors} that contains the word {ypbpr} in their name",
    "uid": 23958,
    "subgraph": "string matching simple contains word",
    "template_index": 1618,
    "question": "tell me audio and video interfaces and connectors are name has the word ypbpr in it",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1153429 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ypbpr')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1153429>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'ypbpr')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "let me know sound and video interfacing and connectors are title has the word ypbpr in it",
    "answers": [
      "YPbPr"
    ]
  },
  {
    "NNQT_question": "What is the {church building} for {Dove.org work ID} of {Paul}",
    "uid": 30293,
    "subgraph": "simple question left",
    "template_index": 1383,
    "question": "Name the church monument where Paul was the Dove.org work ID",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P7236 wd:Q9200 . ?sbj wdt:P31 wd:Q16970 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Title the church landmark where Paul was the Dove.org work ID",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P417 wd:Q9200 . ?sbj wdt:P31 wd:Q16970 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {cuisine} of {characters} of {Buffy the Vampire Slayer} ?",
    "uid": 30575,
    "subgraph": "right-subgraph",
    "template_index": 3560,
    "question": "Which cuisine did the character Buffy the Vampire Slayer choose?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q183513 wdt:P674 ?X . ?X wdt:P2012 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which cuisine did the character Buffy the Vampire Slayer choose?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q183513 wdt:P674 ?X . ?X wdt:P106 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Nantong} for {regulated by} of {association football}",
    "uid": 31782,
    "subgraph": "simple question right",
    "template_index": 371,
    "question": "Which is the Nantong that is regulated by the football association?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q2736 wdt:P3719 ?obj . ?obj wdt:P31 wd:Q57947 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "The football association regulates what Nantong?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q2736 wdt:P3719 ?obj . ?obj wdt:P31 wd:Q37178026 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Kliment Voroshilov} that is {point in time} is {1948-6-24} ?",
    "uid": 7386,
    "subgraph": "statement_property",
    "template_index": 3831,
    "question": "On June 24th of 1948 what award did Kliment Voroshilov received?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q186185 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1948')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q186185> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1948-6-24>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Name the award received by Kliment Voroshilov on June 24, 1948.",
    "answers": [
      "Order of the Red Banner",
      "Jubilee Medal \"30 Years of the Soviet Army and Navy\""
    ]
  },
  {
    "NNQT_question": "How many {used by} are for {Nissan} ?",
    "uid": 31700,
    "subgraph": "statement_property",
    "template_index": 267,
    "question": "How many people are used by a Nissan?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q20165 wdt:P1535 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Nissans use how many people?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q20165 wdt:P1830 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {total fertility rate} of {West Africa}",
    "uid": 30865,
    "subgraph": "center",
    "template_index": 4015,
    "question": "What is total fertility rate for West Africa?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q4412 wdt:P4841 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q4412 wdt:P4427 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {series ordinal} for {ethyl ether} has {via} as {9.53} ?",
    "uid": 31517,
    "subgraph": "statement_property",
    "template_index": 2426,
    "question": "which was the series ordinal  for ether which has  via as 9.53?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q202218 p:P2825 ?s . ?s ps:P2825 ?x filter(contains(?x,'9.53')) . ?s pq:P1545 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "With a via of 9.53, ether, has what numerical order?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q202218 p:P2260 ?s . ?s ps:P2260 ?x filter(contains(?x,'9.53')) . ?s pq:P1545 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {stepparent} of {Subutai}",
    "uid": 30801,
    "subgraph": "center",
    "template_index": 2166,
    "question": "Who is the stepparent of Subutai?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P3448 wd:Q162217}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P3373 wd:Q162217}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {child of} of {husband} of {Ranavalona I} ?",
    "uid": 15554,
    "subgraph": "left-subgraph",
    "template_index": 8,
    "question": "Who is the child of Ranavalona I's husband?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q169794 wdt:P26 ?X . ?X wdt:P22 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q169794> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P22> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the name of Ranavalona I's husband's child?",
    "answers": [
      "Andrianampoinimerina"
    ]
  },
  {
    "NNQT_question": "What is {educated at} of {Karl E. Weick}, that has {coordinate location} is {-122.319)} ?",
    "uid": 30454,
    "subgraph": "right-subgraph",
    "template_index": 3183,
    "question": "What is the alma mater of Karl E. Weick whose position is -122.319?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q328887 wdt:P69 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'-122.319'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the alma mater of Karl E. Weick whose position is -122.319?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q357458 wdt:P69 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'-122.319'))}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {religion} of {guest of honor} of {Sirhan Sirhan} ?",
    "uid": 30564,
    "subgraph": "right-subgraph",
    "template_index": 2059,
    "question": "What is {religious affiliation} of {guest of honor} {Sirhan Sirhan} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q297112 wdt:P967 ?X . ?X wdt:P140 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is {devout connection} of {guest of honor} {Sirhan Sirhan} ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q297112 wdt:P172 ?X . ?X wdt:P140 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Aurangabad} has {located in the administrative territorial entity} as {Isle of Man} ?",
    "uid": 31564,
    "subgraph": "statement_property",
    "template_index": 2958,
    "question": "When did Aurangabad become part of the Isle of Man?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q200713 p:P131 ?s . ?s ps:P131 wd:Q9676 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did the Isle of Man incorporate Aurangabad?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q200713 p:P131 ?s . ?s ps:P131 wd:Q1240096 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {winner} for {Herbie Hancock} has {award received} as {Grammy Award for Best Pop Collaboration with Vocals} ?",
    "uid": 6535,
    "subgraph": "statement_property",
    "template_index": 2980,
    "question": "Was Herbie Hancock the winner of the award for the Grammy Award for Best Pop Collaboration with Vocals?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q105875 p:P166 ?s . ?s ps:P166 wd:Q691203 . ?s pq:P1346 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q105875> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q691203> .\n?statement <http://www.wikidata.org/entity/P1346> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Did Herbie Hancock the winner of the award for the Grammy Award for Best Pop Collaboration with Vocals?",
    "answers": [
      "Pink",
      "Jeff Beck",
      "Seal",
      "India.Arie",
      "Oumou Sangaré",
      "Konono Nº1"
    ]
  },
  {
    "NNQT_question": "What is {announcement date} of {country} of {Alice Springs} ?",
    "uid": 30561,
    "subgraph": "right-subgraph",
    "template_index": 843,
    "question": "What is the announcement date of Alice springs-Soverign state?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q17872 wdt:P17 ?X . ?X wdt:P6949 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the announcement date of Alice springs-Soverign state?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q17872 wdt:P17 ?X . ?X wdt:P2936 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {location} of {Romania during World War I}, that has {country} is {Israel} ?",
    "uid": 30481,
    "subgraph": "right-subgraph",
    "template_index": 266,
    "question": "Name the location in Romania that had countrys in Israel during World War I.",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q553157 wdt:P276 ?answer . ?answer wdt:P17 wd:Q801}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Title the location in Romania that had discretionary relations in Israel amid World War I.",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q553157 wdt:P276 ?answer . ?answer wdt:P530 wd:Q801}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {juvenile political organisation} for {member of political party} of {Jacinda Ardern}",
    "uid": 31822,
    "subgraph": "simple question right",
    "template_index": 2187,
    "question": "What juvenile political organisation does Jacinda Ardern belong to?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q3606816 wdt:P102 ?obj . ?obj wdt:P31 wd:Q2493450 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name the juvenile political organisation to which Jacinda Ardern belongs.",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q3606816 wdt:P102 ?obj . ?obj wdt:P31 wd:Q7278 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {married name} of {C. V. Raman}",
    "uid": 30248,
    "subgraph": "simple question left",
    "template_index": 1148,
    "question": "Who is C. V. Raman's married name",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2562 wd:Q60429 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which married name has C.V. Raman as a patient?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P184 wd:Q60429 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {convicted of} of {Harry Potter}",
    "uid": 30797,
    "subgraph": "center",
    "template_index": 1467,
    "question": "What is convicted of Harry Potter?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1399 wd:Q3244512}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P157 wd:Q3244512}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Greco-Roman mysteries} that starts with {'m'}",
    "uid": 24571,
    "subgraph": "string matching simple contains word",
    "template_index": 3829,
    "question": "What are theGreco-Roman mysteries which start with the letter M",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q505821 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q505821>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are theGreco-Roman secrets which begin with the letter M",
    "answers": [
      "Mithraic mysteries"
    ]
  },
  {
    "NNQT_question": "What is the {monoanion} for {GHS precautionary statement} of {water}",
    "uid": 30296,
    "subgraph": "simple question left",
    "template_index": 2091,
    "question": "The GHS precautionary statement of water has a monoanion of?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P5042 wd:Q283 . ?sbj wdt:P31 wd:Q55523986 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "The GHS precautionary statement of water incorporates a monoanion of?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P4147 wd:Q283 . ?sbj wdt:P31 wd:Q55523986 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {warheroes.ru ID} of {Shamshi-Adad I}",
    "uid": 30834,
    "subgraph": "center",
    "template_index": 2232,
    "question": "What is the warheroes.ru ID for Shamshi-Adad I?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q254523 wdt:P2943 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q7327 wdt:P2943 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {winner} for {Friends} has {award received} as {Filmfare Power Award} ?",
    "uid": 31565,
    "subgraph": "statement_property",
    "template_index": 2075,
    "question": "Who is the winner of Friends who has received Filmfare Power Award?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q79784 p:P166 ?s . ?s ps:P166 wd:Q1414582 . ?s pq:P1346 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Which Friends cast member won a Filmfare Power Award?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q79784 p:P166 ?s . ?s ps:P166 wd:Q2110156 . ?s pq:P1346 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {lake outflow} of {Regenbogensee}",
    "uid": 30914,
    "subgraph": "center",
    "template_index": 688,
    "question": "What is the reservoir of Regenbogensee?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q114035 wdt:P201 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q1801110 wdt:P201 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Little Rock} has {population} as {193524} ?",
    "uid": 31592,
    "subgraph": "statement_property",
    "template_index": 1106,
    "question": "What was the population of Little Rock from 2/4/1935?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q33405 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'193524')) . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "From 2/4/1935 how many people lived in Little Rock?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q33405 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'193524')) . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {film} for {composer} of {Isabelle Adjani}",
    "uid": 30346,
    "subgraph": "simple question left",
    "template_index": 367,
    "question": "Which is the film that was composed by Isabelle Adjani?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P86 wd:Q106383 . ?sbj wdt:P31 wd:Q11424 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Isabelle Adjani was the composer of what movie?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P162 wd:Q106383 . ?sbj wdt:P31 wd:Q11424 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {significant event} of {Michelle Bachelet} that is {point in time} is {1978-6-1} ?",
    "uid": 7703,
    "subgraph": "statement_property",
    "template_index": 4148,
    "question": "What significant event in 1978-6-1 is Michelle Bachelet known for?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q320 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1978')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q320> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P793> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1978-6-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What did Michelle Bachelet do on 6/1/1978?",
    "answers": [
      "childbirth"
    ]
  },
  {
    "NNQT_question": "What is the {determination method} for {developmental coordination disorder} has {genetic association} as {RASGRF2} ?",
    "uid": 31548,
    "subgraph": "statement_property",
    "template_index": 4437,
    "question": "What is the method of determining developmental coordination disorders that has the genetic association of RASGRF2?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q1269351 p:P2293 ?s . ?s ps:P2293 wd:Q18031050 . ?s pq:P459 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "RASGRF2 is the genetic association of determining developmental coordination disorders by which method?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q373822 p:P2293 ?s . ?s ps:P2293 wd:Q18031050 . ?s pq:P459 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]