[
  {
    "NNQT_question": "Give me {toy dog} that contains the word {toy} in their name",
    "uid": 31234,
    "subgraph": "string matching simple contains word",
    "template_index": 3196,
    "question": "What's the name of a type of toy dog with the word \"toy\" in its name?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2991480 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'toy')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the name of a toy dog in its name with the word \"toy?\"",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q38672 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'toy')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {runway} of {Brazos River}",
    "uid": 30866,
    "subgraph": "center",
    "template_index": 3837,
    "question": "Where is the runway of the Brazos River?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q903306 wdt:P529 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q903306 wdt:P4614 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {archives at} are for {Grace Hopper} ?",
    "uid": 1467,
    "subgraph": "statement_property",
    "template_index": 467,
    "question": "How many of the archives are for Grace Hopper?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q11641 wdt:P485 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q11641> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P485> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Out of the archives, which are for Grace Hopper?",
    "answers": [
      "4"
    ]
  },
  {
    "NNQT_question": "What is the {start time} for {Andrei Tarkovsky} has {member of sports team} as {Manchester United F.C.} ?",
    "uid": 31557,
    "subgraph": "statement_property",
    "template_index": 3475,
    "question": "When did Andrei Tarkovsky become a member of the Manchester United F.C.?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q853 p:P54 ?s . ?s ps:P54 wd:Q18656 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Andrei Tarkovsky join Manchester United?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q10524 p:P54 ?s . ?s ps:P54 wd:Q18656 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located in the administrative territorial entity} of {street workout} that is {end time} is {1996-01-01} ?",
    "uid": 31273,
    "subgraph": "statement_property",
    "template_index": 3525,
    "question": "In 1996, what significant event happened in the administrative territorial entity of street workout?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q13560813 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1996')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In the administrative territorial entity of street workout, what significant event happened in 1996?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q23154 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1996')) }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {history of topic} of {said to be the same as} of {liberty} ?",
    "uid": 30664,
    "subgraph": "left-subgraph",
    "template_index": 7,
    "question": "What is the history similar to liberty?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2979 wdt:P460 ?X . ?X wdt:P2184 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the history similar to liberty?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q2979 wdt:P461 ?X . ?X wdt:P2184 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {end time} for {Mikhail Sholokhov} has {nominated for} as {Nobel Prize in Literature} ?",
    "uid": 31664,
    "subgraph": "statement_property",
    "template_index": 1549,
    "question": "Until when was Michail Sholokhov nominated for a Nobel Prize in Literature?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q42398 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Michail Sholokhov was nominated for Literature's Nobel Prize until what year?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q42398 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Japanese TV series} with the {MAX(number of seasons)} whose {original language of film or TV show} is {Late Middle Japanese} ?",
    "uid": 31113,
    "subgraph": "rank",
    "template_index": 170,
    "question": "What Japanese TV series has the most number of seasons and was originally aired in Late Middle Japanese?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q21191019 . ?ent wdt:P2437 ?obj . ?ent wdt:P364 wd:Q1816184 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Of all Japanese TV series originally aired in Late Middle Japanese, which has the most seasons?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q21191019 . ?ent wdt:P2437 ?obj . ?ent wdt:P364 wd:Q5287 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {zipcode} of {buried in} of {Georges Bizet} ?",
    "uid": 17930,
    "subgraph": "right-subgraph",
    "template_index": 684,
    "question": "What is the zip code where Georges BIzet is buried?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q56158 wdt:P119 ?X . ?X wdt:P281 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q56158> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P119>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P281> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the zip code where Georges BIzet is buried?",
    "answers": [
      "75020"
    ]
  },
  {
    "NNQT_question": "What is the {book series} for {donations} of {Dante Alighieri}",
    "uid": 30250,
    "subgraph": "simple question left",
    "template_index": 3294,
    "question": "What book series did the donations Dante Alighieri write?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P8093 wd:Q1067 . ?sbj wdt:P31 wd:Q277759 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What book arrangement did the donator Dante Alighieri write?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P50 wd:Q1067 . ?sbj wdt:P31 wd:Q277759 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Ugyen Wangchuck} that starts with {'s'}",
    "uid": 31139,
    "subgraph": "string matching simple contains word",
    "template_index": 2614,
    "question": "What is a Ugyen Wangchuck that starts with the letter s.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q333866 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What could be a Ugyen Wangchuck that begins with the letter s.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q205961 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {stadium} for {redshift} of {Green Bay Packers}",
    "uid": 31799,
    "subgraph": "simple question right",
    "template_index": 1374,
    "question": "What is the redshift stadium of the Green Bay Packers?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q213837 wdt:P1090 ?obj . ?obj wdt:P31 wd:Q483110 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the redshift stadium of the Green Inlet Packers?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q213837 wdt:P115 ?obj . ?obj wdt:P31 wd:Q483110 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Justin Timberlake} that is {point in time} is {2007-0-0} ?",
    "uid": 6733,
    "subgraph": "statement_property",
    "template_index": 3178,
    "question": "What is { award received } from { Justin Timberlake } that is { point in time } is { 2007 - 0 - 0 }?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q43432 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q43432> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2007-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What is { grant gotten } from { Justin Timberlake } that's { point in time } is { 2007 - - }?",
    "answers": [
      "Grammy Award for Best Rap/Sung Performance"
    ]
  },
  {
    "NNQT_question": "What is {located on street} of {Lysimachus} and {follows}",
    "uid": 32006,
    "subgraph": [],
    "template_index": 725,
    "question": "In what street is Lysimachus located in and who does he follow?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q32133 p:P669 ?s . ?s ps:P669 ?obj . ?s pq:P155 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Name the street in which Lysimachus is located and the person followed by him.",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q32133 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P155 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {operating income} of {Boise}",
    "uid": 30820,
    "subgraph": "center",
    "template_index": 1907,
    "question": "Which is the operating income for Boise?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q35775 wdt:P3362 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q32491 wdt:P3362 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Inno-Hit} for {manufacturer} of {SpaceX}",
    "uid": 30277,
    "subgraph": "simple question left",
    "template_index": 2089,
    "question": "What Inno-Hit is produced by SpaceX?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P176 wd:Q193701 . ?sbj wdt:P31 wd:Q70206987 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name a Inno-Hit produced by SpaceX.",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P176 wd:Q193701 . ?sbj wdt:P31 wd:Q431289 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Dirk Nowitzki} that is {point in time} is {2011-0-0} ?",
    "uid": 5343,
    "subgraph": "statement_property",
    "template_index": 1788,
    "question": "What award did Dirk Nowitzki receive in 2011?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q44068 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q44068> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2011-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 2011, what award was given Dirk Nowitzki?",
    "answers": [
      "Best NBA Player ESPY Award",
      "Bill Russell NBA Finals Most Valuable Player Award",
      "Best Male Athlete ESPY Award",
      "German Sportspersonality of the Year",
      "German Sportspersonality of the Year"
    ]
  },
  {
    "NNQT_question": "What is {located in the administrative territorial entity} of {Sint Maarten} that is {RefSeq} is {1954-12-15} ?",
    "uid": 31305,
    "subgraph": "statement_property",
    "template_index": 897,
    "question": "What administrative territorial entity was Sint Maarten RefSeq of the year December 15, 1954?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q26273 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P656 ?x filter(contains(YEAR(?x),'1954')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which government controlled Sint Maarten during RefSeq of December 15th, 1954?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q26273 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1954')) }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Greek deity} that contains the word {zeus} in their name",
    "uid": 23386,
    "subgraph": "string matching simple contains word",
    "template_index": 3187,
    "question": "What are the Greek deity which start with the letter zeus",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22989102 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zeus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q22989102>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zeus')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name the Greek deity whose name begins with zeus",
    "answers": [
      "Zeus"
    ]
  },
  {
    "NNQT_question": "What is {students} of {coined} of {Euler–Lagrange equation} ?",
    "uid": 17797,
    "subgraph": "right-subgraph",
    "template_index": 892,
    "question": "Who is the student that coined the Euler-Lagrange equation?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q875744 wdt:P61 ?X . ?X wdt:P802 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q875744> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P61>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P802> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who is the understudy that coined the Euler-Lagrange equation?",
    "answers": [
      "Joseph-Louis Lagrange",
      "Nicolas Fuss",
      "Anders Johan Lexell",
      "Johann Euler",
      "Mikhail Evseyevich Golovin",
      "Petr Inokhodtsev",
      "Semen Kotelnikov",
      "Stepan Rumovsky"
    ]
  },
  {
    "NNQT_question": "What is the {algerian} for {notable work} of {The Count of Monte Cristo}",
    "uid": 30310,
    "subgraph": "simple question left",
    "template_index": 1298,
    "question": "Who is the French author of The Count of Monte Cristo?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P800 wd:Q191838 . ?sbj wdt:P31 wd:Q121842 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me the French author of The Count of Monte Cristo",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P800 wd:Q191838 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Gran Enciclopèdia Catalana ID} of {Chinese garden}",
    "uid": 31038,
    "subgraph": "center",
    "template_index": 3330,
    "question": "The Chinese garden has what Gran Enciclopèdia Catalana ID?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q47692 wdt:P1296 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q47692 wdt:P4307 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {event location} of {in action} of {Allies} ?",
    "uid": 16133,
    "subgraph": "right-subgraph",
    "template_index": 52,
    "question": "What is the event location in action of the Allies?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q215669 wdt:P607 ?X . ?X wdt:P276 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q215669> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P607>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P276> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the occasion area in activity of the Allies?",
    "answers": [
      "Africa",
      "Europe",
      "Asia",
      "Middle East",
      "Australia and Oceania"
    ]
  },
  {
    "NNQT_question": "What is the {Ahn Sahng-hong} for {affiliation} of {Columbia University}",
    "uid": 30233,
    "subgraph": "simple question left",
    "template_index": 2131,
    "question": "What is the affiliation Ahn Sahng-hong in Columbia University?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1416 wd:Q49088 . ?sbj wdt:P31 wd:Q626456 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the Columbia University affiliation Ahn Sahng-hong?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1416 wd:Q49088 . ?sbj wdt:P31 wd:Q19844914 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Erdős number} of {El Mundo}",
    "uid": 30800,
    "subgraph": "center",
    "template_index": 1355,
    "question": "What is the Erdős number of El Mundo?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P2021 wd:Q921217}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P3919 wd:Q921217}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {place of death} of {Clement I} that is {country} is {Bosporan Kingdom} ?",
    "uid": 7562,
    "subgraph": "statement_property",
    "template_index": 4007,
    "question": "Where Clement I dired at Bosporan Kingdom?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q42887 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q321371 }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q42887> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P17> <http://wikidata.dbpedia.org/resource/Q321371>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Give the location in Bosporan Kingdom that Clement I dired.",
    "answers": [
      "Chersonesus"
    ]
  },
  {
    "NNQT_question": "What is the {railway gun} with the {MIN(muzzle velocity)} whose {page banner} is {France} ?",
    "uid": 31122,
    "subgraph": "rank",
    "template_index": 468,
    "question": "What is the railway gun with min muscle velocity whose page banner is France",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q1049358 . ?ent wdt:P4137 ?obj . ?ent wdt:P948 wd:Q142} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Give me the name of the railway gun with min muscle velocity page banner in france?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q1049358 . ?ent wdt:P4137 ?obj . ?ent wdt:P17 wd:Q142} ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {for-profit charity} for {business division} of {Ford Motor Company}",
    "uid": 31828,
    "subgraph": "simple question right",
    "template_index": 916,
    "question": "Name a for-profit charity business division owned by Ford Motor Company",
    "sparql_wikidata": " select distinct ?obj where { wd:Q44294 wdt:P199 ?obj . ?obj wdt:P31 wd:Q5466627 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Title a for-profit charity trade division claimed by Portage Engine Company",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q44294 wdt:P199 ?obj . ?obj wdt:P31 wd:Q6881511 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Saros cycle of eclipse} and {place of marriage} of {Marilyn Monroe} has {spouse} as {James Dougherty}",
    "uid": 32056,
    "subgraph": [],
    "template_index": 577,
    "question": "What was the place of marriage of Marilyn Monroe and James Dougherty and what is the corresponding Saros cycle of eclipse?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q4616 p:P26 ?s . ?s ps:P26 wd:Q946783 . ?s pq:P3592 ?value1 . ?s pq:P2842 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Where did Marilyn Monroe & James Dougherty get married and what is the corresponding Saros cycle of eclipse?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q4616 p:P26 ?s . ?s ps:P26 wd:Q946783 . ?s pq:P582 ?value1 . ?s pq:P2842 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {incumbent} of {professorship position} of {John Budden} ?",
    "uid": 16992,
    "subgraph": "left-subgraph",
    "template_index": 26,
    "question": "Where is incumbent of professorship position of John Budden ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q6223791 wdt:P803 ?X . ?X wdt:P1308 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q6223791> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P803>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1308> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "The professorship position of John Budden is located where?",
    "answers": [
      "Wolfgang Ernst"
    ]
  },
  {
    "NNQT_question": "Give me {Wikimedia set index article} that contains the word {typhoon} in their name",
    "uid": 23222,
    "subgraph": "string matching simple contains word",
    "template_index": 33,
    "question": "What are the Wikimedia set index article which start with the letter typhoon",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15623926 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'typhoon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q15623926>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'typhoon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the Wikimedia set index article which start with the letter storm",
    "answers": [
      "Typhoon Durian",
      "Typhoon Chebi"
    ]
  },
  {
    "NNQT_question": "What is the {immunosuppressive drug} for {drug used for treatment} of {skin cancer}",
    "uid": 31860,
    "subgraph": "simple question right",
    "template_index": 3296,
    "question": "Which is the immunosuppressive drug used for treatment of skin cancer?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q192102 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q249619 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which is the immunosuppressive substance utilized as a treatment of skin cancer?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q192102 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q35456 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {average time complexity} of {Brett Favre}",
    "uid": 30872,
    "subgraph": "center",
    "template_index": 1129,
    "question": "What is the  average time complexity  of Brett Favre ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q267088 wdt:P3754 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q267088 wdt:P4368 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Al-Hajjaj ibn Yusuf} that contains the word {zollkriminalamt} in their name",
    "uid": 31141,
    "subgraph": "string matching simple contains word",
    "template_index": 2519,
    "question": "Tell me Al-Hajjaj ibn Yusuf whose name has the word  zollkriminalamt  in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q293460 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zollkriminalamt')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know Al-Hajjaj ibn Yusuf whose title has the word zollkriminalamt in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43229 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zollkriminalamt')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  }
]