[
  {
    "NNQT_question": "Give me {Qods} that contains the word {surface} in their name",
    "uid": 31143,
    "subgraph": "string matching simple contains word",
    "template_index": 524,
    "question": "Tell me Qods whose name has the word surface in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q766974 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'surface')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know Qods whose title has the word surface in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1293220 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'surface')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Auguste Beernaert} for {designed by} of {Donald Trump}",
    "uid": 30236,
    "subgraph": "simple question left",
    "template_index": 1366,
    "question": "Which is the Auguste Beernaert carrying designs patterns of Donald Trump?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P287 wd:Q22686 . ?sbj wdt:P31 wd:Q202049 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is the Auguste Beernaert carrying plans designs of Donald Trump?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P287 wd:Q22686 . ?sbj wdt:P31 wd:Q1048525 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {twinned administrative body} of {Queensland} that is {start time} is {1984-10-1} ?",
    "uid": 5751,
    "subgraph": "statement_property",
    "template_index": 2196,
    "question": "What twinned administrative body of Queensland started on October 10th, 1984?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q36074 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1984')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q36074> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1984-10-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What paired administrative body of Queensland started on October 10th, 1984?",
    "answers": [
      "Saitama Prefecture"
    ]
  },
  {
    "NNQT_question": "What is {has grammatical person} of {writing language} of {George Michael} ?",
    "uid": 30761,
    "subgraph": "right-subgraph",
    "template_index": 314,
    "question": "Who speaks the same writing language of George Michael?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q130311 wdt:P6886 ?X . ?X wdt:P5110 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "In reference to George Michael, who are the people who speak the same writing language as him?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q130311 wdt:P1412 ?X . ?X wdt:P5110 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {followed by} and {follows} of {Communist Party of China} has {founded by} as {Zhao Ziyang}",
    "uid": 32091,
    "subgraph": [],
    "template_index": 1518,
    "question": "Who founded the Communist Party of China before and after Zhao Ziyang?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q17427 p:P112 ?s . ?s ps:P112 wd:Q99829 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who founded the China's Communist Party before and after Zhao Ziyang?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q17427 p:P488 ?s . ?s ps:P488 wd:Q99829 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {ammunition} of {Gough Whitlam}, that has {conflict} is {Vietnam War} ?",
    "uid": 30358,
    "subgraph": "right-subgraph",
    "template_index": 176,
    "question": "What is the ammunition of Gough Whitlam, that has been used in the Vietnam war?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q23333 wdt:P739 ?answer . ?answer wdt:P607 wd:Q8740}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the ammunition of Gough Whitlam, that has been used in the conflict in Vietnam?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q864060 wdt:P739 ?answer . ?answer wdt:P607 wd:Q8740}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {member count} are for {Labour Party} ?",
    "uid": 1587,
    "subgraph": "statement_property",
    "template_index": 587,
    "question": "How many people are in the Labour Party?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q9630 wdt:P2124 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q9630> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2124> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Which is the number of people that are in the Labour Party?",
    "answers": [
      "1"
    ]
  },
  {
    "NNQT_question": "What is the {historic house museum} for {member of the deme} of {Rembrandt}",
    "uid": 31841,
    "subgraph": "simple question right",
    "template_index": 1347,
    "question": "Which is the historic house museum member of the deme of Rembrandt?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q5598 wdt:P2462 ?obj . ?obj wdt:P31 wd:Q2087181 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which is the noteworthy house historical member of the deme of Rembrandt?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q5598 wdt:P551 ?obj . ?obj wdt:P31 wd:Q2087181 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Charlie Rose} has {award received} as {James Madison Award} ?",
    "uid": 31659,
    "subgraph": "statement_property",
    "template_index": 47,
    "question": "From when did Charlie Rose receive the James Madison Award?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q715515 p:P166 ?s . ?s ps:P166 wd:Q16987872 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "from what date did charlie rose receive the james madison award?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q715515 p:P166 ?s . ?s ps:P166 wd:Q16987872 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {practiced by} and the {studies} of {genology} ?",
    "uid": 31959,
    "subgraph": "two intentions right subgraph",
    "template_index": 230,
    "question": "Who practices and researches genology?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q3508604 wdt:P3095 ?ans_1 . wd:Q3508604 wdt:P2578 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What do you call a person who specializes in genology?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q8134 wdt:P3095 ?ans_1 . wd:Q8134 wdt:P2578 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {diplomatic relation} of {basin country} of {Agatho} ?",
    "uid": 30522,
    "subgraph": "right-subgraph",
    "template_index": 4911,
    "question": "What is the diplomatic relations like in basin countries of Agatho?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q104467 wdt:P205 ?X . ?X wdt:P530 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "The basin countries of Agatho has what diplomatic relations?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q202905 wdt:P205 ?X . ?X wdt:P530 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Fidel Castro} has {unmarried partner} as {Abdullah Ahmad Badawi} ?",
    "uid": 31630,
    "subgraph": "statement_property",
    "template_index": 4284,
    "question": "When did was Abdullah Ahmad Badawi the partner of Fidel Castro.",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q11256 p:P451 ?s . ?s ps:P451 wd:Q272588 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "At what time was Abdullah Ahmad Badawi the partner of Fidel Castro.",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q11256 p:P451 ?s . ?s ps:P451 wd:Q19516418 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located on astronomical body} of {Near side of the Moon}, that has {eccentricity} is {0.0567} ?",
    "uid": 11906,
    "subgraph": "right-subgraph",
    "template_index": 19,
    "question": "What has the eccentricity of 0.0567, that is located on astronomical body of the near side of the moon?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q782867 wdt:P376 ?answer . ?answer wdt:P1096 ?x FILTER(contains(?x,'0.0567'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q782867> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P376>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1096> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <0.0567> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What has the eccentricity of 0.0567, that is placed on astronomical physique of the near aspect of the moon?",
    "answers": [
      "Moon"
    ]
  },
  {
    "NNQT_question": "What is {population} of {country of citizenship} of {ski mountaineering} ?",
    "uid": 30508,
    "subgraph": "right-subgraph",
    "template_index": 2748,
    "question": "What is {inhabitants} {nationality} of {ski mountaineering} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1075998 wdt:P27 ?X . ?X wdt:P1082 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is {inhabitants} {nationality} of {ski mountaineering} ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q78474 wdt:P27 ?X . ?X wdt:P1082 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {gave up territory to} are to/by {furniture} ?",
    "uid": 31729,
    "subgraph": "statement_property",
    "template_index": 1457,
    "question": "How many are the territories given up by furniture?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P7904 wd:Q14745 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "What is the number of territories given up by furniture?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P452 wd:Q14745 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Deutsche Bahn station category} of {employer} of {Roberta Bondar} ?",
    "uid": 30560,
    "subgraph": "right-subgraph",
    "template_index": 2464,
    "question": "What is the Deutsche Bahn station category of those who work at Roberta Bondar?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q258385 wdt:P108 ?X . ?X wdt:P5105 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the Deutsche Bahn station category of those who work at Roberta Bondar?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q258385 wdt:P108 ?X . ?X wdt:P355 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {preceeds} of {implies} of {vaporization} ?",
    "uid": 16578,
    "subgraph": "right-subgraph",
    "template_index": 45,
    "question": "TELL ME THE PRECEEDS THAT IMPLIES VAPORIZATION?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q6452502 wdt:P1542 ?X . ?X wdt:P156 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q6452502> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1542>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P156> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "TELL ME THE PRECEEDS OF THE VAPORIZATION IMPLIES?",
    "answers": [
      "plasma state of matter"
    ]
  },
  {
    "NNQT_question": "What is {coordinates of geographic center} of {Michigan} that is {determination method} is {center of gravity of the surface} ?",
    "uid": 7385,
    "subgraph": "statement_property",
    "template_index": 3830,
    "question": "What are the coordinates for the geographic center of Michigan, as determined by the center of gravity of the surface?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1166 p:P5140 ?s . ?s ps:P5140 ?obj . ?s pq:P459 wd:Q53329492 }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P5140> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P459> <http://wikidata.dbpedia.org/resource/Q53329492>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Where is the geographic center of Michigan using the gravity center of the surface?",
    "answers": [
      "Point(-85.4102 44.3467)"
    ]
  },
  {
    "NNQT_question": "What is {coolant} of {Ludwig von Mises}",
    "uid": 30894,
    "subgraph": "center",
    "template_index": 3253,
    "question": "What is the coolant of Ludwig von Mises ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q84233 wdt:P588 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q84233 wdt:P4116 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {traditionally animated film} for {narrator} of {David Spade}",
    "uid": 30324,
    "subgraph": "simple question left",
    "template_index": 1390,
    "question": "What is the traditionally animated film with David Spade as narrator?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2438 wd:Q298658 . ?sbj wdt:P31 wd:Q28968511 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "In which traditionally animated film David Spade is the narrator?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2438 wd:Q298658 . ?sbj wdt:P31 wd:Q29168811 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {medical condition} of {Väinö Linna} that is {point in time} is {1984-0-0} ?",
    "uid": 5867,
    "subgraph": "statement_property",
    "template_index": 2312,
    "question": "What medical condition did Väinö Linna have in 1984?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q311037 p:P1050 ?s . ?s ps:P1050 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1984')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q311037> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1050> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1984-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was Väinö Linna's medical condition in 1984?",
    "answers": [
      "cerebral infarction"
    ]
  },
  {
    "NNQT_question": "What is {point in time} and {league} of {Vladimir Lenin} has {award received} as {Major League Baseball Most Valuable Player Award}",
    "uid": 32082,
    "subgraph": [],
    "template_index": 1167,
    "question": "At what point in time, and in which league did Vladimir Lenin receive his award as MVP?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q1394 p:P166 ?s . ?s ps:P166 wd:Q1514249 . ?s pq:P585 ?value1 . ?s pq:P118 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "At what factor in time, and in which league did Vladimir Lenin receive his award as MVP?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q3090378 p:P166 ?s . ?s ps:P166 wd:Q1514249 . ?s pq:P585 ?value1 . ?s pq:P118 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {for work} for {Jack Warner} has {water area} as {Academy Award for Best Picture} ?",
    "uid": 31507,
    "subgraph": "statement_property",
    "template_index": 1236,
    "question": "What is the work of Jack Warner that has Academy Award for Best Picture as water area?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q72614 p:P8887 ?s . ?s ps:P8887 wd:Q102427 . ?s pq:P1686 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Give me the reason of Jack Warner that has Academy award for Best picture as water area?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q72614 p:P166 ?s . ?s ps:P166 wd:Q102427 . ?s pq:P1686 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {location born} of {Mischa Maisky}, that has {adjacent to} is {Mārupe Municipality} ?",
    "uid": 13121,
    "subgraph": "right-subgraph",
    "template_index": 3476,
    "question": "Where is the location born of Mischa Maisky, which is adjacent to the Mārupe Municipality?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q381759 wdt:P19 ?answer . ?answer wdt:P47 wd:Q2232018}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q381759> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P47> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2232018> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Where is the location born of Mischa Maisky, which is adjacent to the Mārupe Municipality?",
    "answers": [
      "Riga"
    ]
  },
  {
    "NNQT_question": "Give me {separation process} that {discoverer or inventor} {Barack Obama} and which that starts with {'d'}",
    "uid": 31914,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1828,
    "question": "What what is separation process discoverer or inventor Barack Obama  and which that starts with d",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q898987 . ?sbj wdt:P61 wd:Q76 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "What what is division prepare pioneer or creator Barack Obama and which that begins with d",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q898987 . ?sbj wdt:P61 wd:Q226868 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'd')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Supermodels.nl ID} of {William Ewart Gladstone}",
    "uid": 30969,
    "subgraph": "center",
    "template_index": 2346,
    "question": "What is Supermodels.nl ID for William Ewart Gladstone?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q160852 wdt:P3330 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q160852 wdt:P3023 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {television series episode} for {part of the series} of {Beakman's World}",
    "uid": 30282,
    "subgraph": "simple question left",
    "template_index": 2103,
    "question": "What are the titles of Beakman's World episodes?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P179 wd:Q494 . ?sbj wdt:P31 wd:Q21191270 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the names of Beakman's World episodes?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P179 wd:Q2744 . ?sbj wdt:P31 wd:Q21191270 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {narrative location} of {Nectanebo II}",
    "uid": 30835,
    "subgraph": "center",
    "template_index": 2144,
    "question": "Which is the narrative location of Nectanebo II?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q313126 wdt:P840 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q457289 wdt:P840 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {possible creator} of {Brown v. Board of Education}",
    "uid": 30961,
    "subgraph": "center",
    "template_index": 3051,
    "question": "Who was the possible creator of Brown v. Board of Education?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q875738 wdt:P1779 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q875738 wdt:P3342 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {György Ligeti} that is {point in time} is {2000-0-0} ?",
    "uid": 7512,
    "subgraph": "statement_property",
    "template_index": 3957,
    "question": "What award did Gyorgy Ligeta receive on 2000-0-0?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q154331 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2000')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q154331> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2000-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Gyorgy Ligeta was what award in 2000?",
    "answers": [
      "Wihuri Sibelius Prize"
    ]
  },
  {
    "NNQT_question": "What is the {point in time} for {Estelle Parsons} has {award received} as {Tony Award for Best Actress in a Play} ?",
    "uid": 31656,
    "subgraph": "statement_property",
    "template_index": 1088,
    "question": "When did Estelle Parsons received a Tony Award for Best Actress in a Play?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q232541 p:P166 ?s . ?s ps:P166 wd:Q185299 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Estell Parsons Tony Award reception year?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q232541 p:P1411 ?s . ?s ps:P1411 wd:Q185299 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {burial plot reference} for {Jean-François Champollion} has {earliest date} as {Père Lachaise Cemetery} ?",
    "uid": 31524,
    "subgraph": "statement_property",
    "template_index": 3536,
    "question": "Where in the earliest date of Père Lachaise Cemetery is Jean-François Champollion buried?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q260 p:P1319 ?s . ?s ps:P1319 wd:Q311 . ?s pq:P965 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Jean-Francois Champollion is deceased, and where are the remains in the earliest date of Père Lachaise Cemetery?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q260 p:P119 ?s . ?s ps:P119 wd:Q311 . ?s pq:P965 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {second family name in Spanish name} of {child} of {Yeon Taejo} ?",
    "uid": 30656,
    "subgraph": "left-subgraph",
    "template_index": 18,
    "question": "Which in {second family name in Spanish name} {has daughter} of {Yeon Taejo} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q703988 wdt:P40 ?X . ?X wdt:P1950 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which in {second family name in Spanish name} {has girl} of {Yeon Taejo} ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q703988 wdt:P40 ?X . ?X wdt:P607 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {occupation} are to/by {Shah} ?",
    "uid": 1754,
    "subgraph": "statement_property",
    "template_index": 1098,
    "question": "How many occupants are there with {Shah} ?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P106 wd:Q184299 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q184299 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Shah contains how many occupants?",
    "answers": [
      "6"
    ]
  },
  {
    "NNQT_question": "What is the {publication date} for {Lily Tomlin} has {spouse} as {Jane Wagner} ?",
    "uid": 31598,
    "subgraph": "statement_property",
    "template_index": 3230,
    "question": "In what publication date Lily Tomlin, the spouse of Jane Wagner, was born?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q229271 p:P26 ?s . ?s ps:P26 wd:Q13560376 . ?s pq:P577 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "In what publication date was Lily tomlin born?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q229271 p:P26 ?s . ?s ps:P26 wd:Q13560376 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]