[
  {
    "NNQT_question": "What is {German cattle breed ID} of {Mertolenga}",
    "uid": 31009,
    "subgraph": "center",
    "template_index": 1981,
    "question": "Which is the German cattle breed ID of Mertolenga?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q3306660 wdt:P2024 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q987965 wdt:P2024 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {illustrator} for {Gladiator} has {nominated for} as {Academy Award for Best Sound Mixing} ?",
    "uid": 31521,
    "subgraph": "statement_property",
    "template_index": 2591,
    "question": "Who was the illustrator nominated for an Academy Award for  Best Sound Mixing in Gladiator?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q128518 p:P1411 ?s . ?s ps:P1411 wd:Q830079 . ?s pq:P110 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What are the illustrators nominated for an Academy Award for Best Sound Mixing in Gladiator?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q128518 p:P1411 ?s . ?s ps:P1411 wd:Q830079 . ?s pq:P2453 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {archangel} for {worshipped by} of {Christianity}",
    "uid": 30313,
    "subgraph": "simple question left",
    "template_index": 3458,
    "question": "Who is the archangel that is worshipped by Christianity?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1049 wd:Q5043 . ?sbj wdt:P31 wd:Q178342 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who is the archangel worshipped by Christianity?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1049 wd:Q5043 . ?sbj wdt:P31 wd:Q581450 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Shah Jahan} for {shares border with} of {Los Angeles}",
    "uid": 31779,
    "subgraph": "simple question right",
    "template_index": 3712,
    "question": "What is the Shah Jahan that shares the border with Los Angeles?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q65 wdt:P47 ?obj . ?obj wdt:P31 wd:Q83672 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name the Shah Jahan that shares the border with the city of Los Angeles.",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q65 wdt:P47 ?obj . ?obj wdt:P31 wd:Q123705 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Munzinger person ID} of {Hulk Hogan}",
    "uid": 31031,
    "subgraph": "center",
    "template_index": 1148,
    "question": "What is Hulk Hogan's Munzinger person ID?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q44176 wdt:P1284 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q44176 wdt:P2764 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {language official} of {lives in} of {Pasi Siltakorpi} ?",
    "uid": 17161,
    "subgraph": "left-subgraph",
    "template_index": 26613,
    "question": "What is the official language of lives in Pasi Siltakorpi?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q28786447 wdt:P551 ?X . ?X wdt:P37 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q28786447> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P551>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P37> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which is the official language for lives in Pasi Siltakorpi",
    "answers": [
      "Finnish",
      "Swedish"
    ]
  },
  {
    "NNQT_question": "What is {employer} of {participant} of {Romania} ?",
    "uid": 30500,
    "subgraph": "left-subgraph",
    "template_index": 22,
    "question": "Who works for the accused Romania?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q218 wdt:P710 ?X . ?X wdt:P108 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "The accused Romania employed whom?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q54554872 wdt:P710 ?X . ?X wdt:P108 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {birth place} of {Raffaele Calace}, that has {patron saint} is {Januarius} ?",
    "uid": 13719,
    "subgraph": "right-subgraph",
    "template_index": 425,
    "question": "What is the birth place of Raffaele Calace, whose patron saint is Januarius?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1344676 wdt:P19 ?answer . ?answer wdt:P417 wd:Q315312}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1344676> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P417> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q315312> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the birth put of Raffaele Calace, whose benefactor holy person is Januarius?",
    "answers": [
      "Naples"
    ]
  },
  {
    "NNQT_question": "What is the {crystal system} and the {discoverer or inventor} of {beryllium} ?",
    "uid": 31963,
    "subgraph": "two intentions right subgraph",
    "template_index": 361,
    "question": "Which is the {crystal system} who {discoverer or inventor} of {beryllium} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q569 wdt:P556 ?ans_1 . wd:Q569 wdt:P61 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "who invented beryllium and what is the crystal system?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q716 wdt:P556 ?ans_1 . wd:Q716 wdt:P61 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {One Piece} that is {research site} is {2009-01-01} ?",
    "uid": 31312,
    "subgraph": "statement_property",
    "template_index": 2832,
    "question": "Which award did One Piece receive in the research site of 2009?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q673 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P6153 ?x filter(contains(YEAR(?x),'2009')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "One Pierce received what award in the research site of 2009",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q673 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2009')) }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {mother} for {Julio Iglesias} has {child} as {Seneca} ?",
    "uid": 31554,
    "subgraph": "statement_property",
    "template_index": 3772,
    "question": "Who is the mother of Julio Iglesias and Seneca?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q122003 p:P40 ?s . ?s ps:P40 wd:Q2054 . ?s pq:P25 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Julio Iglesias and Seneca moms name is?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q122003 p:P40 ?s . ?s ps:P40 wd:Q47122 . ?s pq:P25 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {discoverer or inventor} of {osmium}, that has {place of birth} is {South Normanton} ?",
    "uid": 30403,
    "subgraph": "right-subgraph",
    "template_index": 87,
    "question": "Who first described the element osmium and was born in South Normanton?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q751 wdt:P61 ?answer . ?answer wdt:P19 wd:Q569245}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Give me the name of the person that first described the element osmium and was born in South Normanton.",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q751 wdt:P61 ?answer . ?answer wdt:P19 wd:Q527846}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {crosses} of {Notre-Dame de Paris}",
    "uid": 31062,
    "subgraph": "center",
    "template_index": 2068,
    "question": "What does Notre Dame de Paris cross?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q2981 wdt:P177 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q2981 wdt:P1644 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {territorial entity type} that starts with {'v'}",
    "uid": 31183,
    "subgraph": "string matching simple contains word",
    "template_index": 3542,
    "question": "What family of territorial entities starts with the letter \"v\"?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q104098715 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the group of territorial entities that start with the letter \"v\"",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22999537 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {designed by} and the {influenced by} of {ColdFusion Markup Language} ?",
    "uid": 31978,
    "subgraph": "two intentions right subgraph",
    "template_index": 172,
    "question": "What is designed and influenced by ColdFusion Markup Language?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q2524362 wdt:P287 ?ans_1 . wd:Q2524362 wdt:P737 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What does ColdFusion Markup Language design and influence?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q2005 wdt:P287 ?ans_1 . wd:Q2005 wdt:P737 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {notable work} of {screenwriter} of {Yor-yor} ?",
    "uid": 30613,
    "subgraph": "left-subgraph",
    "template_index": 7,
    "question": "Who is known for being the script writer of Yor-yor?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q32686 wdt:P58 ?X . ?X wdt:P800 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is known to be Yor-yor script writer?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q16164415 wdt:P58 ?X . ?X wdt:P800 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {twinned administrative body} of {Klagenfurt} that is {start time} is {1990-0-0} ?",
    "uid": 6798,
    "subgraph": "statement_property",
    "template_index": 3243,
    "question": "What city became a twin city of Klagenfurt in 1990?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q41753 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1990')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q41753> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1990-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1990, what city became a twin city of Klagenfurt?",
    "answers": [
      "Sibiu",
      "Zalaegerszeg"
    ]
  },
  {
    "NNQT_question": "What is {directs} of {political office held} of {Eduardo López-Dóriga} ?",
    "uid": 17239,
    "subgraph": "left-subgraph",
    "template_index": 547,
    "question": "WHO DIRECTS THE POLITICAL OFFICE HELD IN EDUARDO LOPEZ DORIGA",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q55547556 wdt:P39 ?X . ?X wdt:P2389 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q55547556> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P39>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2389> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "WHO Coordinates THE POLITICAL OFFICE HELD IN EDUARDO LOPEZ DORIGA",
    "answers": [
      "board of directors",
      "jury",
      "committee",
      "assembly",
      "collective leadership"
    ]
  },
  {
    "NNQT_question": "What is {mouth of the watercourse} of {The Tonight Show}",
    "uid": 30877,
    "subgraph": "center",
    "template_index": 3643,
    "question": "Who is the mouth of the watercourse of The Tonight Show?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1338655 wdt:P403 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q1338655 wdt:P371 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {arXiv classification} {association football club} that starts with {'w'}",
    "uid": 31168,
    "subgraph": "string matching simple contains word",
    "template_index": 2469,
    "question": "WHICH IS THE OBJECT CLASSIFIED AS ASSOCIATION OF FOOTCLUB BY ARXIV THAT STARTS WITH W",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P820 wd:Q476028 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "NAME THE THING CLASSIFIED AS ASSOCIATION OF FOOTCLUB BY ARXIV THAT STARTS WITH THE LETTER W",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q476028 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {employment} of {Allen Ginsberg}, that has {field of this employment} is {theatre} ?",
    "uid": 12190,
    "subgraph": "right-subgraph",
    "template_index": 5393,
    "question": "In what theatrical field was Allen Ginsberg employed?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q6711 wdt:P106 ?answer . ?answer wdt:P425 wd:Q17172848}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q6711> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P425> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q17172848> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "In what dramatic field was Allen Ginsberg employed?",
    "answers": [
      "playwright"
    ]
  },
  {
    "NNQT_question": "What is {languages spoken, written or signed} of {Peter Faber}, that has {language regulatory body} is {Henry A. Wallace} ?",
    "uid": 30369,
    "subgraph": "right-subgraph",
    "template_index": 390,
    "question": "What is the second language of Peter Faber which regulatory body is Henry A. Wallace?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q454814 wdt:P1412 ?answer . ?answer wdt:P1018 wd:Q251666}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the 2nd language of Peter Faber which regulatory body is Henry A. Wallace?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q454814 wdt:P1412 ?answer . ?answer wdt:P1018 wd:Q48509}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {comic genre} that starts with {'n'}",
    "uid": 24206,
    "subgraph": "string matching simple contains word",
    "template_index": 843,
    "question": "WHAT ARE COMIC GENRE WHICH START WITH THE LETTER N",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20087698 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q20087698>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "WHAT ARE Comedian Class WHICH Begin WITH THE LETTER N",
    "answers": [
      "non-fiction comics"
    ]
  },
  {
    "NNQT_question": "What is {male form of label} of {electrician}",
    "uid": 31014,
    "subgraph": "center",
    "template_index": 1782,
    "question": "What is male  of label for  electrician ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q165029 wdt:P3321 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q189290 wdt:P3321 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {spouse} of {San Marino} that is {start time} is {2006-01-01} ?",
    "uid": 31284,
    "subgraph": "statement_property",
    "template_index": 4776,
    "question": "what is spouse of San Marino that is start time is 2006?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q238 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2006')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Whats the name of San Marino's wife whom he married in 2006?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q295855 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2006')) }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {sign language} for {writing system} of {Esperanto}",
    "uid": 31840,
    "subgraph": "simple question right",
    "template_index": 3417,
    "question": "Which is the sign language for the writing system of Esperanto?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q143 wdt:P282 ?obj . ?obj wdt:P31 wd:Q34228 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which is the sign dialect for the writing system of Esperanto?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q143 wdt:P3969 ?obj . ?obj wdt:P31 wd:Q34228 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {significant event} of {hydrogeologist} that is {point in time} is {1978-06-01} ?",
    "uid": 31277,
    "subgraph": "statement_property",
    "template_index": 4148,
    "question": "What significant event in 1978-6-1 is hydrogeologist known for?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q35380338 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1978')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What did hydrogeologist do on 6/1/1978?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q320 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1978')) }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {uses} of {condensation}, that has {followed by} is {fundamental state of matter} ?",
    "uid": 30452,
    "subgraph": "right-subgraph",
    "template_index": 18,
    "question": "What is that uses condensation and is followed by the fundamental state of matter?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q166583 wdt:P2283 ?answer . ?answer wdt:P156 wd:Q15831576}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What prequel of fundamental state of matter is using condensation?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q166583 wdt:P2283 ?answer . ?answer wdt:P156 wd:Q29148313}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {sovereign state} with the {MIN(unemployment rate)} whose {member of} is {International Finance Corporation}  ?",
    "uid": 3447,
    "subgraph": "rank",
    "template_index": 669,
    "question": "What sovereign state belonging to the International Finance Corporation has the lowest unemployment rate?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q3624078 . ?ent wdt:P1198 ?obj . ?ent wdt:P463 wd:Q656801} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q3624078>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1198>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P463> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q656801> .\n\n}\nORDER BY ASC(?obj1)\nLIMIT 5",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Name the sovereign state belonging to the IFC that has the lowest unemployment rate.",
    "answers": [
      "Thailand",
      "Benin",
      "Rwanda",
      "Singapore",
      "Malaysia"
    ]
  },
  {
    "NNQT_question": "What is {father} of {child} of {Murry Guggenheim} ?",
    "uid": 30734,
    "subgraph": "left-subgraph",
    "template_index": 102,
    "question": "Who is the father of the child of Murray Guggenheim?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1702576 wdt:P40 ?X . ?X wdt:P22 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is the father of Murray Guggenheim child?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1702576 wdt:P3373 ?X . ?X wdt:P22 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {conversion to SI unit} of {material used} of {meat pie} ?",
    "uid": 30543,
    "subgraph": "right-subgraph",
    "template_index": 39,
    "question": "How would you convert to SI unit meat pie using the international phonetic alphabet?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q5367573 wdt:P186 ?X . ?X wdt:P2370 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "In what manner would you convert to SI unit meat pie utilizing international phonetic alphabet?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q5367573 wdt:P186 ?X . ?X wdt:P443 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Mémoire du cyclisme cyclist ID} of {George Washington}",
    "uid": 30989,
    "subgraph": "center",
    "template_index": 3712,
    "question": "What is the Mémoire du cyclisme cyclist ID for George Washington?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q23 wdt:P4516 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q193876 wdt:P4516 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {sports discipline} that {lake outflow} {World Rugby} and which contains the word {rugby} in their name",
    "uid": 31907,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3308,
    "question": "What is the sports discipline with World Rugby as lake outflow that contains the word 'rugby' in its name?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2312410 . ?sbj wdt:P201 wd:Q369225 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'rugby')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Tell me a sports discipline having World Rugby as lake outflow that carries the phrase 'rugby' in its title.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2312410 . ?sbj wdt:P797 wd:Q369225 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'rugby')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {forest} that contains the word {taiga} in their name",
    "uid": 31228,
    "subgraph": "string matching simple contains word",
    "template_index": 3805,
    "question": "TELL ME FOREST WHOSE NAME HAS THE WORD TAIGA IN IT",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4421 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'taiga')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let Me know FOREST WHOSE Title HAS THE WORD TAIGA IN IT",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2083910 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'taiga')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {authority} of {Vaduz} that is {start time} is {2007-01-01} ?",
    "uid": 31369,
    "subgraph": "statement_property",
    "template_index": 2735,
    "question": "Who became the authority of Vaduz on 2017-1-0?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1844 p:P797 ?s . ?s ps:P797 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2007')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Name the person who took over as  the authority of Vaduz on 2017-1-0.",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q1844 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2007')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]