[
  {
    "NNQT_question": "What is the {imprint} for {record label} of {50 Cent}",
    "uid": 20332,
    "subgraph": "simple question right",
    "template_index": 678,
    "question": "What is the record label that 50 Cent belongs to called",
    "sparql_wikidata": " select distinct ?obj where { wd:Q6060 wdt:P264 ?obj . ?obj wdt:P31 wd:Q2608849 } ",
    "sparql_dbpedia18": "select distinct ?obj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q6060> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P264> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj . ?obj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q2608849> } ",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the record name that 50 Cent has a place to called",
    "answers": [
      "Caroline Records"
    ]
  },
  {
    "NNQT_question": "Give me {particle radiation} that starts with {'n'}",
    "uid": 31231,
    "subgraph": "string matching simple contains word",
    "template_index": 754,
    "question": "What are the particle radiation which start with the letter n",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q945733 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the particle radiation that begins with letter n",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q186161 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {archaeological site} for {named after} of {Akhenaten}",
    "uid": 31882,
    "subgraph": "simple question right",
    "template_index": 421,
    "question": "Whre does Akhenaten name come from?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q81794 wdt:P138 ?obj . ?obj wdt:P31 wd:Q839954 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Akhenaten name derives from a specific place, what is it?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q81794 wdt:P20 ?obj . ?obj wdt:P31 wd:Q839954 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is <Austrian municipality key> of <Klagenfurt> ?",
    "uid": 26196,
    "subgraph": "center",
    "template_index": 493,
    "question": "WHICH IS THE AUSTRIAN MUNICIPALITY KEY OF  KLAGENFURT",
    "sparql_wikidata": "select distinct ?answer where { wd:Q41753 wdt:P964 ?answer}",
    "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q41753> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P964> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "answers": [
      "20101"
    ]
  },
  {
    "NNQT_question": "What is {date of death} of {Alexander Kolchak} that is {sourcing circumstances} is {presumably} ?",
    "uid": 31287,
    "subgraph": "statement_property",
    "template_index": 2988,
    "question": "What is Alexander Kolchak's persumed date of date according to sourcing circumstances?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q185718 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1480 wd:Q18122778 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "When is Alexander Kolchak believed to have died?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q227976 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1480 wd:Q18122778 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {surface roughness} {image compression} that contains the word {graphics} in their name",
    "uid": 31211,
    "subgraph": "string matching simple contains word",
    "template_index": 3594,
    "question": "Which thing with a surface roughness of image compression contains the word graphics in it's name?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P7083 wd:Q412438 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'graphics')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which element having a surface roughness of picture compression contains the word illustrations in it's name?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q412438 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'graphics')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {test method} of {Stanley Donen}",
    "uid": 30874,
    "subgraph": "center",
    "template_index": 3415,
    "question": "Which is the test method of Stanley Donen?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q48765 wdt:P4988 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q48765 wdt:P2604 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {companion of} of {NGC 4782}",
    "uid": 30913,
    "subgraph": "center",
    "template_index": 2044,
    "question": "What is NGC 4782's companion?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1114240 wdt:P399 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q14266 wdt:P399 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {date of death} of {Luca Pacioli} that is {earliest date} is {1517-4-0} ?",
    "uid": 3599,
    "subgraph": "statement_property",
    "template_index": 44,
    "question": "When is {date of death} of {Luca Pacioli} whose {earliest date} is {1517-4-0} ?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q87620 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1319 ?x filter(contains(YEAR(?x),'1517')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q87620> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P570> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P1319> <1517-4-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What year did Luca Pacioli died between 1517-4-0",
    "answers": [
      "1517-06-29T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is the {human} for {mother} of {Juan Luis Sanfuentes}",
    "uid": 31821,
    "subgraph": "simple question right",
    "template_index": 105,
    "question": "Who was Juan Luis Sanfuentes's mother?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q857 wdt:P25 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the name of Juan Luis Sanfuentes's mother?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q5284 wdt:P25 ?obj . ?obj wdt:P31 wd:Q5 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {capital} that {twinned administrative body} {Kiel} and which contains the word {tallinn} in their name",
    "uid": 24938,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2525,
    "question": "What is the capital city twinned to Kiel that contains the word \"tallinn \" in its name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5119 . ?sbj wdt:P190 wd:Q1707 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tallinn')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q5119>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1707>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tallinn')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What is the chemical reaction that begins with the letter s",
    "answers": [
      "Tallinn"
    ]
  },
  {
    "NNQT_question": "What is {spouse} of {Kagoshima} and {end time}",
    "uid": 31995,
    "subgraph": [],
    "template_index": 1393,
    "question": "To whom did Kagoshima got married and when did it end?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q15674 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "To whom did Kagoshima got hitched and when did it conclusion?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q364153 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {twinned administrative body} of {place of death} of {Max Maurenbrecher} ?",
    "uid": 30772,
    "subgraph": "left-subgraph",
    "template_index": 35279,
    "question": "What's the name of the sister town of the place where Max Maurenbrecher died?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q114635 wdt:P20 ?X . ?X wdt:P190 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What's the name of the sister town of the place where Max Maurenbrecher died?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1447299 wdt:P20 ?X . ?X wdt:P190 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {exemplar of} are to/by {The Book of Ruth} ?",
    "uid": 31738,
    "subgraph": "statement_property",
    "template_index": 1633,
    "question": "How is the The Book of Ruth exemplar?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1574 wd:Q64362212 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "What makes The Book of Ruth exemplar?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1574 wd:Q36766 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Movieplayer film ID} of {We Live in Public}",
    "uid": 31015,
    "subgraph": "center",
    "template_index": 1973,
    "question": "Which is the Movieplayer film ID for We Live in Public?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q372 wdt:P4783 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q168154 wdt:P4783 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {maintained by} are to/by {Fukuoka} ?",
    "uid": 1798,
    "subgraph": "statement_property",
    "template_index": 1142,
    "question": "What is the number of those maintained by Fukuoka?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P126 wd:Q26600 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P126> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q26600 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Which is the number of those maintained by Fukuoka?",
    "answers": [
      "270"
    ]
  },
  {
    "NNQT_question": "Give me {firearm} that contains the word {shotgun} in their name",
    "uid": 23401,
    "subgraph": "string matching simple contains word",
    "template_index": 2011,
    "question": "Tell me firearm whose name has the word shotgun in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12796 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'shotgun')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q12796>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'shotgun')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Disclose me firearm whose name has the word shotgun in it.",
    "answers": [
      "shotgun"
    ]
  },
  {
    "NNQT_question": "What is the {political party} for {member of the crew of} of {Fidel Castro}",
    "uid": 31849,
    "subgraph": "simple question right",
    "template_index": 590,
    "question": "Who is the  {political party} for {member of the crew of} of {Fidel Castro}",
    "sparql_wikidata": " select distinct ?obj where { wd:Q11256 wdt:P5096 ?obj . ?obj wdt:P31 wd:Q7278 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What political party had Fidel Castro as a member of the crew?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q11256 wdt:P102 ?obj . ?obj wdt:P31 wd:Q7278 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {statement is subject of} for {Shirley Booth} has {award received} as {Grammy Award for Best Pop Collaboration with Vocals} ?",
    "uid": 31545,
    "subgraph": "statement_property",
    "template_index": 4346,
    "question": "What was the category for which Shirley Booth received the Grammy Award for Best Pop Collaboration with Vocals?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q253308 p:P166 ?s . ?s ps:P166 wd:Q691203 . ?s pq:P805 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was the play that Shirley Booth received her Grammy Award for Best Pop Collaboration with Vocals?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q253308 p:P166 ?s . ?s ps:P166 wd:Q627778 . ?s pq:P805 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {head of government} of {Seattle} and {Nickel-Strunz '10th ed', review of (9th ed/ 2009 update)}",
    "uid": 32003,
    "subgraph": [],
    "template_index": 591,
    "question": "What is the head of government of Seattle's Nickel-Strunz '10th ed', review of (9th ed/ 2009 update)?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q5083 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P713 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What is the head of government of Seattle's review of (9th ed/ 2009 update) of Nickel-Strunz '10th ed'?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q5083 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P2031 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {continent} of {Ramsay MacDonald} and {elected in}",
    "uid": 32001,
    "subgraph": [],
    "template_index": 790,
    "question": "What is Ramsay MacDonald's continent and when was he elected?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q166646 p:P30 ?s . ?s ps:P30 ?obj . ?s pq:P2715 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "In what continent does Ramsay MacDonald live and when was once he elected?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q166646 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Hans Krebs} that is {point in time} is {1966-0-0} ?",
    "uid": 4903,
    "subgraph": "statement_property",
    "template_index": 1348,
    "question": "What is {award received} of {Hans Krebs} where {point in time} is {1966-0-0} ?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q57191 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1966')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q57191> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1966-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What is {grant gotten} of {Hans Krebs} where {point in time} is {1966-0-0} ?",
    "answers": [
      "honorary citizenship of Hildesheim"
    ]
  },
  {
    "NNQT_question": "What is {official religion} of {Durrani Empire}, that has {history of topic} is {history of Islam} ?",
    "uid": 30487,
    "subgraph": "right-subgraph",
    "template_index": 83,
    "question": "What official religion in the Durrani Empire has a history in Islam?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q467627 wdt:P3075 ?answer . ?answer wdt:P2184 wd:Q642379}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What official religion in the Durrani Realm features a history in Islam?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q467627 wdt:P140 ?answer . ?answer wdt:P2184 wd:Q642379}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {continent} of {country of origin} of {sonata} ?",
    "uid": 30739,
    "subgraph": "right-subgraph",
    "template_index": 91,
    "question": "What is the continent of the sonata country of origin?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q131269 wdt:P495 ?X . ?X wdt:P30 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the sonata country of origin continent?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q131269 wdt:P495 ?X . ?X wdt:P1334 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {creator} and the {executive producer} of {The Lone Gunmen} ?",
    "uid": 31975,
    "subgraph": "two intentions right subgraph",
    "template_index": 578,
    "question": "Who is The Lone Gunmen' creator and executive producer?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q1218201 wdt:P170 ?ans_1 . wd:Q1218201 wdt:P1431 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Who is the creator and executive producer of The Lone Gunmen?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q2744 wdt:P170 ?ans_1 . wd:Q2744 wdt:P1431 ?ans_2 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {active ingredient in} are for {Palmas} ?",
    "uid": 31675,
    "subgraph": "statement_property",
    "template_index": 523,
    "question": "How many active ingredients are in Palmas?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q178993 wdt:P3780 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What is the total number of active ingredients found in Palmas?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q216935 wdt:P3780 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {publication date} for {George Frideric Handel} has {educated at} as {University of Halle-Wittenberg} ?",
    "uid": 31647,
    "subgraph": "statement_property",
    "template_index": 1103,
    "question": "What was the publication date of George Frederic Handel during his graduation at the University of Halle-Wittenberg?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q7302 p:P69 ?s . ?s ps:P69 wd:Q32120 . ?s pq:P577 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was the publication date of George Frederic Handel when he completed his graduation from University of Halle-Wittenberg?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q7302 p:P69 ?s . ?s ps:P69 wd:Q32120 . ?s pq:P582 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Swedish urban area code} of {Cherkasy Oblast}",
    "uid": 30976,
    "subgraph": "center",
    "template_index": 2653,
    "question": "Which is the Swedish urban area code for Cherkasy Oblast?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q161808 wdt:P775 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q161808 wdt:P1077 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {airline hub} of {Air Alliance}",
    "uid": 30930,
    "subgraph": "center",
    "template_index": 1946,
    "question": "What is in the  airline hub of Air Alliance ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q406744 wdt:P113 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q32491 wdt:P113 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located in the administrative territorial entity} of {Sint Maarten} that is {start time} is {1954-12-15} ?",
    "uid": 4452,
    "subgraph": "statement_property",
    "template_index": 897,
    "question": "What administrative territorial entity was Sint Maarten located in the year December 15, 1954?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q26273 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1954')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q26273> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P131> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1954-12-15>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which government controlled Sint Maarten as of December 15th, 1954?",
    "answers": [
      "Netherlands Antilles",
      "Kingdom of the Netherlands"
    ]
  },
  {
    "NNQT_question": "How many {highest point} are to/by {Mount Ararat} ?",
    "uid": 1938,
    "subgraph": "statement_property",
    "template_index": 1282,
    "question": "What is the highest point by Mount Ararat?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P610 wd:Q72303 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P610> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q72303 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "For Mount Ararat, what is the highest point?",
    "answers": [
      "5"
    ]
  },
  {
    "NNQT_question": "What is {child} of {author} of {Think Like a Freak} ?",
    "uid": 30756,
    "subgraph": "left-subgraph",
    "template_index": 38,
    "question": "who child of writer of think like a freak ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q18786735 wdt:P50 ?X . ?X wdt:P40 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "who child of author of think like a crack ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q18786735 wdt:P50 ?X . ?X wdt:P737 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {student} of {Nadia Boulanger}, that has {place of death} is {Chilean Antarctic Territory} ?",
    "uid": 30414,
    "subgraph": "right-subgraph",
    "template_index": 551,
    "question": "\"Where is {disciples} of {Nadia Boulanger}, which has {location of death} is {Chilean Antarctic Territory} ?\"",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q140619 wdt:P802 ?answer . ?answer wdt:P20 wd:Q3626}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "\"Where are { disciples } of { Nadia Boulanger } who have { death location } is { Chilean Antarctic Territory }?\"",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q140619 wdt:P802 ?answer . ?answer wdt:P20 wd:Q25263}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {teatral.ro play/theater ID} of {New Brunswick}",
    "uid": 30954,
    "subgraph": "center",
    "template_index": 798,
    "question": "What is the theater ID of New Brunswick?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1965 wdt:P9202 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q1965 wdt:P2238 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {IAAF competition category} of {mysticism}, that has {different from} is {dharma} ?",
    "uid": 30431,
    "subgraph": "right-subgraph",
    "template_index": 34,
    "question": "What IAAF competition category of mysticism is distinguished from dharma?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q45996 wdt:P7069 ?answer . ?answer wdt:P1889 wd:Q134293}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What IAAF competition category of otherworldliness is recognized from dharma?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q45996 wdt:P1269 ?answer . ?answer wdt:P1889 wd:Q134293}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Arch Linux package} of {Visual Basic Script}",
    "uid": 31003,
    "subgraph": "center",
    "template_index": 1535,
    "question": "Which is the Arch Linux package for Visual Basic Script?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q13743 wdt:P3454 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q59 wdt:P3454 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]