[
  {
    "NNQT_question": "What is {population} of {place of birth} of {Barack Obama} ?",
    "uid": 30610,
    "subgraph": "right-subgraph",
    "template_index": 4975,
    "question": "Tell me the Human population and birthplace of Barack Obama?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q76 wdt:P19 ?X . ?X wdt:P1082 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "I would like the know in the birthplace of Barack Obama the Human population.",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q558666 wdt:P19 ?X . ?X wdt:P1082 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {relative} of {sibling} of {Frederick IV, Duke of Austria} ?",
    "uid": 30731,
    "subgraph": "left-subgraph",
    "template_index": 47,
    "question": "Did the brother of Frederick IV, Duke of Austria have any relatives?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q550692 wdt:P3373 ?X . ?X wdt:P1038 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Is it true that the brother of Frederick IV, Duke of Austria had relatives?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q550692 wdt:P3373 ?X . ?X wdt:P40 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {spouse} of {Gordon Cooper}",
    "uid": 31063,
    "subgraph": "center",
    "template_index": 1264,
    "question": "Who is the spouse of Gordon Cooper?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q312833 wdt:P26 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q312833 wdt:P2030 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {influenced by} of {Alexander Pichushkin}, that has {date of birth} is {1799-06-06} ?",
    "uid": 30448,
    "subgraph": "right-subgraph",
    "template_index": 4670,
    "question": "Who influenced Alexander Pichushkin who was born on May 26th, 1799.",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q317496 wdt:P737 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1799'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who impacted Alexander Pichushkin who was born on May 26th, 1799.",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q80440 wdt:P737 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1799'))}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {unmarried partner} of {Julio Iglesias} and {end cause}",
    "uid": 32020,
    "subgraph": [],
    "template_index": 614,
    "question": "Tell me about unmarried partner of Julio Iglesias and end cause?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q122003 p:P451 ?s . ?s ps:P451 ?obj . ?s pq:P1534 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Let me know unmarried partner of Julio Iglesias and conclusion cause?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q122003 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P1534 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {military rank} are to/by {shogun} ?",
    "uid": 2034,
    "subgraph": "statement_property",
    "template_index": 1378,
    "question": "How many shogun military ranks are there?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P410 wd:Q131767 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P410> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q131767 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "What number of shogun military ranks exist?",
    "answers": [
      "56"
    ]
  },
  {
    "NNQT_question": "What is {product} of {automotive industry}, that has {similar to} is {power-driven vehicle} ?",
    "uid": 14057,
    "subgraph": "right-subgraph",
    "template_index": 2,
    "question": "What is a product of the automotive industry that is similar to a power-driven vehicle?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q190117 wdt:P1056 ?answer . ?answer wdt:P460 wd:Q16589333}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q190117> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1056>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P460> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q16589333> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name an automotive industry product that is similar to a power driven vehicle.",
    "answers": [
      "motor vehicle"
    ]
  },
  {
    "NNQT_question": "What is {inhabitants} of {workplace} of {Willy Brandt} ?",
    "uid": 15965,
    "subgraph": "right-subgraph",
    "template_index": 140,
    "question": "Who works with Willy Brandt?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2514 wdt:P937 ?X . ?X wdt:P1082 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2514> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P937>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who does works with Willy Brandt?",
    "answers": [
      "3644826",
      "185103",
      "327258",
      "284677"
    ]
  }
]