[
  {
    "NNQT_question": "What is the {human} for {sibling} of {Joseph Conrad}",
    "uid": 30339,
    "subgraph": "simple question left",
    "template_index": 1812,
    "question": "Who is the sibling of Joseph Conrad?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P3373 wd:Q82925 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who has Joseph Conrad as brother?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1038 wd:Q82925 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {elected in} and {Wikimedia page-version URL} of {James Matheson} has {position held} as {Member of the 15th Parliament of the United Kingdom}",
    "uid": 32073,
    "subgraph": [],
    "template_index": 3,
    "question": "When was James Matheson elected as Member of the 15th Parliament of the United Kingdom and what is the relative Wikimedia page-version URL?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q4870843 p:P39 ?s . ?s ps:P39 wd:Q41582555 . ?s pq:P2715 ?value1 . ?s pq:P7569 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "In what year was James Matheson elected as a Member of the 15th Parliament of the UK and what is the Wikimedia page-version URL of this fact?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q4870843 p:P39 ?s . ?s ps:P39 wd:Q41582555 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {composer} of {Thomas Mitchell}",
    "uid": 30815,
    "subgraph": "center",
    "template_index": 3949,
    "question": "What is composed by Thomas Mitchell?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P86 wd:Q317026}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P161 wd:Q317026}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {record held} of {pole vault} and {dynamic viscosity}",
    "uid": 32024,
    "subgraph": [],
    "template_index": 902,
    "question": "which record did pole vault hold and which is his dynamic viscosity?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 ?obj . ?s pq:P3070 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "which record did post vault hold and which is his dynamic viscosity?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 ?obj . ?s pq:P2048 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {GeoNames ID} of {Aix-Marseille University}",
    "uid": 31047,
    "subgraph": "center",
    "template_index": 2907,
    "question": "What is GeoNames ID of Aix-Marseille University?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q2302586 wdt:P1566 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q2302586 wdt:P2196 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {borough of New York City} that {located in the administrative territorial entity} {Upper New York Bay} and which that starts with {'m'}",
    "uid": 31935,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2548,
    "question": "Name a borough of New York City located in Upper New York Bay that starts with letter M",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q408804 . ?sbj wdt:P131 wd:Q1064776 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "Name a borough of New York City located in Upper New York Bay that starts offevolved with letter M",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q408804 . ?sbj wdt:P206 wd:Q1064776 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Sandre river ID} of {bodybuilding}",
    "uid": 30827,
    "subgraph": "center",
    "template_index": 3010,
    "question": "What is the SANDRE ID for bodybuilding?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q124100 wdt:P1717 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q584 wdt:P1717 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {prevalence} of {Hulagu Khan}",
    "uid": 30830,
    "subgraph": "center",
    "template_index": 1443,
    "question": "Is Hulagu Khan prevalent?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q177320 wdt:P1193 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q12204 wdt:P1193 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {weekly newspaper} that starts with {'é'}",
    "uid": 24177,
    "subgraph": "string matching simple contains word",
    "template_index": 1302,
    "question": "What are the weekly newspaper  which start with the letter e",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2305295 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'é')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2305295>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'é')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the weekly newspapers whose first alphabet is e.",
    "answers": [
      "Élet és Tudomány",
      "Élet és Irodalom"
    ]
  },
  {
    "NNQT_question": "What is {area} of {Yellowstone National Park} that is {point in time} is {2015-01-01} ?",
    "uid": 31465,
    "subgraph": "statement_property",
    "template_index": 3183,
    "question": "How big was Yellowstone National Park area in 2015?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q351 p:P2046 ?s . ?s ps:P2046 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2015')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 2015 what was the extension of Yellowstone National Park area?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q351 p:P1174 ?s . ?s ps:P1174 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2015')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {owner of} are to/by {Mount Ararat} ?",
    "uid": 31767,
    "subgraph": "statement_property",
    "template_index": 1282,
    "question": "Who is the owner of by Mount Ararat?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1830 wd:Q72303 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "For Mount Ararat, who is its owner?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P610 wd:Q72303 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {shares border with} of {Hideki Tojo}, that has {inception} is {1984-01-01} ?",
    "uid": 30355,
    "subgraph": "right-subgraph",
    "template_index": 1573,
    "question": "Which borders of borders of Hideki Tojo have a start date of 1984?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q160847 wdt:P47 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1984'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which borders of borders of Hideki Tojo have a begin date of 1984?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q49243 wdt:P47 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1984'))}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {regulates} of {regulates} of {hsa-miR-4323} ?",
    "uid": 30641,
    "subgraph": "left-subgraph",
    "template_index": 219,
    "question": "What is the regulator that regulates the molecular biology of hsa-miR-4323?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q27593997 wdt:P128 ?X . ?X wdt:P128 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which regulator controls the molecular biology of HSA-MiR-4323?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q27593997 wdt:P128 ?X . ?X wdt:P2293 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {voice dubber} of {from work} of {Rukh} ?",
    "uid": 16350,
    "subgraph": "left-subgraph",
    "template_index": 48,
    "question": "WHO THE DUBBER OF RUKH FROM WORK?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q30060903 wdt:P1441 ?X . ?X wdt:P725 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q30060903> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1441>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P725> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "WHO THE DUBBER OF RUKH FROM WORK?",
    "answers": [
      "Alan Arkin",
      "Jeff Bridges",
      "Christopher Lee",
      "Mia Farrow",
      "Angela Lansbury",
      "René Auberjonois",
      "Nellie Bellflower",
      "Don Messick",
      "Robert Klein",
      "Keenan Wynn",
      "Brother Theodore",
      "Paul Frees",
      "Tammy Grimes"
    ]
  },
  {
    "NNQT_question": "What is {depicts} of {Juan Antonio Rios}, that has {direction relative to location} is {backwards} ?",
    "uid": 30359,
    "subgraph": "right-subgraph",
    "template_index": 254,
    "question": "What does the painting Juan Antonio Rios represent which has direction relative to location backwards?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q820 wdt:P180 ?answer . ?answer wdt:P654 wd:Q16938807}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What does the portray Juan Antonio Rios speak to which has direction relative to location backwards?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1978815 wdt:P180 ?answer . ?answer wdt:P654 wd:Q16938807}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {director} are to/by {Nathaniel Hawthorne} ?",
    "uid": 31768,
    "subgraph": "statement_property",
    "template_index": 1420,
    "question": "How much work has been directed by Nathaniel Hawthorne?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P57 wd:Q69339 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "How much work has Nathaniel Hawthorne directed?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1877 wd:Q69339 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Tansu Çiller} that is {point in time} is {1966-01-01} ?",
    "uid": 31272,
    "subgraph": "statement_property",
    "template_index": 1348,
    "question": "What is {award received} of {Tansu Çiller} where {point in time} is {1966-0-0} ?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q208377 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1966')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What is {grant gotten} of {Tansu Çiller} where {point in time} is {1966-0-0} ?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q57191 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1966')) }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {nominated by} {literary genre} that contains the word {vita} in their name",
    "uid": 31173,
    "subgraph": "string matching simple contains word",
    "template_index": 615,
    "question": "Tell me thing nominated by literary genre whose name has the word vita in it",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P4353 wd:Q223393 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vita')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me object nominated by scholarly sort whose title has the word vita in it",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223393 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vita')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {governor} of {Aosta Valley}, that has {employment} is {veterinarian} ?",
    "uid": 14215,
    "subgraph": "right-subgraph",
    "template_index": 3624,
    "question": "What governor of Aosta Valley was also a veterinarian?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1222 wdt:P6 ?answer . ?answer wdt:P106 wd:Q202883}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1222> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P6>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q202883> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What representative of Aosta Valley was too a veterinarian?",
    "answers": [
      "Augusto Rollandin"
    ]
  },
  {
    "NNQT_question": "Give me {Frederick William III of Prussia} that starts with {'s'}",
    "uid": 31140,
    "subgraph": "string matching simple contains word",
    "template_index": 1045,
    "question": "Tell me the name of a Frederick William III of Prussia that starts with the letter s.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q37134 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Let me know the title of a Frederick William III of Prussia that begins with the letter s.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20076756 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {oxidation state} of {Pará}, that has {population} is {13155} ?",
    "uid": 30390,
    "subgraph": "right-subgraph",
    "template_index": 9600,
    "question": "What is the oxidation rate of Para that have 13155 inhabitants?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q39517 wdt:P1121 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'13155'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me the name of Para oxidation rate with 13155 inhabitants",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q39517 wdt:P150 ?answer . ?answer wdt:P1082 ?x FILTER(contains(?x,'13155'))}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {born in} of {Frank Zamboni}, that has {has villages} is {Carbon County} ?",
    "uid": 13820,
    "subgraph": "right-subgraph",
    "template_index": 626,
    "question": "In which city in Carbon County was the invention of Frank Zamboni made?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1287174 wdt:P19 ?answer . ?answer wdt:P150 wd:Q156467}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1287174> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P150> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q156467> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which city in Carbon County did Frank Zamboni make his invention?",
    "answers": [
      "Utah"
    ]
  },
  {
    "NNQT_question": "What is {residence} of {Plutarco Elías Calles} and {area}",
    "uid": 31991,
    "subgraph": [],
    "template_index": 286,
    "question": "where does Plutarco Elías Calles reside?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q315066 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P2046 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "where does Plutarco Elías Calles reside?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q7747 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P2046 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {academic major} and {academic degree} of {Charles de Gaulle} has {educated at} as {The Queen's College}",
    "uid": 32080,
    "subgraph": [],
    "template_index": 292,
    "question": "When Charles de Gaulle attended Queen's College, what was his academic major and degree?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q2042 p:P69 ?s . ?s ps:P69 wd:Q73094 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What degree did Charles de Gaulle get at Queen's College and when?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q23760 p:P69 ?s . ?s ps:P69 wd:Q73094 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {worked for} of {Michelle Wolf}, that has {source location of group/organisation} is {New York City} ?",
    "uid": 12619,
    "subgraph": "right-subgraph",
    "template_index": 843,
    "question": "Who are worked for Michelle Wolf and its source location of group/organisation is located in New York City?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q23883085 wdt:P108 ?answer . ?answer wdt:P740 wd:Q60}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q23883085> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P108>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P740> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q60> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who are labored for Michelle Wolf and its source place of group/organisation is placed in New York City?",
    "answers": [
      "Bear Stearns"
    ]
  },
  {
    "NNQT_question": "What is {filming location} of {Konrad Adenauer}, that has {shares border with} is {Rhein-Berg District} ?",
    "uid": 30442,
    "subgraph": "right-subgraph",
    "template_index": 4135,
    "question": "What is the filming location of Konrad Adenauer, which is bordered by the Rhein-Berg District?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2492 wdt:P915 ?answer . ?answer wdt:P47 wd:Q6295}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is Konrad Adenauer's filming location, bordered by the district of Rhein - Berg?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q2492 wdt:P19 ?answer . ?answer wdt:P47 wd:Q6295}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {population} of {place of death} of {James Horner} ?",
    "uid": 30685,
    "subgraph": "right-subgraph",
    "template_index": 1703,
    "question": "What are the inhabitants of the location where James Horner died?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q106221 wdt:P20 ?X . ?X wdt:P1082 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "In the location where James Horner died, who are the inhabitants?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q37064 wdt:P20 ?X . ?X wdt:P1082 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {HanCinema person ID} of {Mohammad-Ali Rajai}",
    "uid": 30822,
    "subgraph": "center",
    "template_index": 1974,
    "question": "Which is HanCinema person ID for Mohammad-Ali Rajai?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q310592 wdt:P3045 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q180852 wdt:P3045 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {taxon synonym} of {Garryidae}",
    "uid": 30793,
    "subgraph": "center",
    "template_index": 2558,
    "question": "What is the taxon synonym of Garryidae?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1420 wd:Q46988516}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1420 wd:Q25314}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {dedicated to} of {Zadie Smith} that is {point in time} is {2006-01-01} ?",
    "uid": 31372,
    "subgraph": "statement_property",
    "template_index": 5260,
    "question": "What was dedicated to Zadie Smith in 2006?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q140052 p:P825 ?s . ?s ps:P825 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2006')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Name the element dedicated to by Zadie Smith in 2006.",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q140052 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2006')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {composer} are to/by {Yuji Naka} ?",
    "uid": 31772,
    "subgraph": "statement_property",
    "template_index": 1594,
    "question": "How many composers does Yuji Naka have?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P86 wd:Q726119 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Yuji Naka has what number of composers?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P943 wd:Q726119 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {statement is subject of} for {Grace Kelly} has {conferred by} as {Academy Award for Best Actress} ?",
    "uid": 31585,
    "subgraph": "statement_property",
    "template_index": 4244,
    "question": "Which of Grace Kelly's works was conferred by Academy Award for the Best Actress?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q3925 p:P1027 ?s . ?s ps:P1027 wd:Q103618 . ?s pq:P805 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What project of Grace Kelly was conferred by Best Actress nomination for an Oscar?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q3925 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P805 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {WomenWriters ID} of {Nicole Richie}",
    "uid": 30291,
    "subgraph": "simple question left",
    "template_index": 1857,
    "question": "Who is Nicole Richie's WomenWriters ID?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2533 wd:Q232495 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What women is Nicole Richie's WomenWriters ID?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P25 wd:Q232495 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {season starts} of {Prague}",
    "uid": 30773,
    "subgraph": "center",
    "template_index": 3532,
    "question": "Which { meansseason starts} in {Prague} ?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P4794 wd:Q1085}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P4794 wd:Q109}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nomination received} of {George Marshall}, that has {champion} is {Mikhail Gorbachev} ?",
    "uid": 11858,
    "subgraph": "right-subgraph",
    "template_index": 2430,
    "question": "\"Who is {nomination received} of {George Marshall}, which has {champion} is {Mikhail Gorbachev} ?\"",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q151414 wdt:P1411 ?answer . ?answer wdt:P1346 wd:Q30487}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q151414> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1346> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q30487> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "\"Who is {nomination received} of {George Marshall}, which has {champion} is {Mikhail Gorbachev} ?\"",
    "answers": [
      "Nobel Peace Prize"
    ]
  }
]