[
  {
    "NNQT_question": "What is {temperature} of {on river} of {Iberian Peninsula} ?",
    "uid": 17599,
    "subgraph": "right-subgraph",
    "template_index": 452,
    "question": "What is {temperature} {on river} of {Iberian Peninsula} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q12837 wdt:P206 ?X . ?X wdt:P2076 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q12837> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P206>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2076> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the { temperature } of { Iberian Peninsula } on the river?",
    "answers": [
      "18"
    ]
  },
  {
    "NNQT_question": "What is {Italian Senate ID} of {George Washington}",
    "uid": 31021,
    "subgraph": "center",
    "template_index": 546,
    "question": "Which is the Italian Senate ID for George Washington?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q23 wdt:P3954 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q43440 wdt:P3954 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Encyclopædia Universalis author ID} of {Brexit}",
    "uid": 30946,
    "subgraph": "center",
    "template_index": 467,
    "question": "Which is the Encyclopædia Universalis author ID for Brexit?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q7888194 wdt:P5369 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q7888194 wdt:P5184 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {essence} for {relative permittivity} of {social science}",
    "uid": 30289,
    "subgraph": "simple question left",
    "template_index": 3524,
    "question": "What is social science relative permittivity essence?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P5675 wd:Q34749 . ?sbj wdt:P31 wd:Q190995 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Social science is the relative permittivity of what?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2579 wd:Q34749 . ?sbj wdt:P31 wd:Q190995 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Aarne–Thompson–Uther Tale Type Index} of {The Little Mermaid}",
    "uid": 31048,
    "subgraph": "center",
    "template_index": 3787,
    "question": "Which is the Aarne–Thompson–Uther Tale Type Index of The Little Mermaid?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q11859 wdt:P2540 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q11859 wdt:P3675 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {location born} of {Jamshid Mashayekhi}, that has {partner town} is {Havana} ?",
    "uid": 12938,
    "subgraph": "right-subgraph",
    "template_index": 1382,
    "question": "When is the location born in Jamshid Mashayekhi which is a partner town of Havana?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3026288 wdt:P19 ?answer . ?answer wdt:P190 wd:Q1563}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q3026288> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1563> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "When is the area born in Jamshid Mashayekhi which may be a accomplice town of Havana?",
    "answers": [
      "Tehran"
    ]
  },
  {
    "NNQT_question": "What is the {position held} and the {place of birth} of {David Icke} ?",
    "uid": 31985,
    "subgraph": "two intentions right subgraph",
    "template_index": 23,
    "question": "Where was David Icke born and what position does he hold?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q333118 wdt:P39 ?ans_1 . wd:Q333118 wdt:P19 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What position does David Icke hold?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q333118 wdt:P413 ?ans_1 . wd:Q333118 wdt:P19 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {survival skill} that {followed by} {food presentation} and which contains the word {cooking} in their name",
    "uid": 25123,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2178,
    "question": "Tell me the survival skill that followed by food presentation and which contains the word cooking in their name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q891382 . ?sbj wdt:P156 wd:Q3480053 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cooking')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q891382>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P156> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3480053>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cooking')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Tell me the survival ability that accompanied by meals presentation and which carries the word cooking in their identify",
    "answers": [
      "cooking"
    ]
  },
  {
    "NNQT_question": "What is {educated at} of {Grace Hopper} that is {end time} is {1930-0-0} ?",
    "uid": 9426,
    "subgraph": "statement_property",
    "template_index": 5871,
    "question": "Where was Grace Hopper educated at in 1930?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q11641 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1930')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q11641> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P69> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P582> <1930-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What school did Grace Hopper attend in 1930?",
    "answers": [
      "Yale University"
    ]
  },
  {
    "NNQT_question": "What is {results in} of {developed by} of {iPod Touch 6} ?",
    "uid": 16277,
    "subgraph": "left-subgraph",
    "template_index": 2154,
    "question": "What are the results of the iPod Touch 6 developers?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q20670531 wdt:P178 ?X . ?X wdt:P1056 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q20670531> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P178>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1056> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What are the comes about of the iPod Touch 6 developers?",
    "answers": [
      "iPhone"
    ]
  },
  {
    "NNQT_question": "What is {member of} of {Canada} that is {start time} is {1966-1-1} ?",
    "uid": 4809,
    "subgraph": "statement_property",
    "template_index": 1254,
    "question": "Who is the member of Canada that was elected on January 1st, 1966?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q16 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1966')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q16> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P463> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1966-1-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Could you provide the member of Canada elected on January 1st, 1966?.",
    "answers": [
      "Asian Development Bank"
    ]
  },
  {
    "NNQT_question": "What is the {stygofauna} with the {MAX(number of victims of killer)} whose {native language} is {French} ?",
    "uid": 31111,
    "subgraph": "rank",
    "template_index": 132,
    "question": "Which French stygofauna killer had the most victims ?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q7629362 . ?ent wdt:P1345 ?obj . ?ent wdt:P103 wd:Q150 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "What stygofauna killer from France had the most victims?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1345 ?obj . ?ent wdt:P103 wd:Q150 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {subsidiary} of {is owned by} of {Laserdisc} ?",
    "uid": 15930,
    "subgraph": "right-subgraph",
    "template_index": 63,
    "question": "What is the subsidiary of which is owned by of Laserdisc ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q273309 wdt:P127 ?X . ?X wdt:P199 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q273309> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P127>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P199> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "what subsidiary is owned by Laserdisc?",
    "answers": [
      "Philips Lighting",
      "Philips Healthcare",
      "Philips Consumer Lifestyle",
      "Philips Interactive Media Systems"
    ]
  },
  {
    "NNQT_question": "What is the {applies to jurisdiction} and the {location of formation} of {Google} ?",
    "uid": 31951,
    "subgraph": "two intentions right subgraph",
    "template_index": 380,
    "question": "where is the location of  formation of google located and to what jurisdiction does Google apply?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q95 wdt:P1001 ?ans_1 . wd:Q95 wdt:P740 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Where was the first location of formation of Google located and what is the jurisdiction Google applies to?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q95 wdt:P159 ?ans_1 . wd:Q95 wdt:P740 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {master} of {Michel de Montaigne}, that has {native name} is {Marc Antoine Muret} ?",
    "uid": 13945,
    "subgraph": "right-subgraph",
    "template_index": 2456,
    "question": "What is the master name of Michel de Montaigne, who has the native name Marc Antoine Muret?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q41568 wdt:P1066 ?answer . ?answer wdt:P1559 ?x FILTER(contains(?x,'Marc Antoine Muret'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q41568> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1066>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1559> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <Marc Antoine Muret> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the ace title of Michel de Montaigne, who has the local title Marc Antoine Muret?",
    "answers": [
      "Muretus"
    ]
  },
  {
    "NNQT_question": "What is {occupant} of {Windsor Castle}, that has {sports season of league or competition} is {postage stamp designer} ?",
    "uid": 30384,
    "subgraph": "right-subgraph",
    "template_index": 2556,
    "question": "Who is the tenant of Windsor Castle, which sports season of league or competition is postage stamp designer?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q42646 wdt:P466 ?answer . ?answer wdt:P3450 wd:Q2000124}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is inhabitant of Windsor Castle, which sports season of league or competition is postage stamp planner?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q42646 wdt:P466 ?answer . ?answer wdt:P106 wd:Q2000124}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {wears} of {prime factor} of {The Silent Stars Go By} ?",
    "uid": 30547,
    "subgraph": "left-subgraph",
    "template_index": 7,
    "question": "What type of clothing do the prime factor in The Silent Stars Go By wear?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7764234 wdt:P5236 ?X . ?X wdt:P3828 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which is the type of clothing that the prime factor in The Silent Stars Go By wear?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q7764234 wdt:P674 ?X . ?X wdt:P3828 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {family name} of {Edmund Gwenn}, that has {said to be the same as} is {Hans} ?",
    "uid": 30478,
    "subgraph": "right-subgraph",
    "template_index": 1320,
    "question": "What is the surname of Edmund Gwenn similar to Hans?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q344750 wdt:P734 ?answer . ?answer wdt:P460 wd:Q632842}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me Edmun Gwenn surname similar to Hans",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q344750 wdt:P735 ?answer . ?answer wdt:P460 wd:Q632842}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {uses} of {sport} of {Simferopol} ?",
    "uid": 30512,
    "subgraph": "right-subgraph",
    "template_index": 233,
    "question": "What is the use of playing Simferopol?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q19566 wdt:P641 ?X . ?X wdt:P2283 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the utilize of playing Simferopol?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q369225 wdt:P641 ?X . ?X wdt:P2283 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {date of death} of {Arturo Alessandri} that is {earliest date} is {1240-01-01} ?",
    "uid": 31345,
    "subgraph": "statement_property",
    "template_index": 4435,
    "question": "What was Arturo Alessandri's date of death in the year 1240?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q848 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1319 ?x filter(contains(YEAR(?x),'1240')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "On what date did Arturo Alessandri die in 1240?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q8763 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1319 ?x filter(contains(YEAR(?x),'1240')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {series ordinal} for {osmium sulfide} has {ionization energy} as {12.6} ?",
    "uid": 31606,
    "subgraph": "statement_property",
    "template_index": 178,
    "question": "which series ordinal of osmium sulfide has ionization energy of 12.6?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q4445864 p:P2260 ?s . ?s ps:P2260 ?x filter(contains(?x,'12.6')) . ?s pq:P1545 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "The ionization energy of 12.6 belongs to which series ordinal of osmium sulfide?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q422021 p:P2260 ?s . ?s ps:P2260 ?x filter(contains(?x,'12.6')) . ?s pq:P1545 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {musical instrument model} with the {MAX(chromosome count)} ?",
    "uid": 31081,
    "subgraph": "rank",
    "template_index": 356,
    "question": "Which musical instrument model has the highest chromosome count?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q29982117 . ?ent wdt:P5230 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "Which musical instrument model has the highest number of chromosomes?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P5230 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {twinned administrative body} of {Veilly} that is {start time} is {1962-01-01} ?",
    "uid": 31425,
    "subgraph": "statement_property",
    "template_index": 1022,
    "question": "What is the twinned administrative body of Veilly, which started in 1 Jan 1962?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q16239 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1962')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What administrative body is paired with Veilly, which started in 1 Jan 1962?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q6602 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1962')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {work location} of {Yevgeny Baratynsky} that is {located in the administrative territorial entity} is {Kirsanov Uyezd} ?",
    "uid": 31387,
    "subgraph": "statement_property",
    "template_index": 1457,
    "question": "What is work location of Yevgeny Baratynsky, located in the territorial entity of Kirsanov Uyezd?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q364252 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P131 wd:Q4221842 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Tell me Yevgeny Baratynsky work location in the province of Kirsanov Uyezd.",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q364252 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q4221842 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {notable work} of {doctoral advisor} of {Joseph Gurney Cannon} ?",
    "uid": 30530,
    "subgraph": "left-subgraph",
    "template_index": 29,
    "question": "What is the bibliography of the  PhD advisor to Joseph Gurney Cannon?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q984248 wdt:P184 ?X . ?X wdt:P800 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the bibliography of the PhD guide to Joseph Gurney Cannon?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q84763 wdt:P184 ?X . ?X wdt:P800 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {number of out-of-school children} of {country of origin} of {Londonderry Air} ?",
    "uid": 30681,
    "subgraph": "right-subgraph",
    "template_index": 717,
    "question": "How many children are out of school at Londonderry Air?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q300464 wdt:P495 ?X . ?X wdt:P2573 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What number of youngsters are out of school at Londonderry Air?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q252123 wdt:P495 ?X . ?X wdt:P2573 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {member of sports team} are for {Paul Gascoigne} ?",
    "uid": 1173,
    "subgraph": "statement_property",
    "template_index": 173,
    "question": "Is Paul Gascoigne a member of a sports team?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q13002 wdt:P54 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q13002> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P54> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What sports team is Paul Gascoigne a member of?",
    "answers": [
      "12"
    ]
  },
  {
    "NNQT_question": "What is {nominated for} of {Gene Wolfe} that is {dissolved, abolished or demolished date} is {1990-01-01} ?",
    "uid": 31376,
    "subgraph": "statement_property",
    "template_index": 1644,
    "question": "What was Gene Wolfe nominated for and abolished in 1990?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q361149 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P576 ?x filter(contains(YEAR(?x),'1990')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which award was Gene Wolfe nominated for and abolished in 1990?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q361149 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1990')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {spouse} of {Guangxu Emperor} and {end time}",
    "uid": 31992,
    "subgraph": [],
    "template_index": 86,
    "question": "Who is the spouse of Guangxu Emperor and when did they divorce?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q299710 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Who is the companion of Guangxu Emperor and when did they divorce?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q11617 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Soyuz-TM} with the {MAX(orbital period)} whose {country} is {Kazakhstan} ?",
    "uid": 31134,
    "subgraph": "rank",
    "template_index": 167,
    "question": "Which Kazakhstani Soyuz-TM has the greatest orbital period?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q2705481 . ?ent wdt:P2146 ?obj . ?ent wdt:P17 wd:Q232 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Name the Kazakhstani Soyuz-TM  with the largest orbital period.",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q2705481 . ?ent wdt:P2146 ?obj . ?ent wdt:P1158 wd:Q232 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {guest of honor} for {migraine disorder} has {genetic association} as {PRDM16} ?",
    "uid": 31531,
    "subgraph": "statement_property",
    "template_index": 3112,
    "question": "What is migraines guest of honor when having PRDM16 gene association?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q133823 p:P2293 ?s . ?s ps:P2293 wd:Q18045527 . ?s pq:P967 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What are the guests of honor when PRDM16 is present in a migraine?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q133823 p:P2293 ?s . ?s ps:P2293 wd:Q18045527 . ?s pq:P459 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {ceremony} that contains the word {umhlanga} in their name",
    "uid": 23534,
    "subgraph": "string matching simple contains word",
    "template_index": 3797,
    "question": "tell me ceremony whose name has the word umhlanga in it",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2627975 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'umhlanga')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2627975>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'umhlanga')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me the ceremony in which the word umhlanga is named",
    "answers": [
      "Umhlanga"
    ]
  },
  {
    "NNQT_question": "Give me {Goya Awards} that contains the word {world} in their name",
    "uid": 31195,
    "subgraph": "string matching simple contains word",
    "template_index": 3619,
    "question": "Tell me Goya Awards whose name has the word world in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q212828 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'world')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know Goya Awards whose name has the word world in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18608583 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'world')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]