[
  {
    "NNQT_question": "Give me {public company} that contains the word {yandex} in their name",
    "uid": 23132,
    "subgraph": "string matching simple contains word",
    "template_index": 314,
    "question": "Tell me public company whose name has the word yandex in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q891723 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yandex')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q891723>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yandex')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know open company whose title has the word yandex in it.",
    "answers": [
      "Yandex",
      "Yandex Labs",
      "Yandex N.V."
    ]
  },
  {
    "NNQT_question": "What is the {Roman cognomen} and the {hair color} of {Xi Jinping} ?",
    "uid": 31967,
    "subgraph": "two intentions right subgraph",
    "template_index": 465,
    "question": "Which is the {Roman cognomen} of the {hair color} of {Xi_Jinping} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q15031 wdt:P2365 ?ans_1 . wd:Q15031 wdt:P1884 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Of {Xi_Jinping} what was the {Roman cognomen} of the {hair color}?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q15031 wdt:P1340 ?ans_1 . wd:Q15031 wdt:P1884 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {award received} for {Dawn Fraser} has {participant in} as {Qianlong Emperor} ?",
    "uid": 31484,
    "subgraph": "statement_property",
    "template_index": 5274,
    "question": "What is the name of award recieved for Dawn Fraser has participant of Qianlong Emperor ?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q229040 p:P1344 ?s . ?s ps:P1344 wd:Q19133 . ?s pq:P166 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What award did Dawn Fraser get in the Qianlong Emperor?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q229040 p:P1344 ?s . ?s ps:P1344 wd:Q8415 . ?s pq:P166 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {demonstrates sense} of {kickboxing}",
    "uid": 30862,
    "subgraph": "center",
    "template_index": 830,
    "question": "What is the demonstrates sense for kickboxing?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q178678 wdt:P6072 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q178678 wdt:P4854 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {territory claimed by} of {capital of} of {Catania} ?",
    "uid": 30670,
    "subgraph": "right-subgraph",
    "template_index": 2379,
    "question": "The country of Catania has which claimed territory?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1903 wdt:P1376 ?X . ?X wdt:P1336 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "The nation of Catania has which claimed territory?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q1903 wdt:P1376 ?X . ?X wdt:P150 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {child} of {Pompey} that is {mother} is {Mucia Tertia} ?",
    "uid": 8905,
    "subgraph": "statement_property",
    "template_index": 5350,
    "question": "Who is the child of Pompey and the mother, Mucia Tertia?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q125414 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P25 wd:Q273616 }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q125414> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P40> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P25> <http://wikidata.dbpedia.org/resource/Q273616>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What kid did Pompey and Mucia Tertia have?",
    "answers": [
      "Gnaeus Pompeius",
      "Pompeia Magna",
      "Sextus Pompey"
    ]
  },
  {
    "NNQT_question": "What is {native label} of {participant} of {Ashanti–Akim–Akwapim War} ?",
    "uid": 30593,
    "subgraph": "right-subgraph",
    "template_index": 1131,
    "question": "What is competitor {Ashanti–Akim–Akwapim War's name in its original language?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q722041 wdt:P710 ?X . ?X wdt:P1705 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is competitor {Ashanti–Akim–Akwapim War's title in its unique language?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q58947 wdt:P710 ?X . ?X wdt:P1705 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {rotary cannon} that {designed by} {General Electric} and which that starts with {'m'}",
    "uid": 25422,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2539,
    "question": "What rotary cannon did General Electric design that starts with the letter \"m\"?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1966482 . ?sbj wdt:P287 wd:Q54173 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1966482>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P287> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q54173>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "What rotary cannon did General Electric graph that starts with the letter \"m\"?",
    "answers": [
      "Minigun"
    ]
  },
  {
    "NNQT_question": "What is {first described} of {ideology} of {Progressive Party} ?",
    "uid": 17331,
    "subgraph": "left-subgraph",
    "template_index": 302,
    "question": "What is the first described of the ideology of Progressive Party?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7248784 wdt:P1142 ?X . ?X wdt:P61 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7248784> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1142>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P61> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the primary depicted of the philosophy of Dynamic Party?",
    "answers": [
      "Edmund Burke"
    ]
  },
  {
    "NNQT_question": "Give me {comics critic} that contains the word {team} in their name",
    "uid": 31150,
    "subgraph": "string matching simple contains word",
    "template_index": 2790,
    "question": "Tell me comics critic whose name has the word team in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21207686 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'team')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Disclose me comics critic whose name has the word team in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6979593 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'team')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {working language} of {sovereign state} of {Alice Springs} ?",
    "uid": 14293,
    "subgraph": "right-subgraph",
    "template_index": 843,
    "question": "What is the official language of Alice springs-Soverign state?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q17872 wdt:P17 ?X . ?X wdt:P2936 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q17872> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P17>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2936> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the official dialect of Alice springs-Soverign state?",
    "answers": [
      "French",
      "German",
      "Turkish",
      "Italian",
      "Spanish",
      "Hindi",
      "Urdu",
      "English",
      "Gujarati",
      "Japanese",
      "Tamil",
      "Croatian",
      "Russian",
      "Greek",
      "Persian",
      "Korean",
      "Cantonese",
      "Mandarin Chinese",
      "Vietnamese",
      "Thai",
      "Indonesian",
      "Macedonian",
      "Serbian",
      "Bengali",
      "Sinhala",
      "Arabic",
      "Auslan",
      "Filipino",
      "Nyangumarta",
      "Nepali",
      "Tagalog",
      "Yankunytjatjara",
      "Yanyuwa",
      "Dyirbal",
      "Kriol",
      "Gaagudju",
      "Malayalam",
      "Torres Strait Creole",
      "Guugu Yimithirr",
      "Punjabi",
      "Bunuba",
      "Meriam",
      "Antakarinya",
      "Pakanha",
      "Australian Aboriginal sign languages",
      "Martuthunira",
      "Dharug",
      "Kija",
      "Ngarinyin",
      "Dhurga"
    ]
  },
  {
    "NNQT_question": "Give me {reference model} that contains the word {model} in their name",
    "uid": 23855,
    "subgraph": "string matching simple contains word",
    "template_index": 3260,
    "question": "Tell me reference model whose name has the word model in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q356674 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'model')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q356674>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'model')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Let me know reference demonstrate whose title has the word show in it.",
    "answers": [
      "Information visualization reference model",
      "ARPANET Reference Model",
      "OSI model"
    ]
  },
  {
    "NNQT_question": "What is {defining formula} of {shape} of {plate heat exchanger} ?",
    "uid": 30615,
    "subgraph": "right-subgraph",
    "template_index": 0,
    "question": "Which is the mathematical formula of the shape of the plate heat exchanger?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q261231 wdt:P1419 ?X . ?X wdt:P2534 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is the mathematical method of the shape of the plate heat exchanger?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q193886 wdt:P1419 ?X . ?X wdt:P2534 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {population} of {cobbler} that is {point in time} is {2007-01-01} ?",
    "uid": 31265,
    "subgraph": "statement_property",
    "template_index": 4419,
    "question": "On 0-0-2007, what is the populaton of cobbler?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q152355 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was the population of cobbler at the beginning of 2007?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q187805 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {ship} with the {MIN(payload mass)} whose {manufacturer} is {ERROR1}  ?",
    "uid": 3449,
    "subgraph": "rank",
    "template_index": 671,
    "question": "What is the ship with the lowest payload mass whose manufacturer is ERROR1?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q11446 . ?ent wdt:P4519 ?obj . ?ent wdt:P176 wd:Q16606610} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q11446>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P4519>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P176> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q16606610> .\n\n}\nORDER BY ASC(?obj1)\nLIMIT 5",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Which ship made by ERROR1 has the lowest payload mass?",
    "answers": [
      "Bourbon Oceanteam 101",
      "Lay Vessel 108",
      "Lay Vessel North Ocean 105",
      "North Sea Giant"
    ]
  },
  {
    "NNQT_question": "Give me {subclass of} {Olympic sport} that starts with {'w'}",
    "uid": 31256,
    "subgraph": "string matching simple contains word",
    "template_index": 2310,
    "question": "WHAT ARE THE SUBCLASS OF OLYMPIC SPORT WHICH START WITH THE LETTER W.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P279 wd:Q212434 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "WHAT ARE LETTER WITH THE SUBCLASS OF OLYMPIC SPORT WHICH START.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q212434 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {IPC.infostradasports.com athlete ID} of {Marc Girardelli}",
    "uid": 30937,
    "subgraph": "center",
    "template_index": 924,
    "question": "Which is the International Paralympic Committee athlete ID for Marc Girardelli?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q2031 wdt:P4397 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q201377 wdt:P4397 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {eye color} and the {hair color} of {Xi_Jinping} ?",
    "uid": 10150,
    "subgraph": "two intentions right subgraph",
    "template_index": 465,
    "question": "Which is the {eye color} of the {hair color} of {Xi_Jinping} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q15031 wdt:P1340 ?ans_1 . wd:Q15031 wdt:P1884 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q15031> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1340> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q15031> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1884> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Of {Xi_Jinping} what was the {eye color} of the {hair color}?",
    "answers": [
      "black",
      "black hair"
    ]
  },
  {
    "NNQT_question": "What is {country} of {Tyumen} that is {history of topic} is {1991-12-27} ?",
    "uid": 31316,
    "subgraph": "statement_property",
    "template_index": 4651,
    "question": "what was the country of Tyumen in history of 1991-12-27",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q5815 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P2184 ?x filter(contains(YEAR(?x),'1991')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In history of December 27, 1991, what country was Tyumen associated with?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q5815 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1991')) }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Pedro Aguirre Cerda} has {member of political party} as {Liberal National Party of Queensland} ?",
    "uid": 31611,
    "subgraph": "statement_property",
    "template_index": 3128,
    "question": "In which year Pedro Aguirre Cerda joined as a member of political party in Liberal National Party of Queensland?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q845 p:P102 ?s . ?s ps:P102 wd:Q1822905 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Pedro Aguirre Cerda joined the Liberal National Party of Queensland in what year?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q550879 p:P102 ?s . ?s ps:P102 wd:Q1822905 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Nicolás Maduro} has {located in time zone} as {Secretary General of the Non-Aligned Movement} ?",
    "uid": 31597,
    "subgraph": "statement_property",
    "template_index": 75,
    "question": "When did Nicolás Maduro start the location in Secretary General of the Non-Aligned Movement time zone?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q58132 p:P421 ?s . ?s ps:P421 wd:Q15647601 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "At which point in time did Nicolás Maduro start the location in Secretary General of the Non-Aligned Movement time zone?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q58132 p:P39 ?s . ?s ps:P39 wd:Q15647601 . ?s pq:P580 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {family} of {Singapore Airlines}",
    "uid": 30952,
    "subgraph": "center",
    "template_index": 594,
    "question": "Who is the family of Singapore Airlines?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q32245 wdt:P53 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q32245 wdt:P114 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Sächsische Biografie ID} of {Antonio Vivaldi}",
    "uid": 30998,
    "subgraph": "center",
    "template_index": 1624,
    "question": "What is Sächsische Biografie of Antonio Vivaldi ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1340 wdt:P1710 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q191748 wdt:P1710 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {has sister} of {Henry V, Holy Roman Emperor}, that has {year of death} is {1101-7-27} ?",
    "uid": 11788,
    "subgraph": "right-subgraph",
    "template_index": 1680,
    "question": "\"Who was the sister of Henry V, the Holy Roman Emperor during his death in the year of 1101-7-27\"?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q151707 wdt:P3373 ?answer . ?answer wdt:P570 ?x FILTER(contains(YEAR(?x),'1101'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q151707> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3373>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P570> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <1101-7-27> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "\"Who was the sister of Henry V, the Heavenly Roman Head amid his passing within the year of 1101-7-27\"?",
    "answers": [
      "Conrad II of Italy",
      "Conrad II of Italy"
    ]
  },
  {
    "NNQT_question": "What is {owned by} of {4chan} that is {spacecraft docking/undocking date} is {2015-09-21} ?",
    "uid": 31382,
    "subgraph": "statement_property",
    "template_index": 926,
    "question": "Who bought 4chan in spacecraft docking/undocking date of 2015?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q238330 p:P127 ?s . ?s ps:P127 ?obj . ?s pq:P622 ?x filter(contains(YEAR(?x),'2015')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In spacecraft docking/undocking date of 2015, who purchased 4chan?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q238330 p:P127 ?s . ?s ps:P127 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2015')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {interested in} are for {Daniel Dennett} ?",
    "uid": 1424,
    "subgraph": "statement_property",
    "template_index": 424,
    "question": "How many are interested in Daniel Dennett?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q215263 wdt:P2650 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q215263> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2650> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Daniel Dennett is interested in by how many people?",
    "answers": [
      "4"
    ]
  },
  {
    "NNQT_question": "What is {discoverer or inventor} of {notable work} of {Nick Faldo} ?",
    "uid": 30738,
    "subgraph": "left-subgraph",
    "template_index": 329,
    "question": "What notable work did Nick Faldo discover or invent?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q531520 wdt:P800 ?X . ?X wdt:P61 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which was the discovery or invention notable work of Nick Faldo?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q531520 wdt:P793 ?X . ?X wdt:P61 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {worked at} of {manager/director} of {École Normale Supérieure} ?",
    "uid": 14900,
    "subgraph": "left-subgraph",
    "template_index": 6,
    "question": "Who worked as the manager/director of École Normale Supérieure?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q83259 wdt:P1037 ?X . ?X wdt:P108 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q83259> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1037>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P108> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Give me the name of the manager/director of École Normale Supérieure?",
    "answers": [
      "École normale supérieure"
    ]
  },
  {
    "NNQT_question": "How many {member of sports team} are to/by {brown} ?",
    "uid": 31730,
    "subgraph": "statement_property",
    "template_index": 1101,
    "question": "How many member of sports teams are next to brown",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P54 wd:Q47071 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Which is the number of member of sports teams that are next to brown?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P462 wd:Q47071 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {timezone} of {head office location} of {Uber} ?",
    "uid": 15667,
    "subgraph": "right-subgraph",
    "template_index": 409,
    "question": "Tell me the timezone of the main office of the company Uber",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q780442 wdt:P159 ?X . ?X wdt:P421 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q780442> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P159>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P421> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Let me know the timezone of the most office of the company Uber",
    "answers": [
      "UTC−08:00",
      "Pacific Time Zone"
    ]
  },
  {
    "NNQT_question": "What is {award received} of {Karl von Frisch} that is {point in time} is {1921-1-1} ?",
    "uid": 7516,
    "subgraph": "statement_property",
    "template_index": 3961,
    "question": "What award did Karl von Frisch receive in 1921?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q60060 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1921')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q60060> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1921-1-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1921, Karl von Firsch won what award?",
    "answers": [
      "Lieben Prize"
    ]
  }
]