[
  {
    "NNQT_question": "What is the {copyright representative} for {Veronica Lake} has {spouse} as {André de Toth} ?",
    "uid": 31516,
    "subgraph": "statement_property",
    "template_index": 2549,
    "question": "What was Veronica Lake and Andre dé Toth wedding copyright representative?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q84232 p:P26 ?s . ?s ps:P26 wd:Q518244 . ?s pq:P6275 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "what was Veronica Lake and Andre dé Toth wedding copyright representative?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q84232 p:P26 ?s . ?s ps:P26 wd:Q518244 . ?s pq:P582 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Daum movie ID} of {12 Angry Men}",
    "uid": 31050,
    "subgraph": "center",
    "template_index": 2541,
    "question": "Which is the Daum movie ID for 12 Angry Men?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q2345 wdt:P4277 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q2345 wdt:P444 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {electron configuration} for {John Grisham} has {educated at} as {University of Mississippi School of Law} ?",
    "uid": 31511,
    "subgraph": "statement_property",
    "template_index": 4798,
    "question": "What was the electron configuration of john grisham when studying at the University of mississippi school of law?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q106465 p:P69 ?s . ?s ps:P69 wd:Q14693404 . ?s pq:P8000 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was John Grisham's electron configuration during his studies at the University of Mississippi School of law?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q106465 p:P69 ?s . ?s ps:P69 wd:Q14693404 . ?s pq:P512 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {place of birth} of {Chet Baker}, that has {time of earliest written record} is {1275-01-01} ?",
    "uid": 30461,
    "subgraph": "right-subgraph",
    "template_index": 2900,
    "question": "In the birth place of Chet Baker, what is the earliest record of 1275-0-0?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2274 wdt:P19 ?answer . ?answer wdt:P1249 ?x FILTER(contains(YEAR(?x),'1275'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "In the start region of Chet Baker, what is the earliest document of 1275-0-0?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q364153 wdt:P19 ?answer . ?answer wdt:P1249 ?x FILTER(contains(YEAR(?x),'1275'))}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Niels Bohr} has {nominated for} as {Pour le Mérite for Sciences and Arts} ?",
    "uid": 31620,
    "subgraph": "statement_property",
    "template_index": 4,
    "question": "When was Niels Bohr nominated for a Pour le Mérite for Sciences and Arts?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q7085 p:P1411 ?s . ?s ps:P1411 wd:Q15056034 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When was Niels Bohr shortlisted for the Pour le Mérite for Sciences and Arts?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q7085 p:P1411 ?s . ?s ps:P1411 wd:Q38104 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {road number} for {Lee de Forest} has {spouse} as {Nora Stanton Blatch Barney} ?",
    "uid": 31509,
    "subgraph": "statement_property",
    "template_index": 4215,
    "question": "When Lee de Forest married Nora Stanton Blatch Barney, which was the road number?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q354863 p:P26 ?s . ?s ps:P26 wd:Q17676 . ?s pq:P1824 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When Lee de Forest married Nora Stanton Blatch Barney, what was the road number?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q354863 p:P26 ?s . ?s ps:P26 wd:Q17676 . ?s pq:P582 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {primary color} for {streak color} of {ruby}",
    "uid": 31891,
    "subgraph": "simple question right",
    "template_index": 2938,
    "question": "What is the main streak color of ruby?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q43088 wdt:P534 ?obj . ?obj wdt:P31 wd:Q166902 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me the principal streak color of ruby.",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q43088 wdt:P462 ?obj . ?obj wdt:P31 wd:Q166902 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {significant event} of {Gina Rinehart} that is {point in time} is {1981-01-01} ?",
    "uid": 31448,
    "subgraph": "statement_property",
    "template_index": 1760,
    "question": "What was the significant event happend to Gina Rinehart in 1981?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q242982 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1981')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What historical event marked Gina Rinehart in 1981?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q242982 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1981')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {fleet} of {service branch} of {Robert D. Russ} ?",
    "uid": 14600,
    "subgraph": "left-subgraph",
    "template_index": 2017,
    "question": "What is The Fleet of the Service Branch of Robert D. Russ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7343340 wdt:P241 ?X . ?X wdt:P121 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7343340> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P241>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P121> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is Robert D. Russ's Service Branch's Fleet?",
    "answers": [
      "C-212 Aviocar",
      "CN-235",
      "McDonnell Douglas F-15 Eagle",
      "F-35 Lightning II",
      "F-22 Raptor",
      "UH-1 Iroquois",
      "RQ-170 Sentinel",
      "Northrop Grumman RQ-4 Global Hawk",
      "T-38 Talon",
      "Boeing B-52 Stratofortress",
      "B-2 Spirit",
      "Lockheed C-5 Galaxy",
      "Lockheed C-130 Hercules",
      "Lockheed U-2",
      "Fairchild Republic A-10 Thunderbolt II",
      "Predator",
      "C-17 Globemaster III",
      "V-22 Osprey",
      "B-1 Lancer",
      "DC-9",
      "E-3 Sentry",
      "Bombardier Global",
      "RQ-11 Raven",
      "Gulfstream V family",
      "E-8 Joint Surveillance Target Attack Radar System",
      "E-4 Advanced Airborne Command Post",
      "Beechcraft C-12 Huron",
      "McDonnell Douglas KC-10 Extender",
      "VC-25",
      "Learjet 35/36",
      "DHC-6 Twin Otter",
      "PC-12",
      "de Havilland Canada DHC-8",
      "T-6 Texan II",
      "MQ-9 Reaper",
      "KC-135 Stratotanker",
      "North American Sabreliner",
      "Gulfstream IV",
      "C-40 Clipper",
      "T-1 Jayhawk",
      "C-27J Spartan",
      "DA40 Diamond Star",
      "Schempp-Hirth Duo Discus",
      "Sikorsky HH-60 Pave Hawk",
      "Gulfstream III",
      "Gulfstream G100",
      "Boeing C-32",
      "C-26 Metroliner",
      "LET TG-10",
      "United States Air Force F-16 fleet"
    ]
  },
  {
    "NNQT_question": "What is {named after} of {Urban II}, that has {inception} is {1664-01-01} ?",
    "uid": 30356,
    "subgraph": "right-subgraph",
    "template_index": 167,
    "question": "What inspired Urban II name, that was created in 1664?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q30578 wdt:P138 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1664'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Tell me what object inspired Urban II name, that was born in 1664?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q6598 wdt:P138 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1664'))}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {start time} for {Oliver Sacks} has {residence} as {New York City} ?",
    "uid": 6355,
    "subgraph": "statement_property",
    "template_index": 2800,
    "question": "When did Oliver Sacks move to New York City?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q258662 p:P551 ?s . ?s ps:P551 wd:Q60 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q258662> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P551> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q60> .\n?statement <http://www.wikidata.org/entity/P580> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Tell me when Oliver Sacks moved to the Big Apple.",
    "answers": [
      "1965-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {marry} of {Cassiopeia}, that has {has son} is {Andromeda} ?",
    "uid": 13361,
    "subgraph": "right-subgraph",
    "template_index": 131,
    "question": "\"Which is {marry} of {Cassiopeia}, who {has son} is {Andromeda} ?\"",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q207681 wdt:P26 ?answer . ?answer wdt:P40 wd:Q161582}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q207681> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P40> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q161582> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "\"Which is {marry} of {Cassiopeia}, who {has son} is {Andromeda} ?\"",
    "answers": [
      "Cepheus, King of Aethiopia"
    ]
  },
  {
    "NNQT_question": "What is {has pet} of {human}",
    "uid": 30805,
    "subgraph": "center",
    "template_index": 1180,
    "question": "What has  pet of human ?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1429 wd:Q5}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1429 wd:Q144}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {international organization} for {parent organization} of {Fouad Chehab}",
    "uid": 31789,
    "subgraph": "simple question right",
    "template_index": 3852,
    "question": "What is the parent organization for the Fouad Chehab?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q449407 wdt:P749 ?obj . ?obj wdt:P31 wd:Q484652 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the parent organization for the Fouad Chehab?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q7801 wdt:P749 ?obj . ?obj wdt:P31 wd:Q484652 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {middle name} of {Frederick I}, that has {close to} is {Frederick} ?",
    "uid": 13183,
    "subgraph": "right-subgraph",
    "template_index": 2527,
    "question": "What is the middle name of {Frederick I whose nick name is Frederick?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q79789 wdt:P735 ?answer . ?answer wdt:P460 wd:Q3273004}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q79789> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P735>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P460> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3273004> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the middle title of {Frederick I whose nick name is Frederick?",
    "answers": [
      "Friedrich",
      "Federico",
      "Frédéric"
    ]
  },
  {
    "NNQT_question": "What is {chairperson} of {short-term exposure limit} of {Vannevar Bush} ?",
    "uid": 30558,
    "subgraph": "right-subgraph",
    "template_index": 3541,
    "question": "What is {chairwoman} of {short-term exposure limit} of {Vannevar Bush} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q299595 wdt:P2407 ?X . ?X wdt:P488 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the name of the chairwoman with a short-term exposure limit of Vannevar Bush?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q299595 wdt:P108 ?X . ?X wdt:P488 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {taxon} with the {MAX(chromosome count)} whose {taxon rank} is {genus}  ?",
    "uid": 3157,
    "subgraph": "rank",
    "template_index": 356,
    "question": "What is the genus with the highest chromosome count in the taxon rank?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P5230 ?obj . ?ent wdt:P105 wd:Q34740 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q16521>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P5230>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P105> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q34740> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Name the genus with the highest chromosome count in taxon rank.",
    "answers": [
      "Passiflora",
      "Passiflora",
      "Passiflora",
      "Passiflora",
      "Passiflora"
    ]
  },
  {
    "NNQT_question": "What is {award received} of {George Washington} that is {point in time} is {2007-01-01} ?",
    "uid": 31361,
    "subgraph": "statement_property",
    "template_index": 3664,
    "question": "What award did George Washington receive in 2007?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q23 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What was George Washington win during 2007",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q215546 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {is child of} of {life partner} of {Ofelia Medina} ?",
    "uid": 14710,
    "subgraph": "left-subgraph",
    "template_index": 119,
    "question": "Who is the child of Ofelia Medina's life partner?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1986025 wdt:P26 ?X . ?X wdt:P22 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1986025> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P22> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is the child of Ofelia Medina's life partner?",
    "answers": [
      "Pedro Armendáriz"
    ]
  },
  {
    "NNQT_question": "What is {shares border with} of {located in the administrative territorial entity} of {Hanoi} ?",
    "uid": 30519,
    "subgraph": "left-subgraph",
    "template_index": 10734,
    "question": "Which church is located in the parish border Hanoi?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1858 wdt:P131 ?X . ?X wdt:P47 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which church is found within the ward border Hanoi?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q32068316 wdt:P131 ?X . ?X wdt:P47 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {by-product of} of {automotive industry}, that has {said to be the same as} is {power-driven vehicle} ?",
    "uid": 30433,
    "subgraph": "right-subgraph",
    "template_index": 2,
    "question": "What is a by-product of the automotive industry that is similar to a power-driven vehicle?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q190117 wdt:P2822 ?answer . ?answer wdt:P460 wd:Q16589333}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name an automotive industry by-product that is similar to a power driven vehicle.",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q190117 wdt:P1056 ?answer . ?answer wdt:P460 wd:Q16589333}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Gwendolyn Brooks} that is {start time} is {1994-01-01} ?",
    "uid": 31396,
    "subgraph": "statement_property",
    "template_index": 3391,
    "question": "What award did Gwendoly Brooks receive from 1994?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q270715 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1994')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Gwendoly Brooks received an award from 1994, what was the award for?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q270715 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1994')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {first described} of {osmium}, that has {born in} is {Selby} ?",
    "uid": 12629,
    "subgraph": "right-subgraph",
    "template_index": 87,
    "question": "Who first described the element osmium and was born in Selby?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q751 wdt:P61 ?answer . ?answer wdt:P19 wd:Q527846}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q751> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P61>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q527846> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Give me the name of the person that first described the element osmium and was born in Selby.",
    "answers": [
      "Smithson Tennant"
    ]
  },
  {
    "NNQT_question": "What is the {Hubli-Dharwad} for {is a list of} of {dance}",
    "uid": 30237,
    "subgraph": "simple question left",
    "template_index": 256,
    "question": "Which Hubli-Dharwad is a list of dances?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P360 wd:Q11639 . ?sbj wdt:P31 wd:Q1707092 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name a Hubli-Dharwad list of dances",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P360 wd:Q11639 . ?sbj wdt:P31 wd:Q13406463 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Glucan} with the {MAX(minimum explosive concentration)} ?",
    "uid": 2560,
    "subgraph": "rank",
    "template_index": 136,
    "question": "Investigation of explosion characteristics of coal dust was undertaken as a part of regular research program at CSIR-CBRI,\nRoorkee, India, for designing explosion safety measures for coal dust handling installations. Potential explosion hazard of\ncoal dust cloud is characterized by maximum explosion pressure, maximum rate of pressure rise and explosibility index.\nStudy aimed at review and analysis of existing data on explosion parameters of coals and creating new sufficient quantitative\nexplosibility data for safe design and operation of plants handling some specific selected coals. Various aspects covered are:",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q416796 . ?ent wdt:P2204 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q416796>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2204>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .}\nORDER BY DESC(?obj)\nLIMIT 5",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "Which aspects of the explosion characteristics of coal dust were investigated by the quantitative explosibility studies at CSIR-CBRI in Roorkee, India, in the process of designing safety measures for coal dust handling?",
    "answers": [
      "starch"
    ]
  },
  {
    "NNQT_question": "Give me {has part} {federal holidays in the United States} that starts with {'t'}",
    "uid": 31257,
    "subgraph": "string matching simple contains word",
    "template_index": 2424,
    "question": "what is that has part in federal holidays in the united states and starts with t",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P527 wd:Q5440534 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "what is that has part in government occasions within the joined together states and begins with t",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5440534 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {spouse} of {Virgil} that is {start time} is {1969-01-01} ?",
    "uid": 31413,
    "subgraph": "statement_property",
    "template_index": 1835,
    "question": "Who did Virgil marry in 1969MacGraw",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1398 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1969')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Name the person whom Virgil married during the year 1969.",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q272438 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1969')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {empire} that {coat of arms} {royal coat of arms of the United Kingdom} and which contains the word {british} in their name",
    "uid": 24949,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3209,
    "question": "Name an empire that contains the word \"british\" in its name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q48349 . ?sbj wdt:P237 wd:Q165762 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'british')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q48349>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P237> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q165762>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'british')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Title an realm that contains the word \"british\" in its name",
    "answers": [
      "British Empire"
    ]
  },
  {
    "NNQT_question": "What is {order number} of {position held} of {Eduardo López-Dóriga} ?",
    "uid": 30549,
    "subgraph": "left-subgraph",
    "template_index": 547,
    "question": "WHAT IS THE ORDER NUMBER OF THE POLITICAL OFFICE HELD IN EDUARDO LOPEZ DORIGA",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q55547556 wdt:P39 ?X . ?X wdt:P8470 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "WHAT IS ORDER NUMBER OF POLITICAL OFFICE HELD IN EDUARDO LOPEZ DORIGA",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q55547556 wdt:P39 ?X . ?X wdt:P2389 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {name in original language} of {competitor} of {War of the Triple Alliance} ?",
    "uid": 17611,
    "subgraph": "right-subgraph",
    "template_index": 1131,
    "question": "What is competitor War of the Triple Alliance's name in its original language?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q58947 wdt:P710 ?X . ?X wdt:P1705 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q58947> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P710>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1705> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is competitor War of the Triple Alliance's title in its unique language?",
    "answers": [
      "República del Paraguay",
      "Tetã Paraguái"
    ]
  }
]