[
  {
    "NNQT_question": "What is {is has sons of} of {Isaac}, that has {has sons} is {Shuah} ?",
    "uid": 12162,
    "subgraph": "right-subgraph",
    "template_index": 1134,
    "question": "Which son of Isaac has a son named Shuah?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q671872 wdt:P22 ?answer . ?answer wdt:P40 wd:Q369850}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q671872> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P22>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P40> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q369850> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which Isaac son has a Shuah son?",
    "answers": [
      "Abraham"
    ]
  },
  {
    "NNQT_question": "what is the {point in time} for {Pablo Neruda} has {award received} as {National Prize for Literature} ?",
    "uid": 6211,
    "subgraph": "statement_property",
    "template_index": 2656,
    "question": "When was Pablo Neruda awarded the National Prize for Literature?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q34189 p:P166 ?s . ?s ps:P166 wd:Q860699 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q34189> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q860699> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "At which point in time did Pablo Neruda get awarded the National Prize for Literature?",
    "answers": [
      "1945-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {nominated for} of {Maiduguri} that is {point in time} is {2011-01-01} ?",
    "uid": 31290,
    "subgraph": "statement_property",
    "template_index": 5383,
    "question": "What was Maiduguri nominated for in 2011?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q221436 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What 2011 nomination did Maiduguri receive?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q187019 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {sibling} of {George W. Bush}, that has {occupation} is {marketer} ?",
    "uid": 30407,
    "subgraph": "right-subgraph",
    "template_index": 8150,
    "question": "Who is George W. Bush's sister that has crafted as marketer?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q207 wdt:P3373 ?answer . ?answer wdt:P106 wd:Q1900657}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is George W. Bush's sister that has crafted as marketer?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q207 wdt:P3373 ?answer . ?answer wdt:P106 wd:Q131524}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {is daughter of} of {has sons} of {Aglaé Auguié} ?",
    "uid": 15842,
    "subgraph": "left-subgraph",
    "template_index": 93,
    "question": "Who has the daughter and son of Aglaé Auguié ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2826888 wdt:P40 ?X . ?X wdt:P22 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2826888> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P40>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P22> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who has the daughter and son of Aglaé Auguié ?",
    "answers": [
      "Michel Ney",
      "Michel Ney",
      "Michel Ney",
      "Michel Ney"
    ]
  },
  {
    "NNQT_question": "What is {location} and {height} of {10 metre running target} has {record held} as {Eliza McCartney}",
    "uid": 32081,
    "subgraph": [],
    "template_index": 237,
    "question": "What is the location and height of the 10 metre running target recorded by Eliza McCartney?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q841817 p:P1000 ?s . ?s ps:P1000 wd:Q18011042 . ?s pq:P276 ?value1 . ?s pq:P2048 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the location and height of Eliza Mccartney's 10 metre running target?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 wd:Q18011042 . ?s pq:P276 ?value1 . ?s pq:P2048 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {religious concept} that {facet of} {Hinduism} and which contains the word {yatra} in their name",
    "uid": 25210,
    "subgraph": "string matching type + relation contains word",
    "template_index": 635,
    "question": "Name a religious concept in Hinduism that contains the word \"yatra\" in its name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23847174 . ?sbj wdt:P1269 wd:Q9089 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yatra')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q23847174>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1269> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q9089>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yatra')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Name a non secular thought in Hinduism that carries the phrase \"yatra\" in its title",
    "answers": [
      "Yatra"
    ]
  },
  {
    "NNQT_question": "What is {alma mater} of {Elgin Baylor}, that has {position} is {-122.319} ?",
    "uid": 14204,
    "subgraph": "right-subgraph",
    "template_index": 3183,
    "question": "What is the alma mater of Elgin Baylor whose position is -122.319?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q357458 wdt:P69 ?answer . ?answer wdt:P625 ?x FILTER(contains(?x,'-122.319'))}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q357458> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P69>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P625> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <-122.319> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the alma mater of Elgin Baylor whose position is -122.319?",
    "answers": [
      "Seattle University"
    ]
  },
  {
    "NNQT_question": "What is {child} of {projection designer} of {Francesco I Sforza} ?",
    "uid": 30546,
    "subgraph": "right-subgraph",
    "template_index": 810,
    "question": "WHO IS THE projection designer OF SON FRANCESCO I SFORZA ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q310536 wdt:P5881 ?X . ?X wdt:P40 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "WHO IS THE projection designer OF Child FRANCESCO I SFORZA ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q310536 wdt:P25 ?X . ?X wdt:P40 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {end cause} and the {position played on team / speciality} of {Babe Ruth} ?",
    "uid": 31987,
    "subgraph": "two intentions right subgraph",
    "template_index": 475,
    "question": "What is the {end cause} and the {position played on team / speciality} by {Babe_Ruth} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q213812 wdt:P1534 ?ans_1 . wd:Q213812 wdt:P413 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What is the {cause of ending} and the {position played on group / strength} by {Babe_Ruth} ?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q213812 wdt:P1196 ?ans_1 . wd:Q213812 wdt:P413 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {coordinate location} of {Rhine} that is {applies to part} is {Boise} ?",
    "uid": 31274,
    "subgraph": "statement_property",
    "template_index": 1136,
    "question": "Where is the Boise of the Rhine?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q584 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q35775 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Where does the Boise Rhine originate from?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q584 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {educated at} of {Venus Williams} and {field of work}",
    "uid": 32035,
    "subgraph": [],
    "template_index": 524,
    "question": "When did educated at of Venus Williams and field of work?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q11578 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P101 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "When was Venus Williams educated and field of work?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q11578 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {prize money} and {point in time} of {Vladimir Lenin} has {award received} as {TED Prize}",
    "uid": 32065,
    "subgraph": [],
    "template_index": 841,
    "question": "When did Vladimir Lenin receive the TED Prize, and how much was he awarded as recipient?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q1394 p:P166 ?s . ?s ps:P166 wd:Q23014208 . ?s pq:P2121 ?value1 . ?s pq:P585 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When did Vladimir Lenin get the TED prize and how much did he get?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q834621 p:P166 ?s . ?s ps:P166 wd:Q23014208 . ?s pq:P2121 ?value1 . ?s pq:P585 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {noble title} of {Charles the Bald} and {model year}",
    "uid": 32005,
    "subgraph": [],
    "template_index": 1407,
    "question": "Charles the Bald position is what and what is his model year?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q71231 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P5444 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Charles the Bald function is what and qhat is his model year?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q71231 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P156 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {sovereign state} with the {MAX(total reserves)} whose {diplomatic relation} is {Israel} ?",
    "uid": 31121,
    "subgraph": "rank",
    "template_index": 118,
    "question": "What country related to Israel has the highest total reserves?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q3624078 . ?ent wdt:P2134 ?obj . ?ent wdt:P530 wd:Q801 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "What country associated to Israel has the highest total reserves?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q3624078 . ?ent wdt:P1689 ?obj . ?ent wdt:P530 wd:Q801 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {database} for {has cause} of {Congress of Vienna}",
    "uid": 30284,
    "subgraph": "simple question left",
    "template_index": 121,
    "question": "Which is the database that caused the Congress of Vienna?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P828 wd:Q46362 . ?sbj wdt:P31 wd:Q8513 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which database made the Congress of Vienna?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P828 wd:Q46362 . ?sbj wdt:P31 wd:Q16887380 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {language official} of {basin countries} of {White Sea} ?",
    "uid": 17765,
    "subgraph": "right-subgraph",
    "template_index": 135,
    "question": "Which is {official language} of {basin countries} of {White Sea} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q44133 wdt:P205 ?X . ?X wdt:P37 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q44133> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P205>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P37> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is {official language} of {basin countries} of {White Sea} ?",
    "answers": [
      "Russian"
    ]
  },
  {
    "NNQT_question": "What is {sex or gender} of {Cecilia Bartoli}, that has {image} is {жін} ?",
    "uid": 30490,
    "subgraph": "right-subgraph",
    "template_index": 1783,
    "question": "What is the gender of Cecilia Bartoli, which has the image of 'жін'?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q18828 wdt:P21 ?answer . ?answer wdt:P18 ?x FILTER(contains(?x,'жін'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is Cecilia Bartoli's gender, which has the image of 'жін'",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q18828 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'жін'))}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {significant event} of {Jean Gabin} that is {point in time} is {1976-11-17} ?",
    "uid": 3688,
    "subgraph": "statement_property",
    "template_index": 133,
    "question": "What was the significant event that happened to Jean Gabin in 1976?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q23842 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1976')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q23842> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P793> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1976-11-17>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1976, what significant event did Jean Gabin experience?",
    "answers": [
      "funeral"
    ]
  },
  {
    "NNQT_question": "What is {official language} of {basin country} of {Alboran Sea} ?",
    "uid": 30602,
    "subgraph": "right-subgraph",
    "template_index": 135,
    "question": "Which is {official language} of {basin countries} of {Alboran Sea} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q199408 wdt:P205 ?X . ?X wdt:P37 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is {official language} of {basin countries} of {Alboran Sea} ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q44133 wdt:P205 ?X . ?X wdt:P37 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {comedic genre} that starts with {'s'}",
    "uid": 24647,
    "subgraph": "string matching simple contains word",
    "template_index": 3367,
    "question": "What are the comedic genre which start with the letter s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5151404 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q5151404>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the comedic class which begin with the letter s",
    "answers": [
      "sitcom",
      "stand-up comedy",
      "sketch comedy",
      "surreal humour"
    ]
  },
  {
    "NNQT_question": "What is {religious name} of {major depressive disorders} that is {determination method} is {TAS} ?",
    "uid": 31314,
    "subgraph": "statement_property",
    "template_index": 4892,
    "question": "What is the religious name of major depressive disorder with the determination method TAS?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q42844 p:P1635 ?s . ?s ps:P1635 ?obj . ?s pq:P459 wd:Q23190853 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "With the determination method TAS, what is the major depressive disorder religious name?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q42844 p:P2293 ?s . ?s ps:P2293 ?obj . ?s pq:P459 wd:Q23190853 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {eponym} of {volt}, that has {profession} is {professor} ?",
    "uid": 13413,
    "subgraph": "right-subgraph",
    "template_index": 176,
    "question": "Name the eponym of volt, who is professor by profession.",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q25250 wdt:P138 ?answer . ?answer wdt:P106 wd:Q121594}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q25250> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P138>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q121594> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name the eponym of volt, who is professor by way of profession.",
    "answers": [
      "Alessandro Volta"
    ]
  },
  {
    "NNQT_question": "What is {followed by} of {has effect} of {quantum phase transition} ?",
    "uid": 30609,
    "subgraph": "right-subgraph",
    "template_index": 45,
    "question": "TELL ME THE PRECEEDS THAT IMPLIES QUANTUM PHASE TRANSITION?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2118253 wdt:P1542 ?X . ?X wdt:P156 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "TELL ME THE PRECEEDS OF THE QUANTUM PHASE TRANSITION IMPLIES?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q6452502 wdt:P1542 ?X . ?X wdt:P156 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {designed by} and the {influenced by} of {JavaScript} ?",
    "uid": 10059,
    "subgraph": "two intentions right subgraph",
    "template_index": 172,
    "question": "What is designed and influenced by JavaScript?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q2005 wdt:P287 ?ans_1 . wd:Q2005 wdt:P737 ?ans_2 }",
    "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2005> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P287> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2005> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P737> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What does JavaScript design and influence?",
    "answers": [
      "Brendan Eich",
      "Java",
      "Brendan Eich",
      "C",
      "Brendan Eich",
      "Perl",
      "Brendan Eich",
      "HyperTalk",
      "Brendan Eich",
      "Scheme",
      "Brendan Eich",
      "Lua",
      "Brendan Eich",
      "AWK",
      "Brendan Eich",
      "Self",
      "Brendan Eich",
      "LiveScript"
    ]
  },
  {
    "NNQT_question": "How many {head of government} are for {German Democratic Republic} ?",
    "uid": 1065,
    "subgraph": "statement_property",
    "template_index": 65,
    "question": "How many people are head of the government for {German Democratic Republic} ?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q16957 wdt:P6 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q16957> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P6> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "For the German Democratic Republic, how many people are head of the government?",
    "answers": [
      "5"
    ]
  },
  {
    "NNQT_question": "What is {head of government} of {Vaduz} that is {start time} is {2007-1-0} ?",
    "uid": 6290,
    "subgraph": "statement_property",
    "template_index": 2735,
    "question": "Who became the head of the government of Vaduz on 2017-1-0?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1844 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2007')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1844> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P6> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <2007-1-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Name the person who took over as  the head of the government of Vaduz on 2017-1-0.",
    "answers": [
      "Ewald Ospelt"
    ]
  },
  {
    "NNQT_question": "What is {drag coefficient} of {Rocky Mountain National Park}",
    "uid": 30881,
    "subgraph": "center",
    "template_index": 726,
    "question": "What is the drag coefficient for the Rocky Mountain National Park?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q777183 wdt:P6497 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q777183 wdt:P3516 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {view} of {Stanislav Cherchesov}",
    "uid": 30868,
    "subgraph": "center",
    "template_index": 3314,
    "question": "Which is the view of Stanislav Cherchesov?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q699557 wdt:P8517 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q699557 wdt:P1469 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {winner} of {award received} of {Kōmei} ?",
    "uid": 30504,
    "subgraph": "left-subgraph",
    "template_index": 189,
    "question": "Who is {champ} of {prize awarded} {Kōmei} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q299179 wdt:P166 ?X . ?X wdt:P1346 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is {champ} of {prize granted} {Kōmei} ?TARD ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q229271 wdt:P166 ?X . ?X wdt:P1346 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {taxon} with the {MAX(basic reproduction number)} whose {found in taxon} is {Hammer-headed bat} ?",
    "uid": 31125,
    "subgraph": "rank",
    "template_index": 243,
    "question": "What species can reproduce extremely quickly whose family is Hammer-headed bat?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P3492 ?obj . ?ent wdt:P703 wd:Q304912 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "What Hammer-headed bats can reproduce very quickly?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P3492 ?obj . ?ent wdt:P703 wd:Q15978631 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {CAF Champions League} with the {MAX(file format)} ?",
    "uid": 31085,
    "subgraph": "rank",
    "template_index": 157,
    "question": "Which CAF Champions League has the highest file format?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q219261 . ?ent wdt:P2701 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "Which CAF Champions Alliance has the most noteworthy file format?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q219261 . ?ent wdt:P1351 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {date of burial or cremation} of {Barack Obama}",
    "uid": 30912,
    "subgraph": "center",
    "template_index": 2745,
    "question": "Which is the date of burial or cremation of Barack Obama?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q76 wdt:P4602 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q51525 wdt:P4602 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]