[
  {
    "NNQT_question": "What is {award received} of {Virgil} that is {point in time} is {2011-01-01} ?",
    "uid": 31431,
    "subgraph": "statement_property",
    "template_index": 1788,
    "question": "What award did Virgil receive in 2011?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1398 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 2011, what award was given Virgil?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q44068 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {cause of destruction} of {conflict} of {Vasily Blyukher} ?",
    "uid": 30663,
    "subgraph": "right-subgraph",
    "template_index": 3527,
    "question": "In which conflict was Vasily Blyukher cause of destruction ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q48129 wdt:P607 ?X . ?X wdt:P770 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which war was Vasily Blyukher cause of destruction?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q48129 wdt:P607 ?X . ?X wdt:P828 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {capital} of {five-a-side football}, that has {twinned administrative body} is {Feodosia} ?",
    "uid": 30354,
    "subgraph": "right-subgraph",
    "template_index": 2775,
    "question": "What is the capital of five-a-side football, whose twin cities include Feodosia?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2250158 wdt:P36 ?answer . ?answer wdt:P190 wd:Q158491}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name the five-a-side football capital that has Feodosia as twin city",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q188785 wdt:P36 ?answer . ?answer wdt:P190 wd:Q158491}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {focal length} of {Antonio Vivaldi}",
    "uid": 30864,
    "subgraph": "center",
    "template_index": 3434,
    "question": "What is Anthony Vivaldi's focal length?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1340 wdt:P2151 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q1340 wdt:P2000 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {pronunciation audio} of {main topic} of {structure of the Earth} ?",
    "uid": 15613,
    "subgraph": "right-subgraph",
    "template_index": 242,
    "question": "How do you pronounce the Earth's structure?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1664027 wdt:P1269 ?X . ?X wdt:P443 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1664027> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1269>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P443> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "How would you articulate the Earth's structure?",
    "answers": [
      "Ar-%D8%A7%D9%84%D8%A3%D8%B1%D8%B6.ogg",
      "De-Erde.ogg",
      "En-Earth.ogg",
      "Fr-terre-ca-Montr%C3%A9al.ogg",
      "It-Terra.oga",
      "LL-Q188%20%28deu%29-Sebastian%20Wallroth-Erde.wav",
      "Ru-%D0%B7%D0%B5%D0%BC%D0%BB%D1%8F.ogg",
      "Ms-MY-Bumi.ogg",
      "LL-Q58635%20%28pan%29-Gaurav%20Jhammat-%E0%A8%A7%E0%A8%B0%E0%A8%A4%E0%A9%80.wav"
    ]
  },
  {
    "NNQT_question": "Give me {lacrosse} that contains the word {vertisol} in their name",
    "uid": 31146,
    "subgraph": "string matching simple contains word",
    "template_index": 464,
    "question": "Tell me lacrosse whose name has the word vertisol in it.",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q185851 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vertisol')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Disclose to me lacrosse whose name has the word vertisol in it.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10926413 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'vertisol')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {logo image} and the {physically interacts with} of {dopamine} ?",
    "uid": 31972,
    "subgraph": "two intentions right subgraph",
    "template_index": 382,
    "question": "What {logo image} which {physically interacts with} of {Dopamine} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q170304 wdt:P154 ?ans_1 . wd:Q170304 wdt:P129 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "Which logo image physically interacts with Dopamine?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q170304 wdt:P2868 ?ans_1 . wd:Q170304 wdt:P129 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {teaching method} of {Chile}",
    "uid": 30871,
    "subgraph": "center",
    "template_index": 2882,
    "question": "Whats the teaching method of Chile?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q298 wdt:P2392 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q298 wdt:P5019 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {population} of {page banner} of {Mbuji-Mayi} ?",
    "uid": 30665,
    "subgraph": "right-subgraph",
    "template_index": 858,
    "question": "who inhabitants} of page banner of mbuji-mayi ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q319660 wdt:P948 ?X . ?X wdt:P1082 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which are the inhabitants of page banner of mbuji-mayi?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q319660 wdt:P17 ?X . ?X wdt:P1082 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {population} of {Iwai Prefecture} that is {point in time} is {2005-01-01} ?",
    "uid": 31428,
    "subgraph": "statement_property",
    "template_index": 3855,
    "question": "What was the population of the Iwai Prefecture in the year 2005?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q11587852 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2005')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Tell me the population of the Iwai Prefecture in 2005.",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q128186 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2005')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {chemical compound} with the {MAX(explosive velocity)} whose {quotes work} is {explosive material} ?",
    "uid": 31105,
    "subgraph": "rank",
    "template_index": 359,
    "question": "What explosive chemical has the highest explosive velocity and explosive material as quotes work?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2231 ?obj . ?ent wdt:P6166 wd:Q12870 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Which chemical that's explosive has the highest explosive velocity and explosive material as quotes work?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2231 ?obj . ?ent wdt:P2868 wd:Q12870 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Japanese TV series} with the {MAX(number of seasons)} whose {original language of work} is {Japanese}  ?",
    "uid": 2971,
    "subgraph": "rank",
    "template_index": 170,
    "question": "What Japanese TV series has the most number of seasons and was originally aired in Japanese?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q21191019 . ?ent wdt:P2437 ?obj . ?ent wdt:P364 wd:Q5287 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q21191019>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2437>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P364> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q5287> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Of all Japanese TV series originally aired in Japanese, which has the most seasons?",
    "answers": [
      "Aibō",
      "Wataru Seken wa Oni Bakari",
      "Kunoichi",
      "Sanbiki ga Kiru!",
      "Majisuka Gakuen"
    ]
  },
  {
    "NNQT_question": "What is the {direction} and the {sex or gender} of {Ricky Martin} ?",
    "uid": 31988,
    "subgraph": "two intentions right subgraph",
    "template_index": 19,
    "question": "What is the {direction} and the {sex or gender} of {Ricky_Martin} ?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q128799 wdt:P560 ?ans_1 . wd:Q128799 wdt:P21 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What are Ricky Martin's direction and sex?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q128799 wdt:P91 ?ans_1 . wd:Q128799 wdt:P21 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {instrument} of {lyrics by} of {Redondo Beach} ?",
    "uid": 30688,
    "subgraph": "left-subgraph",
    "template_index": 4183,
    "question": "Name the musical instrument used in song Redondo Beach song",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3931538 wdt:P676 ?X . ?X wdt:P1303 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Title the melodic instrument utilized in tune Confront to the Sky song",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q14951082 wdt:P676 ?X . ?X wdt:P1303 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {federation} for {replaces} of {Soviet Union}",
    "uid": 30347,
    "subgraph": "simple question left",
    "template_index": 851,
    "question": "What federation replaced the Soviet Union?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1365 wd:Q15180 . ?sbj wdt:P31 wd:Q43702 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Mention the federal state that replaced the Soviet Union",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P530 wd:Q15180 . ?sbj wdt:P31 wd:Q43702 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {IATA airline designator} of {Cream}, that has {date of official opening} is {1983-01-01} ?",
    "uid": 30391,
    "subgraph": "right-subgraph",
    "template_index": 667,
    "question": "What was the {IATA airline designator} of {Cream}, that was {introduced} in {1983-0-0}?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q203736 wdt:P229 ?answer . ?answer wdt:P1619 ?x FILTER(contains(YEAR(?x),'1983'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What was the {IATA airline designator} by {Cream}, that was {presented} in {1983-0-0}?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q203736 wdt:P166 ?answer . ?answer wdt:P1619 ?x FILTER(contains(YEAR(?x),'1983'))}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {service entry} for {Alexander Graham Bell} has {spouse} as {Mabel Gardiner Hubbard} ?",
    "uid": 31584,
    "subgraph": "statement_property",
    "template_index": 3465,
    "question": "What was Alexander Graham Bell service entry after the wedding with Mabel Gardiner Hubbard?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q34286 p:P26 ?s . ?s ps:P26 wd:Q6721445 . ?s pq:P729 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was Alexander Graham Bell service entry after the marriage with Mabel Gardiner Hubbard?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q34286 p:P26 ?s . ?s ps:P26 wd:Q6721445 . ?s pq:P582 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Harmonized System Code} {particle radiation} that contains the word {cosmic} in their name",
    "uid": 31212,
    "subgraph": "string matching simple contains word",
    "template_index": 3617,
    "question": "What are the objects using radiation particles as Harmonized System Code that contain the word cosmic in their names ?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P5471 wd:Q945733 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cosmic')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the elements using radiation particles Harmonized System Code in their names that contain the word cosmic",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q945733 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cosmic')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {interaction} of {antiparticle}, that has {charted in} is {521.1} ?",
    "uid": 30380,
    "subgraph": "right-subgraph",
    "template_index": 66,
    "question": "What is the interaction of antiparticle with charted in 521.1?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q182717 wdt:P517 ?answer . ?answer wdt:P2291 ?x FILTER(contains(?x,'521.1'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the antiparticle interaction with charted in 521.1?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q182717 wdt:P517 ?answer . ?answer wdt:P1036 ?x FILTER(contains(?x,'521.1'))}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Romário} has {award received} as {World Cup Golden Ball} ?",
    "uid": 31645,
    "subgraph": "statement_property",
    "template_index": 3523,
    "question": "From when did Romario receive the World Cup Golden Ball?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q178649 p:P166 ?s . ?s ps:P166 wd:Q17355204 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "From when was the World Cup Golden Ball given to Romario?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q178649 p:P166 ?s . ?s ps:P166 wd:Q17355204 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {product or material produced} of {developer} of {eMate 300} ?",
    "uid": 30710,
    "subgraph": "left-subgraph",
    "template_index": 2154,
    "question": "What are the results of the eMate 300 developers?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q300948 wdt:P178 ?X . ?X wdt:P1056 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What are the comes about of the eMate 300 developers?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q20670531 wdt:P178 ?X . ?X wdt:P1056 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {elected in} for {John Dalberg-Acton, 1st Baron Acton} has {occupation} as {Member of the 19th Parliament of the United Kingdom} ?",
    "uid": 31654,
    "subgraph": "statement_property",
    "template_index": 3642,
    "question": "When was John Dalberg-Acton, 1st Baron Acton, elected for the occupation of Member of the 19th Parliament of the United Kingdom?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q311778 p:P106 ?s . ?s ps:P106 wd:Q41582559 . ?s pq:P2715 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "In what year did John Dalberg-Acton, 1st Baron Acton, elected for the occupation of Member of the 19th Parliament of the UK?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q311778 p:P39 ?s . ?s ps:P39 wd:Q41582559 . ?s pq:P2715 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {retrieved} for {Auckland} has {head of government} as {Len Brown} ?",
    "uid": 31655,
    "subgraph": "statement_property",
    "template_index": 1058,
    "question": "When was Len Brown retrieved as the mayor of Auckland?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q37100 p:P6 ?s . ?s ps:P6 wd:Q4116955 . ?s pq:P813 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was the year that Len Brown was retrieved as mayor of Auckland?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q37100 p:P6 ?s . ?s ps:P6 wd:Q4116955 . ?s pq:P582 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Shreveport} with the {MAX(lower flammable limit)} ?",
    "uid": 31072,
    "subgraph": "rank",
    "template_index": 197,
    "question": "Which Shreveport has the least lower flammable limit?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q80517 . ?ent wdt:P2202 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "What Shreveport has the least lower flammable limit in Class IB?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q21009055 . ?ent wdt:P2202 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {occupation} are to/by {President of Slovenia} ?",
    "uid": 31739,
    "subgraph": "statement_property",
    "template_index": 1098,
    "question": "How many occupants are there with {President of Slovenia} ?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P106 wd:Q495877 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "President of Slovenia contains how many occupants?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P106 wd:Q184299 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {monastery} for {headquarters location} of {Russian Orthodox Church}",
    "uid": 21021,
    "subgraph": "simple question right",
    "template_index": 1367,
    "question": "Mention the headquarter location of the Russian Orthodox Church monastery.",
    "sparql_wikidata": " select distinct ?obj where { wd:Q60995 wdt:P159 ?obj . ?obj wdt:P31 wd:Q44613 } ",
    "sparql_dbpedia18": "select distinct ?obj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q60995> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P159> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj . ?obj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q44613> } ",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Say the headquarter area of the Russian Standard Church monastery.",
    "answers": [
      "Danilov Monastery"
    ]
  },
  {
    "NNQT_question": "What is {position held} of {Lee Miller}",
    "uid": 31057,
    "subgraph": "center",
    "template_index": 2242,
    "question": "What is the position held by Lee Miller ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q265131 wdt:P39 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q265131 wdt:P4439 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {start time} for {Riga} has {country} as {Latvia} ?",
    "uid": 7539,
    "subgraph": "statement_property",
    "template_index": 3984,
    "question": "When did Riga become the capital of Latvia?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q1773 p:P17 ?s . ?s ps:P17 wd:Q211 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1773> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P17> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q211> .\n?statement <http://www.wikidata.org/entity/P580> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "November 18, 1918",
    "answers": [
      "1918-11-18T00:00:00Z",
      "1990-05-04T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is the {linguistic typology} and the {ISO 639-6 code} of {Spanish} ?",
    "uid": 31968,
    "subgraph": "two intentions right subgraph",
    "template_index": 82,
    "question": "What are the linguistic typology and ISO 639-6 code of Spanish language?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q1321 wdt:P4132 ?ans_1 . wd:Q1321 wdt:P221 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "The Spanish language has what linguistic typology and ISO 639-6 code?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q1321 wdt:P4132 ?ans_1 . wd:Q1321 wdt:P5109 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {discontinued date} of {Sega Mega Drive}",
    "uid": 31002,
    "subgraph": "center",
    "template_index": 1064,
    "question": "Which is the discontinued date of Sega Mega Drive?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q10676 wdt:P2669 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q10683 wdt:P2669 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {chief executive officer} of {interested in} of {Christopher Wylie} ?",
    "uid": 30748,
    "subgraph": "left-subgraph",
    "template_index": 10,
    "question": "Who is the chief executive officer at Christopher Wylie's company?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q50845422 wdt:P2650 ?X . ?X wdt:P169 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is the chief executive officer at Christopher Wylie's company?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q50845422 wdt:P108 ?X . ?X wdt:P169 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {paper-and-pencil game} that {practiced by} {backgammon player} and which contains the word {backgammon} in their name",
    "uid": 31916,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2153,
    "question": "What paper-and-pencil game is played by backgammon players and contains the word backgammon?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2347716 . ?sbj wdt:P3095 wd:Q23929009 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'backgammon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What paper-and-pencil amusement is played by backgammon players and contains the word backgammon?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131436 . ?sbj wdt:P3095 wd:Q23929009 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'backgammon')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of sports team} of {Valeriy Lobanovskyi} and {series ordinal}",
    "uid": 32041,
    "subgraph": [],
    "template_index": 1049,
    "question": "Which sports team was Valeriy Lobanovsky a member of and what is its series ordinal?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q324484 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1545 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Which sports group was Valeriy Lobanovsky a part of and what is its position in the corresponding Wikidata list?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q324484 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {business} for {Vox-ATypI classification} of {Facebook}",
    "uid": 30251,
    "subgraph": "simple question left",
    "template_index": 2020,
    "question": "What business does Facebook classificate with Vox-ATypI?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1878 wd:Q355 . ?sbj wdt:P31 wd:Q4830453 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What trade does Facebook classificate with Vox-ATypI?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1056 wd:Q355 . ?sbj wdt:P31 wd:Q4830453 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Madhvacharya} has {award received} as {St. Louis Literary Award} ?",
    "uid": 31475,
    "subgraph": "statement_property",
    "template_index": 4189,
    "question": "When did Madhvacharya receive the St. Louis Literary Award?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q335371 p:P166 ?s . ?s ps:P166 wd:Q7589655 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was the date that The St. Louis Literary Award was aquired by Madhvacharya.",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q1371154 p:P166 ?s . ?s ps:P166 wd:Q7589655 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  }
]