[
  {
    "NNQT_question": "What is {input method} of {part of the series} of {geomorphologist} ?",
    "uid": 30506,
    "subgraph": "left-subgraph",
    "template_index": 7098,
    "question": "Who organizes the order of geomorphologist?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q38053159 wdt:P179 ?X . ?X wdt:P479 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who organizes the arrange of geomorphologist?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q2240236 wdt:P179 ?X . ?X wdt:P479 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {continent} of {season} of {Mount Caywood} ?",
    "uid": 30551,
    "subgraph": "left-subgraph",
    "template_index": 16090,
    "question": "Where is the season of the continent of the mountain belt in Mount Caywood?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q6920087 wdt:P4908 ?X . ?X wdt:P30 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "In the continent of the mountain belt in Mount Caywood, what is the season?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q6920087 wdt:P4552 ?X . ?X wdt:P30 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {admin HQ} of {alma mater} of {Victor Hugo} ?",
    "uid": 16730,
    "subgraph": "right-subgraph",
    "template_index": 5993,
    "question": "What is the admin HQ of Alma Matter and Victor Hugo?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q535 wdt:P69 ?X . ?X wdt:P159 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q535> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P69>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P159> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the admin HQ of Alma Matter and Victor Hugo?",
    "answers": [
      "Paris"
    ]
  },
  {
    "NNQT_question": "What is {Wikidata SPARQL query equivalent} of {Leo X}",
    "uid": 30884,
    "subgraph": "center",
    "template_index": 915,
    "question": "What is Wikidata SPARQL query equivalent for Leo X ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q49237 wdt:P3921 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q49237 wdt:P5492 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {central processing unit} with the {MAX(medical examinations)} ?",
    "uid": 31076,
    "subgraph": "rank",
    "template_index": 154,
    "question": "What is the CPU with the greatest medical examinations?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q5300 . ?ent wdt:P923 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "Which CPU has the highest medical examinations?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q5300 . ?ent wdt:P2229 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {spouse} of {Fabrizio Donato} that is {start time} is {1957-06-16} ?",
    "uid": 31348,
    "subgraph": "statement_property",
    "template_index": 1389,
    "question": "Who was married to Fabrizio Donato in June of 1957?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1753 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1957')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Whom did Fabrizio Donato marry in June of 1957?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q234583 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1957')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {sibling} of {Nefertiti}, that has {father} is {Nefertiti} ?",
    "uid": 30465,
    "subgraph": "right-subgraph",
    "template_index": 819,
    "question": "Who is the sibling of Nefertiti and has Nefertiti as father?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q40930 wdt:P3373 ?answer . ?answer wdt:P22 wd:Q40930}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is Nefertiti sibling and has Nefertiti as father?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q40930 wdt:P3373 ?answer . ?answer wdt:P22 wd:Q146029}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {political alignment} of {Master of Business Administration}",
    "uid": 30782,
    "subgraph": "center",
    "template_index": 680,
    "question": "Which is the political alignment of Master of Business Administration?",
    "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1387 wd:Q191701}",
    "sparql_dbpedia18": "",
    "template": "?D RDE E",
    "answer": [],
    "template_id": "1.2",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { ?answer wdt:P5460 wd:Q191701}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nominated for} of {Clifton Chenier} that is {point in time} is {1983-0-0} ?",
    "uid": 7855,
    "subgraph": "statement_property",
    "template_index": 4300,
    "question": "What did Clifton Chenier get nominated for in 1983-0-0?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1101377 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1983')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1101377> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1983-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1983, what nomination did Clifton Chenier receive?",
    "answers": [
      "Grammy Award for Best Ethnic or Traditional Folk Recording"
    ]
  },
  {
    "NNQT_question": "What is the {business} with the {MIN(total debt)} whose {Corporate Number} is {Euronext} ?",
    "uid": 31118,
    "subgraph": "rank",
    "template_index": 584,
    "question": "What is the business with the least debt and Euronext as Corporate Number?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q4830453 . ?ent wdt:P2133 ?obj . ?ent wdt:P6859 wd:Q842108} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Considering Euronext Corporate Numbers, which business has the least debt?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q4830453 . ?ent wdt:P2133 ?obj . ?ent wdt:P414 wd:Q842108} ORDER BY ASC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {firelighting} for {material used} of {leaf}",
    "uid": 30320,
    "subgraph": "simple question left",
    "template_index": 2140,
    "question": "What is the leaf material firelightined for?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P186 wd:Q33971 . ?sbj wdt:P31 wd:Q1192478 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the leaf fabric firelightined for?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P186 wd:Q33971 . ?sbj wdt:P31 wd:Q1724915 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Robert De Niro} has {residence} as {whip} ?",
    "uid": 31474,
    "subgraph": "statement_property",
    "template_index": 3264,
    "question": "When did Robert De Niro reside in whip?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q36949 p:P551 ?s . ?s ps:P551 wd:Q1433693 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When did Robert De Nirolive in whip?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q36949 p:P551 ?s . ?s ps:P551 wd:Q3708911 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {followed by} and {season ends} of {Guy of Lusignan} has {noble title} as {King of Jerusalem}",
    "uid": 32055,
    "subgraph": [],
    "template_index": 539,
    "question": "Who is {followed by} and {season ends} of {{Guy of Lusignan} has {noble title} as {King of Jerusalem}}",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q294192 p:P97 ?s . ?s ps:P97 wd:Q693614 . ?s pq:P156 ?value1 . ?s pq:P6118 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who followed Guy of Lusignan as King of Jerusalem and when does his season end?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q294192 p:P97 ?s . ?s ps:P97 wd:Q693614 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {notable work} of {Lucius Quinctius Cincinnatus} and {publisher}",
    "uid": 31993,
    "subgraph": [],
    "template_index": 580,
    "question": "Tell me the most notable work of Lucius Quinctius Cincinnatus and also the publisher.",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q309637 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P123 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Tell me the most high-quality work of Lucius Quinctius Cincinnatus and additionally the publisher.",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q49081 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P123 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {type of quantum particle} with the {MAX(orbital period)} whose {antiparticle} is {antineutron} ?",
    "uid": 31117,
    "subgraph": "rank",
    "template_index": 176,
    "question": "Which antiparticle of the antineutron has the longest orbital period ?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q22675015 . ?ent wdt:P2146 ?obj . ?ent wdt:P2152 wd:Q156530 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Which antineutron antiparticle has the longest orbital period?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q22675015 . ?ent wdt:P2645 ?obj . ?ent wdt:P2152 wd:Q156530 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {used metre} of {José de la Riva Agüero}",
    "uid": 30845,
    "subgraph": "center",
    "template_index": 934,
    "question": "Which is a used metre of José de la Riva Agüero?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q2392284 wdt:P2551 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q8275 wdt:P2551 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {human} for {doctoral student} of {Juan Luis Sanfuentes}",
    "uid": 30270,
    "subgraph": "simple question left",
    "template_index": 1384,
    "question": "Who is the PhD candidate for Juan Luis Sanfuentes?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P185 wd:Q857 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who is the PhD candidate for Juan Luis Sanfuentes?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P185 wd:Q7085 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of sports team} of {Mike Hawthorn} that is {end time} is {1992-01-01} ?",
    "uid": 31350,
    "subgraph": "statement_property",
    "template_index": 2038,
    "question": "What sports team did Mike Hawthorn stopped being a member of in 1992?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q2104 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1992')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Mike Hawthorn was a member of which sports team during 1992?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q558189 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1992')) }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {HTML4 named color} for {color} of {fire opal}",
    "uid": 31870,
    "subgraph": "simple question right",
    "template_index": 2021,
    "question": "What is the color called HTML4 for fire opal color?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q65276832 wdt:P462 ?obj . ?obj wdt:P31 wd:Q56053097 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the color called HTML4 for fire opal color?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q43088 wdt:P462 ?obj . ?obj wdt:P31 wd:Q56053097 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nominated for} of {George Washington} that is {statement is subject of} is {19th Tony Awards} ?",
    "uid": 31430,
    "subgraph": "statement_property",
    "template_index": 3046,
    "question": "What was George Washington was nominated for on the 19th Tony Awards?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q23 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q4595828 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "On the 19th Tony Awards what did George Washington snag a nomination for?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q219420 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q4595828 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {position held} and the {country of citizenship} of {Tim Allen} ?",
    "uid": 31982,
    "subgraph": "two intentions right subgraph",
    "template_index": 349,
    "question": "What is the position held by Tim Allen and what is his country of citizenship?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q208408 wdt:P39 ?ans_1 . wd:Q208408 wdt:P27 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "What is Tim Allen's position and what's his country of citizenship?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q208408 wdt:P102 ?ans_1 . wd:Q208408 wdt:P27 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {heat deflection temperature} and {follows} of {Lothair I} has {noble title} as {monarch of Italy}",
    "uid": 32077,
    "subgraph": [],
    "template_index": 1225,
    "question": "Who got the noble title of monarch of Italy before Lothair I and what was his heat deflection temperature.",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q150735 p:P97 ?s . ?s ps:P97 wd:Q271148 . ?s pq:P5682 ?value1 . ?s pq:P155 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who got the respectable title of ruler of Italy some time recently Lothair I and what was his heat deflection temperature.",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q150735 p:P97 ?s . ?s ps:P97 wd:Q271148 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {conflict} of {depicts} of {Aqaba} ?",
    "uid": 30516,
    "subgraph": "right-subgraph",
    "template_index": 546,
    "question": "What conflict is depicted is Aqaba?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q180522 wdt:P180 ?X . ?X wdt:P607 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which conflict is depicted by Aqaba?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q117693 wdt:P180 ?X . ?X wdt:P607 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {patronym or matronym for this name} and the {named after} of {New York Yankees} ?",
    "uid": 31950,
    "subgraph": "two intentions right subgraph",
    "template_index": 476,
    "question": "What patronym or matronym is the New York Yankees named after?",
    "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q213417 wdt:P2976 ?ans_1 . wd:Q213417 wdt:P138 ?ans_2 }",
    "sparql_dbpedia18": "",
    "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
    "answer": [],
    "template_id": "1",
    "paraphrased_question": "The New York Yankees were named for which patronym or matronym?",
    "old_sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q213417 wdt:P286 ?ans_1 . wd:Q213417 wdt:P138 ?ans_2 }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Zadie Smith} that is {point in time} is {2006-1-1} ?",
    "uid": 8815,
    "subgraph": "statement_property",
    "template_index": 5260,
    "question": "What award did Zadie Smith receive in 2006?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q140052 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2006')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q140052> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2006-1-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Name the award received by Zadie Smith in 2006.",
    "answers": [
      "Women's Prize for Fiction",
      "Anisfield-Wolf Book Awards",
      "Somerset Maugham Award",
      "Bollinger Everyman Wodehouse Prize"
    ]
  },
  {
    "NNQT_question": "What is {position held} of {David Cameron} and {file format}",
    "uid": 32022,
    "subgraph": [],
    "template_index": 569,
    "question": "What were position and file format of David Cameron?",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q192 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2701 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What were David Cameron's position and file format?",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q192 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {national cuisine} that starts with {'m'}",
    "uid": 24108,
    "subgraph": "string matching simple contains word",
    "template_index": 3322,
    "question": "What are the national cuisine which start with the letter m",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1968435 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1968435>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the national cuisine that starts with the letter m.",
    "answers": [
      "Mauritian cuisine",
      "Mauritania cuisine",
      "Malagasy cuisine",
      "Malian cuisine",
      "Manchu cuisine",
      "Malawian cuisine",
      "Monégasque cuisine",
      "Maldivian cuisine",
      "Moravian cuisine",
      "Marshallese cuisine",
      "Montenegrin cuisine",
      "Malaysian cuisine",
      "Moroccan cuisine",
      "Mexican cuisine",
      "Mongolian cuisine",
      "Moldovan cuisine",
      "Macedonian cuisine",
      "Maltese cuisine"
    ]
  },
  {
    "NNQT_question": "What is the {enterprise} for {business division} of {Ford Motor Company}",
    "uid": 20570,
    "subgraph": "simple question right",
    "template_index": 916,
    "question": "Name a business division owned by Ford Motor Company",
    "sparql_wikidata": " select distinct ?obj where { wd:Q44294 wdt:P199 ?obj . ?obj wdt:P31 wd:Q6881511 } ",
    "sparql_dbpedia18": "select distinct ?obj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q44294> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P199> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj . ?obj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q6881511> } ",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Title a trade division claimed by Portage Engine Company",
    "answers": [
      "Jiangling Motors",
      "Otosan"
    ]
  },
  {
    "NNQT_question": "Give me {group of organisms known by one particular common name} that {means of locomotion} {snake locomotion} and which contains the word {snake} in their name",
    "uid": 25162,
    "subgraph": "string matching type + relation contains word",
    "template_index": 407,
    "question": "WHICH IS THE GROUP OF ORGANISMS KNOWN BY ONE PARATICULAR COMMON NAME THAT IS LOCOMOTION AND SNAKE LOCOMOTION THAT CONTAINS THE WORD SNAKE IN THEIR NAME",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55983715 . ?sbj wdt:P3512 wd:Q29378923 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'snake')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q55983715>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3512> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q29378923>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'snake')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "WHICH IS THE Gather OF Life forms KNOWN BY ONE PARATICULAR COMMON Title That's Movement AND Wind Movement THAT CONTAINS THE WORD Wind IN THEIR NAME",
    "answers": [
      "snake"
    ]
  },
  {
    "NNQT_question": "What is {axle track} of {near side of the Moon}, that has {orbital eccentricity} is {0.0567} ?",
    "uid": 30375,
    "subgraph": "right-subgraph",
    "template_index": 19,
    "question": "What has the eccentricity of 0.0567, that is axle track of the near side of the moon?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q782867 wdt:P8597 ?answer . ?answer wdt:P1096 ?x FILTER(contains(?x,'0.0567'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What has the eccentricity of 0.0567, that is placed on the axle track of the near aspect of the moon?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q782867 wdt:P376 ?answer . ?answer wdt:P1096 ?x FILTER(contains(?x,'0.0567'))}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {presenter} of {Meet the Press with Chuck Todd} that is {point in time} is {1984-09-16} ?",
    "uid": 31459,
    "subgraph": "statement_property",
    "template_index": 3494,
    "question": "Who was the presenter for Meet the Press starting on September 16, 1984?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1543066 p:P371 ?s . ?s ps:P371 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1984')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Who served as the moderator for Meet the Press on September 16, 1984?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q1543066 p:P371 ?s . ?s ps:P371 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1984')) }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {archives} for {tala} of {The Walt Disney Company}",
    "uid": 31804,
    "subgraph": "simple question right",
    "template_index": 289,
    "question": "Where is the archive for tala of The Walt Disney company?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q7414 wdt:P8535 ?obj . ?obj wdt:P31 wd:Q166118 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the archives that constitutes a tala of The Walt Disney Company?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q7414 wdt:P485 ?obj . ?obj wdt:P31 wd:Q166118 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {Multan} that starts with {'z'}",
    "uid": 31142,
    "subgraph": "string matching simple contains word",
    "template_index": 566,
    "question": "Tell me every Multan whose name starts with the letter z",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q185453 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me each and every Multan whose identify begins with the letter z",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1160573 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {terminus} are to/by {Vologda} ?",
    "uid": 31720,
    "subgraph": "statement_property",
    "template_index": 1039,
    "question": "How many terminus are in Vologda",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P559 wd:Q1957 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "how many Vologda in terminus",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P559 wd:Q1741 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {kinship to subject} for {Carl Philipp Emanuel Bach} has {sibling} as {Christian Gottlib Bach} ?",
    "uid": 31631,
    "subgraph": "statement_property",
    "template_index": 3110,
    "question": "What type of relationship did the siblings Carl Philipp Emanuel Bach and Christian Gottlib Bach have?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q76428 p:P3373 ?s . ?s ps:P3373 wd:Q21042316 . ?s pq:P1039 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Describe the sibling relationship of Carl Phillip Emannuel Bach and Christian Gottlib Bach?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q76428 p:P3373 ?s . ?s ps:P3373 wd:Q107277 . ?s pq:P1039 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]