[
  {
    "NNQT_question": "What is {owner} of {theatre company} of {The Birth of the Star Spangled Banner} ?",
    "uid": 17849,
    "subgraph": "left-subgraph",
    "template_index": 8678,
    "question": "Who is the owner of the theatre company that made 'The Birth of the Star Spangled Banner'?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q21184208 wdt:P272 ?X . ?X wdt:P127 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q21184208> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P272>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P127> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who is the proprietor of the theatre corporation that made 'The Birth of the Star Spangled Banner'?",
    "answers": [
      "Thomas Alva Edison"
    ]
  },
  {
    "NNQT_question": "What is {postal code} of {notable work} of {Georges Bizet} ?",
    "uid": 30741,
    "subgraph": "right-subgraph",
    "template_index": 684,
    "question": "What is the zip code of notable work of Georges Bizet?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q56158 wdt:P800 ?X . ?X wdt:P281 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the zip code of Georges Bizet's notable work?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q56158 wdt:P119 ?X . ?X wdt:P281 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {World Heritage criteria} of {Shen Bao}, that has {twinned administrative body} is {Rotterdam} ?",
    "uid": 30388,
    "subgraph": "right-subgraph",
    "template_index": 169,
    "question": "What is the World Heritage criteria of Shen Bao that has Rotterdam as twin city?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q919710 wdt:P2614 ?answer . ?answer wdt:P190 wd:Q34370}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the Shen Bao World Heritage criteria that has Rotterdam as companion metropolis?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q919710 wdt:P291 ?answer . ?answer wdt:P190 wd:Q34370}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {spouse} of {Ida Lupino} that is {McCune-Reischauer romanization} is {1951-01-01} ?",
    "uid": 31303,
    "subgraph": "statement_property",
    "template_index": 5292,
    "question": "Who was married to Ida Lupino that was McCune-Reischauer romanized on January 1st, 1951?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q148669 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P1942 ?x filter(contains(YEAR(?x),'1951')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Who married Ida Lupino that was McCune-Reischauer romanized on January 1, 1951?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q148669 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1951')) }",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {online dictionary} that {author} {John Simpson} and which contains the word {dictionary} in their name",
    "uid": 25211,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1996,
    "question": "Name an online dictionary written by John Simpson that contains the word \"dictionnary\" in its name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3327521 . ?sbj wdt:P50 wd:Q6257950 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'dictionary')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3327521>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P50> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q6257950>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'dictionary')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Name an on line dictionary written by way of John Simpson that includes the phrase \"dictionnary\" in its name",
    "answers": [
      "The Oxford English Dictionary"
    ]
  },
  {
    "NNQT_question": "What is {field of work} of {father} of {Viktor Bespalov} ?",
    "uid": 30556,
    "subgraph": "left-subgraph",
    "template_index": 43,
    "question": "What is the field of work of father of Viktor Bespalov?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q28792298 wdt:P22 ?X . ?X wdt:P101 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "What is the area of work of Viktor Bespalov's father?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q28792298 wdt:P108 ?X . ?X wdt:P101 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Tilastopaja male athlete ID} of {Thomas Aquinas}",
    "uid": 31039,
    "subgraph": "center",
    "template_index": 1329,
    "question": "What is Tilastopaja male athlete ID for Santo Tomás de Aquinas?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q9438 wdt:P3884 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q9438 wdt:P1463 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {spacecraft} for {manufacturer} of {Nordic Blading}",
    "uid": 30242,
    "subgraph": "simple question left",
    "template_index": 3867,
    "question": "Which is the spacecraft that is manufactured by nordic blading?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P176 wd:Q1998122 . ?sbj wdt:P31 wd:Q40218 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is the spacecraft that's made by nordic blading?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P176 wd:Q193701 . ?sbj wdt:P31 wd:Q40218 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {sibling} of {Pedro Aguirre Cerda}, that has {date of death} is {1101-07-27} ?",
    "uid": 30406,
    "subgraph": "right-subgraph",
    "template_index": 1680,
    "question": "\"Who was the sister of Pedro Aguirre Cerda, the Holy Roman Emperor during his death in the year of 1101-7-27\"?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q845 wdt:P3373 ?answer . ?answer wdt:P570 ?x FILTER(contains(YEAR(?x),'1101'))}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "\"Who was the sister of Pedro Aguirre Cerda, the Heavenly Roman Head amid his passing within the year of 1101-7-27\"?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q151707 wdt:P3373 ?answer . ?answer wdt:P570 ?x FILTER(contains(YEAR(?x),'1101'))}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {base} are to/by {face} ?",
    "uid": 31762,
    "subgraph": "statement_property",
    "template_index": 1405,
    "question": "How many bases does a face have?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3263 wd:Q3064117 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Bases in a face?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P3263 wd:Q36810 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {mathematical formula} of {shape} of {cooling tower} ?",
    "uid": 17528,
    "subgraph": "right-subgraph",
    "template_index": 0,
    "question": "Which is the mathematical formula of the shape of the cooling tower?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q193886 wdt:P1419 ?X . ?X wdt:P2534 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q193886> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1419>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2534> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which is the mathematical method of the shape of the cooling tower?",
    "answers": [
      "math>"
    ]
  },
  {
    "NNQT_question": "How many {capital of} are for {Metropolis of Lyon} ?",
    "uid": 31709,
    "subgraph": "statement_property",
    "template_index": 629,
    "question": "What's the capital of Metropolis of Lyon?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q16665897 wdt:P1376 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "Referring to Metropolis of Lyon, what is the capital?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q90 wdt:P1376 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {twinned administrative body} of {blood type} of {Hafsa bint Umar} ?",
    "uid": 30660,
    "subgraph": "right-subgraph",
    "template_index": 1052,
    "question": "What is the Sister City of the blood type of Hafsa bint Umar?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q263791 wdt:P1853 ?X . ?X wdt:P190 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the Sister City of Hafsa bint Umar's blood type?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q263791 wdt:P20 ?X . ?X wdt:P190 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {faith} of {has influence} of {Madonna} ?",
    "uid": 17135,
    "subgraph": "left-subgraph",
    "template_index": 7,
    "question": "Where {faith} {has influence} on {Madonna} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1744 wdt:P737 ?X . ?X wdt:P140 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1744> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P737>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P140> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Where {confidence} {has impact} on {Madonna} ?",
    "answers": [
      "Vaishnavism"
    ]
  },
  {
    "NNQT_question": "What is {twinned administrative body} of {place of birth} of {Zawiya} ?",
    "uid": 30501,
    "subgraph": "left-subgraph",
    "template_index": 29905,
    "question": "What sister city was born in of Zawiya, Libya?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q221503 wdt:P19 ?X . ?X wdt:P190 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which sister city in Zawiya, Libya was born?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q4338004 wdt:P19 ?X . ?X wdt:P190 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {start time} for {Ankara} has {named after} as {Eva Perón} ?",
    "uid": 31617,
    "subgraph": "statement_property",
    "template_index": 5339,
    "question": "When does Ankara?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q3640 p:P138 ?s . ?s ps:P138 wd:Q40933 . ?s pq:P580 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Ankara is when?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q44059 p:P138 ?s . ?s ps:P138 wd:Q40933 . ?s pq:P580 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {document} for {main regulatory text} of {Zengid dynasty}",
    "uid": 31830,
    "subgraph": "simple question right",
    "template_index": 3117,
    "question": "Which document is the main regulatory text of the Zengid dynasty?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q189545 wdt:P92 ?obj . ?obj wdt:P31 wd:Q49848 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Which report is the most administrative content of the Zengid dynasty?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q15180 wdt:P92 ?obj . ?obj wdt:P31 wd:Q49848 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {influenced by} of {Cornelia Schlosser}, that has {relative} is {Peter im Baumgarten} ?",
    "uid": 30460,
    "subgraph": "right-subgraph",
    "template_index": 4063,
    "question": "Who is informed by Cornelia Schlosser, that has a father-in-law named Peter Im Baumgarten?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q95740 wdt:P737 ?answer . ?answer wdt:P1038 wd:Q2079256}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is informed about a father - in - law named Peter Im Baumgarten by Cornelia Schlosser?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q22670 wdt:P737 ?answer . ?answer wdt:P1038 wd:Q2079256}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {first name} of {John Foster Dulles}, that has {alphabet} is {Latin script} ?",
    "uid": 12108,
    "subgraph": "right-subgraph",
    "template_index": 2532,
    "question": "\"What is name of John Foster Dulles Latin script that has alphabet?\"",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q223677 wdt:P735 ?answer . ?answer wdt:P282 wd:Q8229}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q223677> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P735>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P282> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q8229> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "\"What is identify of John Foster Dulles Latin script that has alphabet?\"",
    "answers": [
      "John",
      "Foster"
    ]
  },
  {
    "NNQT_question": "Give me {subclass of} {food ingredient} that contains the word {zucchini} in their name",
    "uid": 31251,
    "subgraph": "string matching simple contains word",
    "template_index": 3842,
    "question": "What are the subclass of food ingredient which start with the letter zucchini",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P279 wd:Q25403900 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zucchini')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name the subclass of food ingredient that starts with the letter zicchini",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25403900 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zucchini')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {date of birth} of {circle of} of {Teodoro Obiang} ?",
    "uid": 30653,
    "subgraph": "right-subgraph",
    "template_index": 458,
    "question": "On what day were the circle of Teodoro Obiang Nguema Mbasogo born?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q57385 wdt:P1776 ?X . ?X wdt:P569 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When are the birth dates of the circle of Teoforo Obiang Nguema Mbasogo?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q57385 wdt:P40 ?X . ?X wdt:P569 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {member of sports team} of {Henry VI, Holy Roman Emperor} that is {end time} is {1980-01-01} ?",
    "uid": 31271,
    "subgraph": "statement_property",
    "template_index": 4344,
    "question": "What was the last team Henry VI, Holy Roman Emperor belonged to in the year 1980?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q150953 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1980')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1980 name the last team Henry VI, Holy Roman Emperor played for?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q1392194 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'1980')) }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Alkyonides} for {killed by} of {Heracles}",
    "uid": 30311,
    "subgraph": "simple question left",
    "template_index": 910,
    "question": "What are the Alkyonides killed by Heracles?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P157 wd:Q122248 . ?sbj wdt:P31 wd:Q2350201 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are the Alkyonides murdered by Heracles?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P157 wd:Q122248 . ?sbj wdt:P31 wd:Q191192 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {prequel of} of {location of narrative} of {Candide} ?",
    "uid": 15935,
    "subgraph": "right-subgraph",
    "template_index": 3521,
    "question": "Who gave the {prequel of} of {location of narrative} of {Candide} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q215894 wdt:P840 ?X . ?X wdt:P156 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q215894> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P840>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P156> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who gave the prequel of location of narrative of Candide ?",
    "answers": [
      "Hamburg",
      "Kingdom of Prussia",
      "Austrian Empire",
      "Kingdom of Saxony",
      "Confederation of the Rhine",
      "Waldeck",
      "Saxe-Weimar",
      "Electorate of Hesse",
      "Principality of Reuss-Greiz",
      "Saxe-Gotha-Altenburg",
      "Swedish Pomerania",
      "Duchy of Oldenburg",
      "Duchy of Holstein",
      "Principality of Nassau-Orange-Fulda",
      "Duchy of Mecklenburg-Schwerin",
      "Kingdom of France",
      "Republic of Saint-Malo",
      "Protectorate of Peru"
    ]
  },
  {
    "NNQT_question": "What is the {ski mountaineering} for {history of topic} of {Korea}",
    "uid": 31776,
    "subgraph": "simple question right",
    "template_index": 175,
    "question": "Could you summarize Korea's ski mountaineering of this topic?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q18097 wdt:P2184 ?obj . ?obj wdt:P31 wd:Q1075998 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "In this topic, give a summary of Korea's ski mountaineering",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q18097 wdt:P2184 ?obj . ?obj wdt:P31 wd:Q17544377 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {cast member} of {The Big Lebowski} that is {number of reviews/ratings} is {Bunny Lebowski} ?",
    "uid": 31385,
    "subgraph": "statement_property",
    "template_index": 3507,
    "question": "Who is the cast member with a number of ratings of Bunny Lebowski in the Big Lebowski?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q337078 p:P161 ?s . ?s ps:P161 ?obj . ?s pq:P7887 wd:Q55717001 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Who played in The Big Lebowski with a number of ratings of Bunny Lebowski?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q337078 p:P161 ?s . ?s ps:P161 ?obj . ?s pq:P453 wd:Q55717001 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {day in year for periodic occurrence} of {Rosh Hashanah}, that has {day in year for periodic occurrence} is {Tishrei} ?",
    "uid": 30439,
    "subgraph": "right-subgraph",
    "template_index": 14,
    "question": "What takes place on Rosh Hashanah in the day of Tishrei?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q131028 wdt:P837 ?answer . ?answer wdt:P837 wd:Q217782}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What takes put on Rosh Hashanah within the day of Tishrei?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q131028 wdt:P837 ?answer . ?answer wdt:P2922 wd:Q217782}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {educated at} of {François Villon} that is {start time} is {1912-01-01} ?",
    "uid": 31411,
    "subgraph": "statement_property",
    "template_index": 127,
    "question": "Which school did François Villon attend starting January 1, 1912?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q849 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1912')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Which school did François Villon go to beginning January 1, 1912?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q5816 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1912')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {instance of} of {opposite of} of {virtue} ?",
    "uid": 30743,
    "subgraph": "right-subgraph",
    "template_index": 12,
    "question": "What is instance of  the antonym  of virtue ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q157811 wdt:P461 ?X . ?X wdt:P31 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is instance of the antonym of ideals ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q157811 wdt:P461 ?X . ?X wdt:P1036 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {end cause} and {elected in} of {Chiang Kai-shek} has {postal code} as {President of the Republic of China}",
    "uid": 32072,
    "subgraph": [],
    "template_index": 1420,
    "question": "When was Chiang Kai-Shek elected and what was his major cause when he had a postal code of President of the Republic of China?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q16574 p:P281 ?s . ?s ps:P281 wd:Q887003 . ?s pq:P1534 ?value1 . ?s pq:P2715 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When was Chiang Kai-Shek chosen and what was his major cause when he had a postal code of President of the Republic of China?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q16574 p:P39 ?s . ?s ps:P39 wd:Q887003 . ?s pq:P1534 ?value1 . ?s pq:P2715 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {end time} for {Anders Behring Breivik} has {member of} as {Propaganda Due} ?",
    "uid": 31552,
    "subgraph": "statement_property",
    "template_index": 5569,
    "question": "Until when Anders Behring Breivik was member of Propaganda Due?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q44220 p:P463 ?s . ?s ps:P463 wd:Q954078 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Anders Behring Breivik was member of Propaganda Due until when?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q44220 p:P463 ?s . ?s ps:P463 wd:Q2319455 . ?s pq:P582 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {instrument played} of {plays} of {foil} ?",
    "uid": 17880,
    "subgraph": "right-subgraph",
    "template_index": 35,
    "question": "What kind of instrument is made with foil?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q471447 wdt:P641 ?X . ?X wdt:P2283 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q471447> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P641>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2283> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What kind of tool is made of foil?",
    "answers": [
      "foil",
      "épée",
      "sabre"
    ]
  },
  {
    "NNQT_question": "What is {nominated for} of {Kiefer Sutherland} that is {operator} is {2002-01-01} ?",
    "uid": 31393,
    "subgraph": "statement_property",
    "template_index": 1141,
    "question": "Which award was Kiefer Sutherland nominated for in 2002 operator?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q103946 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P137 ?x filter(contains(YEAR(?x),'2002')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What award, in 2002 operator, was Kiefer Sutherland nominated for?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q103946 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2002')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {e-GEDSH ID} of {Coptic}",
    "uid": 30978,
    "subgraph": "center",
    "template_index": 2094,
    "question": "Which is the e-GEDSH ID of Coptic?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q36155 wdt:P9027 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q36155 wdt:P2355 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  }
]