[
  {
    "NNQT_question": "What is <International Olympic Committee athlete ID> of <Mary Lou Retton> ?",
    "uid": 26800,
    "subgraph": "center",
    "template_index": 1097,
    "question": "What's Mary Lou Retton's International Olympic Committee athlete ID.",
    "sparql_wikidata": "select distinct ?answer where { wd:Q235975 wdt:P3171 ?answer}",
    "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q235975> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3171> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "answers": [
      "mary-lou-retton"
    ]
  },
  {
    "NNQT_question": "What is {has immediate cause} of {Phil Taylor}",
    "uid": 30880,
    "subgraph": "center",
    "template_index": 3832,
    "question": "Which is the immediate cause of Phil Taylor?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q550313 wdt:P1478 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q550313 wdt:P3621 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nominated for} of {George Washington} that is {statement is subject of} is {67th Academy Awards} ?",
    "uid": 31408,
    "subgraph": "statement_property",
    "template_index": 2634,
    "question": "What award was George Washington nominated for at the 67th Academy Awards?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q23 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q857001 }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "George Washington was nominated in which category at the 67th Academy Awards?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q217573 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q857001 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {inventory number} and {point in time} of {Christopher A. Sims} has {award received} as {Prize in Economic Sciences in Memory of Alfred Nobel}",
    "uid": 32090,
    "subgraph": [],
    "template_index": 836,
    "question": "When did Christopher A. Sims win their prize in Economic Sciences Nobel Peace Prize and with what inventory number?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q109737 p:P166 ?s . ?s ps:P166 wd:Q47170 . ?s pq:P217 ?value1 . ?s pq:P585 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When and with what inventory number did Christopher A. Sims win their prize in Financial Sciences Nobel Peace Prize?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q109737 p:P166 ?s . ?s ps:P166 wd:Q47170 . ?s pq:P1706 ?value1 . ?s pq:P585 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {nominated for} of {D. T. Suzuki} that is {point in time} is {1963-1-1} ?",
    "uid": 4788,
    "subgraph": "statement_property",
    "template_index": 1233,
    "question": "For what reason D.T. suzuku was in nomination in the year 1963?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q44847 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1963')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q44847> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1963-1-1>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "Why was D.T. Suzuku nominated in 1963?",
    "answers": [
      "Nobel Peace Prize"
    ]
  },
  {
    "NNQT_question": "What is {GreatSchools ID} of {Google}",
    "uid": 30957,
    "subgraph": "center",
    "template_index": 1389,
    "question": "Which is the GreatSchools ID for Google?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q95 wdt:P7948 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q95 wdt:P3193 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {located in time zone} of {place of death} of {Partie Bonnard} ?",
    "uid": 30518,
    "subgraph": "right-subgraph",
    "template_index": 254,
    "question": "What is the timezone of the place Partie Bonnard died?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2533793 wdt:P20 ?X . ?X wdt:P421 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What is the timezone of the put Partie Bonnard died?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q7170 wdt:P20 ?X . ?X wdt:P421 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Willem Frederik Hermans} has {licensed to broadcast to} as {Essayprijs van de gemeente Amsterdam} ?",
    "uid": 31528,
    "subgraph": "statement_property",
    "template_index": 4646,
    "question": "When had Willem Frederik Hermans been licensed to broadcast to Essayprijs van de gemeente Amsterdam?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q437771 p:P1408 ?s . ?s ps:P1408 wd:Q2705788 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When had Willem Frederik Hermans been licensed to broadcast to Essayprijs van de gemeente Amsterdam",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q437771 p:P166 ?s . ?s ps:P166 wd:Q2705788 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {start time} and {end time} of {Pedro Aguirre Cerda} has {educated at} as {New York University}",
    "uid": 32085,
    "subgraph": [],
    "template_index": 1414,
    "question": "When did Pedro Aguirre Cerda begin attending New York University and when did she graduate?",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q845 p:P69 ?s . ?s ps:P69 wd:Q49210 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "When did Pedro Aguirre Cerda start going to Unused York College and when did she graduate?",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q36301 p:P69 ?s . ?s ps:P69 wd:Q49210 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {biography at the Bundestag of Germany URL} of {Juan Antonio Rios}",
    "uid": 30921,
    "subgraph": "center",
    "template_index": 783,
    "question": "What is the biography in Juan Antonio Rios's German Bundestag?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q820 wdt:P1713 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q2530 wdt:P1713 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {cause of death} that {medical examinations} {Nanchong} and which that starts with {'p'}",
    "uid": 31901,
    "subgraph": "string matching type + relation contains word",
    "template_index": 453,
    "question": "What is a cause of death that begins with the letter \"p\" and can be found in Nanchong?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1931388 . ?sbj wdt:P923 wd:Q426996 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "What is a purpose of dying that begins with the letter \"p\" and can be located in Nanchong?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1931388 . ?sbj wdt:P923 wd:Q32566 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {instance of} of {0} that is {follows} is {−2} ?",
    "uid": 8846,
    "subgraph": "statement_property",
    "template_index": 5291,
    "question": "What number follows -2?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q204 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P155 wd:Q3827340 }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q204> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P155> <http://wikidata.dbpedia.org/resource/Q3827340>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "-2 is followed by which number?",
    "answers": [
      "even number"
    ]
  },
  {
    "NNQT_question": "Give me {highly urbanized city} that {language used} {Mansakan languages} and which that starts with {'v'}",
    "uid": 31918,
    "subgraph": "string matching type + relation contains word",
    "template_index": 503,
    "question": "what is highly urbanized city using Mansakan languages and also starting with letter v",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29946056 . ?sbj wdt:P2936 wd:Q6751550 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 4,
    "paraphrased_question": "what is particularly urbanized metropolis using Mansakan languages and also which starts offevolved with letter v",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29946056 . ?sbj wdt:P2936 wd:Q34057 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'v')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {named after} of {volt}, that has {mass} is {professor} ?",
    "uid": 30423,
    "subgraph": "right-subgraph",
    "template_index": 176,
    "question": "Name the eponym of volt, who is professor by mass.",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q25250 wdt:P138 ?answer . ?answer wdt:P2067 wd:Q121594}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Name the eponym of volt, who is professor by way of mass.",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q25250 wdt:P138 ?answer . ?answer wdt:P106 wd:Q121594}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {presidential régime} for {indigenous to} of {American English}",
    "uid": 31869,
    "subgraph": "simple question right",
    "template_index": 575,
    "question": "What is the name of the presidential régime, previously occupied by indigenous people, which now the majority of its population speaks American English?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q7976 wdt:P2341 ?obj . ?obj wdt:P31 wd:Q49892 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Indigenous people used to occupy a presidential régime which now speaks mostly American English, what is its name?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q7976 wdt:P2341 ?obj . ?obj wdt:P31 wd:Q5255892 } ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {full work available at URL} are for {Wanfried agreement} ?",
    "uid": 31704,
    "subgraph": "statement_property",
    "template_index": 541,
    "question": "How much full-time work is available at the Wanfried agreement?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q1441 wdt:P953 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What amount of full time work is open at the Wanfried agreement?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q877399 wdt:P953 ?obj }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {point in time} for {Le Corbusier} has {award received} as {Henry III of England} ?",
    "uid": 31489,
    "subgraph": "statement_property",
    "template_index": 439,
    "question": "What year did Le Corbusier win the Henry III of England?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q4724 p:P166 ?s . ?s ps:P166 wd:Q160311 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "What was the year when Le Corbusier had received the Henry III of England?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q4724 p:P166 ?s . ?s ps:P166 wd:Q19873358 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {birth name} of {George Washington}",
    "uid": 30933,
    "subgraph": "center",
    "template_index": 2324,
    "question": "What is birth name of George Washington ?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q23 wdt:P1477 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q49819 wdt:P1477 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Guadalupe Victoria} with the {MAX(number of houses)} whose {instance of} is {Guadalupe Victoria} ?",
    "uid": 31100,
    "subgraph": "rank",
    "template_index": 91,
    "question": "What is the Guadalupe Victoria with the MAX(number of houses whose instance of is Guadalupe Victoria?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q311425 . ?ent wdt:P4080 ?obj . ?ent wdt:P31 wd:Q311425 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "What Guadalupe Victoria has the MAX number of houses whose instance is Guadalupe Victoria?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q21851888 . ?ent wdt:P4080 ?obj . ?ent wdt:P31 wd:Q21851888 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {periodical} for {house publication} of {Narmer}",
    "uid": 31774,
    "subgraph": "simple question right",
    "template_index": 65,
    "question": "What periodical literature does Narmer use as a moutpiece?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q189582 wdt:P2813 ?obj . ?obj wdt:P31 wd:Q1002697 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is Narmer's periodical literature mouthpiece?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q188920 wdt:P2813 ?obj . ?obj wdt:P31 wd:Q1002697 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {color} are to/by {brown} ?",
    "uid": 1757,
    "subgraph": "statement_property",
    "template_index": 1101,
    "question": "How many colors are next to brown",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P462 wd:Q47071 }",
    "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P462> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q47071 .\n} \n",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Which is the number of colors that are next to brown?",
    "answers": [
      "356"
    ]
  },
  {
    "NNQT_question": "What is the {position} with the {MIN(term length of office)} whose {subclass of} is {head of state}  ?",
    "uid": 3386,
    "subgraph": "rank",
    "template_index": 608,
    "question": "Which head of state has the shortest term length of office?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q4164871 . ?ent wdt:P2097 ?obj . ?ent wdt:P279 wd:Q48352} ORDER BY ASC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q4164871>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2097>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P279> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q48352> .\n\n}\nORDER BY ASC(?obj1)\nLIMIT 5",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "The shortest term for head of state is?",
    "answers": [
      "Governor of Vermont",
      "Governor of New Hampshire",
      "President of Moldova",
      "Governor of Maryland",
      "Governor of Virginia"
    ]
  },
  {
    "NNQT_question": "What is {subclass of} of {Zhuang people}, that has {location of formation} is {Bodh Gaya} ?",
    "uid": 30483,
    "subgraph": "right-subgraph",
    "template_index": 130,
    "question": "Who is the {subclass} of {Zhuang people} who has {formed in} {Bodh Gaya} ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q36692 wdt:P279 ?answer . ?answer wdt:P740 wd:Q176767}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the {subclass} of {Zhuang people} who has {formed in} {Bodh Gaya} ?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q36692 wdt:P140 ?answer . ?answer wdt:P740 wd:Q176767}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {nominee} for {July 14} has {nominated for} as {Academy Award for Best Original Dramatic or Comedy Score} ?",
    "uid": 31550,
    "subgraph": "statement_property",
    "template_index": 2067,
    "question": "Who was nominated for the Academy Award for Best Original Dramatic or Comedy Score for the film July 14?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q24585 p:P1411 ?s . ?s ps:P1411 wd:Q22752868 . ?s pq:P2453 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When the movie July 14 was nominated for the Academy Award for Best Original Dramatic or Comedy Score, who was the nominee?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q132689 p:P1411 ?s . ?s ps:P1411 wd:Q22752868 . ?s pq:P2453 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {binary star} with the {MAX(color index)} ?",
    "uid": 31093,
    "subgraph": "rank",
    "template_index": 50,
    "question": "what is that has a binary star as variable star and has the highest color index?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P881 wd:Q50053 . ?ent wdt:P1458 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
    "answer": [],
    "template_id": "Rank1",
    "paraphrased_question": "The highest color index belongs to what element with a binary star as variable star?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q50053 . ?ent wdt:P1458 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {business} for {employer} of {Kenema}",
    "uid": 31785,
    "subgraph": "simple question right",
    "template_index": 3105,
    "question": "What business does Kenema have?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q634698 wdt:P108 ?obj . ?obj wdt:P31 wd:Q4830453 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What's the name of Kenema's business?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q207939 wdt:P108 ?obj . ?obj wdt:P31 wd:Q4830453 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {signs} of {typhoid fever}, that has {treatment} is {dopamine} ?",
    "uid": 11867,
    "subgraph": "right-subgraph",
    "template_index": 165,
    "question": "What are the signs of Typhoid fever which can be treated with Dopamine?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q83319 wdt:P780 ?answer . ?answer wdt:P2176 wd:Q170304}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q83319> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P780>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2176> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q170304> . }",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the symptoms of Typhoid fever which can be dealt with with Dopamine?",
    "answers": [
      "bradycardia"
    ]
  },
  {
    "NNQT_question": "What is {nominated for} of {Nellore} that is {point in time} is {1983-01-01} ?",
    "uid": 31266,
    "subgraph": "statement_property",
    "template_index": 4300,
    "question": "What did Nellore get nominated for in 1983-0-0?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q61434 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1983')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "In 1983, what nomination did Nellore receive?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q1101377 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1983')) }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {position of nasal sonant} of {spouse} of {Myrna Loy} ?",
    "uid": 30545,
    "subgraph": "right-subgraph",
    "template_index": 982,
    "question": "In the consort of Myrna Loy, what is the position of nasal sonant?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q105941 wdt:P26 ?X . ?X wdt:P5481 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "WHAT IS THE position of nasal sonant OF MYRNA LOY",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q105941 wdt:P26 ?X . ?X wdt:P241 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {award received} of {Ken Thompson} that is {time of spacecraft orbit decay} is {1983-01-01} ?",
    "uid": 31375,
    "subgraph": "statement_property",
    "template_index": 4924,
    "question": "What award did Ken Thompson receive with January 1st, 1983 as time of spacecraft orbit decay?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1107006 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P621 ?x filter(contains(YEAR(?x),'1983')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "With a time of spacecraft orbit decay of January 1st, 1983, Ken Thompson received what award?",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q1107006 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1983')) }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {direction relative to location} are to/by {Kendari} ?",
    "uid": 31723,
    "subgraph": "statement_property",
    "template_index": 1758,
    "question": "How far Kendari are we?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P654 wd:Q15379 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "How far to the Kendari are we located?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P654 wd:Q679 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {country} for {significant event} of {James the Just}",
    "uid": 30235,
    "subgraph": "simple question left",
    "template_index": 3069,
    "question": "Which country housed the James the Just?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P793 wd:Q26925 . ?sbj wdt:P31 wd:Q6256 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which nation housed the James the Just?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P793 wd:Q12444025 . ?sbj wdt:P31 wd:Q6256 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {sport discipline} that {authority} {World Rugby} and which contains the word {rugby} in their name",
    "uid": 24899,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3308,
    "question": "What what is animated taxondistributed by MGM and {family}",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2312410 . ?sbj wdt:P797 wd:Q369225 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'rugby')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2312410>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P797> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q369225>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'rugby')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What what is energized taxondistributed by MGM and {family}",
    "answers": [
      "rugby union"
    ]
  },
  {
    "NNQT_question": "What is {member of political party} of {Florentino Pérez} that is {start time} is {1982-0-0} ?",
    "uid": 5728,
    "subgraph": "statement_property",
    "template_index": 2173,
    "question": "Florentino Perez is a member of what political party whose start time was 1982-0-0",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q245207 p:P102 ?s . ?s ps:P102 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1982')) }",
    "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q245207> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P102> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1982-0-0>\n} \n",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What party does Florentino Perez's belong to since 1982?",
    "answers": [
      "Democratic Reformist Party"
    ]
  }
]