[
  {
    "NNQT_question": "What is {genre} of {ecology}",
    "uid": 30958,
    "subgraph": "center",
    "template_index": 3430,
    "question": "Which is the genre of ecology?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q7150 wdt:P136 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q7150 wdt:P361 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {archINFORM location ID} are for {St. Peter's Basilica} ?",
    "uid": 31698,
    "subgraph": "statement_property",
    "template_index": 610,
    "question": "How many archINFORM location IDs did the St. Peter's Basilica have?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q12512 wdt:P5573 ?obj }",
    "sparql_dbpedia18": "",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "What is the total number of archINFORM location IDs that were assigned to St Peter's Basilica?",
    "old_sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q12512 wdt:P84 ?obj }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {date of death} of {Arturo Alessandri} that is {earliest date} is {1517-04-01} ?",
    "uid": 31406,
    "subgraph": "statement_property",
    "template_index": 44,
    "question": "When is {date of death} of {Arturo Alessandri} whose {earliest date} is {1517-4-0} ?",
    "sparql_wikidata": "SELECT ?obj WHERE { wd:Q848 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1319 ?x filter(contains(YEAR(?x),'1517')) }",
    "sparql_dbpedia18": "",
    "template": "(E pred F) prop ?value",
    "answer": [],
    "template_id": "statement_property_2",
    "paraphrased_question": "What year did Arturo Alessandri died between 1517-4-0",
    "old_sparql_wikidata": "SELECT ?obj WHERE { wd:Q87620 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1319 ?x filter(contains(YEAR(?x),'1517')) }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {place of marriage} for {Catherine, Duchess of Cambridge} has {sibling} as {Prince William, Duke of Cambridge} ?",
    "uid": 31658,
    "subgraph": "statement_property",
    "template_index": 219,
    "question": "Where did Catharine, Duchess of Cambridge get married with Prince William, Duke of Cambridge as brother?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q10479 p:P3373 ?s . ?s ps:P3373 wd:Q36812 . ?s pq:P2842 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Where did Catharine, Duchess of Cambridge, get married, with Prince William, Duke of Cambridge being her sibling?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q10479 p:P26 ?s . ?s ps:P26 wd:Q36812 . ?s pq:P2842 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {PLU code} of {Arabian horse}",
    "uid": 30979,
    "subgraph": "center",
    "template_index": 116,
    "question": "Which is PLU code for Arabian horse?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q184138 wdt:P4030 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q184138 wdt:P2371 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {animated feature film} for {animator} of {David Spade}",
    "uid": 30338,
    "subgraph": "simple question left",
    "template_index": 1801,
    "question": "Which is the animated feature film where David Spade is an animator?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P6942 wd:Q298658 . ?sbj wdt:P31 wd:Q29168811 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What animated movie did David Spade animate?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P725 wd:Q298658 . ?sbj wdt:P31 wd:Q29168811 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {end time} for {Tom Cruise} has {award received} as {Golden Globe Award for Best Actor – Motion Picture Musical or Comedy} ?",
    "uid": 31663,
    "subgraph": "statement_property",
    "template_index": 2066,
    "question": "Until when did Tom Cruise receive the Golden Globe Award for Best Actor - Motion Picture, Musical or Comedy?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q37079 p:P166 ?s . ?s ps:P166 wd:Q181883 . ?s pq:P582 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "Until when Tom Cruise was presented with the Golden Globe Award in the category of Best Actor-Motion Picture, Musical or Comedy?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q37079 p:P166 ?s . ?s ps:P166 wd:Q181883 . ?s pq:P585 ?value}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {historical country} for {country} of {Sonia Gandhi}",
    "uid": 31781,
    "subgraph": "simple question right",
    "template_index": 1233,
    "question": "In which country the Sonia Gandhi used to live ?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q163225 wdt:P17 ?obj . ?obj wdt:P31 wd:Q3024240 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Where did the Sonia Gandhi live in?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q79965 wdt:P17 ?obj . ?obj wdt:P31 wd:Q3024240 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {Encyclopaedia Metallum artist ID} of {Robert Grabarz}",
    "uid": 30995,
    "subgraph": "center",
    "template_index": 4028,
    "question": "Which is the Encyclopaedia Metallum artist ID for Robert Grabarz?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q1738 wdt:P1989 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q12006 wdt:P1989 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {composed by} of {preceded by} of {All We Know} ?",
    "uid": 14954,
    "subgraph": "left-subgraph",
    "template_index": 22,
    "question": "Who is the composer of All We Know?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2315956 wdt:P155 ?X . ?X wdt:P86 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2315956> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P155>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P86> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Who composed the song 'All We Know'?",
    "answers": [
      "Hayley Williams"
    ]
  },
  {
    "NNQT_question": "What is {officeholder} of {professorship} of {Robert Weston} ?",
    "uid": 30687,
    "subgraph": "left-subgraph",
    "template_index": 26,
    "question": "Where is incumbent of professorship position of Robert Weston ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7350984 wdt:P803 ?X . ?X wdt:P1308 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "The professorship position of Robert Weston is located where?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q6223791 wdt:P803 ?X . ?X wdt:P1308 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {point in time} for {Vittorio De Sica} has {nominated for} as {Academy Award for Best Supporting Actor} ?",
    "uid": 4635,
    "subgraph": "statement_property",
    "template_index": 1080,
    "question": "When was Vittorio De Sica nominated for an Academy Award for Best Supporting Actor?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q53004 p:P1411 ?s . ?s ps:P1411 wd:Q106291 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q53004> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q106291> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When was Vittoria De Sica nominated for Best Supporting Actor?",
    "answers": [
      "1957-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is {place of birth} of {Albert of Riga}, that has {shares border with} is {Mārupe Municipality} ?",
    "uid": 30447,
    "subgraph": "right-subgraph",
    "template_index": 3476,
    "question": "Where is the location born of Albert of Riga, which is adjacent to the Mārupe Municipality?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q60952 wdt:P19 ?answer . ?answer wdt:P47 wd:Q2232018}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F . ?F RFG G",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Where is the location born of Albert of Riga, which is adjacent to the Mārupe Municipality?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q381759 wdt:P19 ?answer . ?answer wdt:P47 wd:Q2232018}",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {street newspaper} that starts with {'é'}",
    "uid": 31190,
    "subgraph": "string matching simple contains word",
    "template_index": 1302,
    "question": "What are the street newspaper  which start with the letter e",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2006125 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'é')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name the street newspapers whose first alphabet is e.",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2305295 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'é')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {activity} that {fabrication method} {GUT} and which contains the word {management} in their name",
    "uid": 31931,
    "subgraph": "string matching type + relation contains word",
    "template_index": 1717,
    "question": "Tell me the activity which has GUT as fabrication method and contains the word management in it's name?",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1914636 . ?sbj wdt:P2079 wd:Q10287814 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'management')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Tell me the action which has GUT as creation strategy and contains the word administration in it's name?",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1914636 . ?sbj wdt:P2079 wd:Q623971 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'management')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {official name} are for {Almaty} ?",
    "uid": 1556,
    "subgraph": "statement_property",
    "template_index": 556,
    "question": "How many names are there for Almaty?",
    "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q35493 wdt:P1448 ?obj }",
    "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q35493> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1448> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
    "template": "Count Obj (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_1",
    "paraphrased_question": "How many different names does Almaty have?",
    "answers": [
      "1"
    ]
  },
  {
    "NNQT_question": "What is the {anime film} for {voice actor} of {Ellen DeGeneres}",
    "uid": 30275,
    "subgraph": "simple question left",
    "template_index": 2403,
    "question": "Ellen DeGeneres is the voice actor of what anime film?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P725 wd:Q483325 . ?sbj wdt:P31 wd:Q20650540 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me about anime film for voice actor of Ellen DeGeneres",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P725 wd:Q483325 . ?sbj wdt:P31 wd:Q29168811 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {inception} of {place of birth} of {Alan Bond} ?",
    "uid": 30755,
    "subgraph": "right-subgraph",
    "template_index": 3284,
    "question": "Where was Alan Bond created?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q550179 wdt:P19 ?X . ?X wdt:P571 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Where was Alan Bond created?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q550179 wdt:P27 ?X . ?X wdt:P571 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {survival skill} that {follows} {food presentation} and which contains the word {cooking} in their name",
    "uid": 31940,
    "subgraph": "string matching type + relation contains word",
    "template_index": 2178,
    "question": "Tell me the survival skill that follows food presentation and which contains the word cooking in their name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q891382 . ?sbj wdt:P155 wd:Q3480053 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cooking')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Tell me the survival ability that accompanies meals presentation and which carries the word cooking in their identify",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q891382 . ?sbj wdt:P156 wd:Q3480053 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'cooking')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {pronunciation audio} of {constructed out of} of {meat pie} ?",
    "uid": 17572,
    "subgraph": "right-subgraph",
    "template_index": 39,
    "question": "How would you spell meat pie using the international phonetic alphabet?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q5367573 wdt:P186 ?X . ?X wdt:P443 ?answer}",
    "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q5367573> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P186>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P443> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "In what manner would you spell meat pie utilizing international phonetic alphabet?",
    "answers": [
      "Ar-%D9%84%D8%AD%D9%85.ogg",
      "Be-%D0%BC%D1%8F%D1%81%D0%B0.ogg",
      "Cs-maso.ogg",
      "Da-k%C3%B8d.ogg",
      "De-Fleisch.ogg",
      "En-uk-meat.ogg",
      "En-us-meat.ogg",
      "Fr-viande.ogg",
      "Hr-meso.oga",
      "It-la%20carne.ogg",
      "LL-Q188%20%28deu%29-Sebastian%20Wallroth-Fleisch.wav",
      "Lv-riga-ga%C4%BCa.ogg",
      "Mg-hena.ogg",
      "Nl-vlees.ogg",
      "Ru-%D0%BC%D1%8F%D1%81%D0%BE.ogg",
      "Sv-k%C3%B6tt.ogg",
      "Uk-%D0%BC%27%D1%8F%D1%81%D0%BE.ogg",
      "Wo-yapp.ogg"
    ]
  },
  {
    "NNQT_question": "What is the {point in time} for {Barry Humphries} has {award received} as {Cornelius Jansen} ?",
    "uid": 31498,
    "subgraph": "statement_property",
    "template_index": 1726,
    "question": "When did Barry Humphries receive the Cornelius Jansen award?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q734221 p:P166 ?s . ?s ps:P166 wd:Q318943 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "When was the Cornelius Jansen awarded to Barry Humphries?",
    "old_sparql_wikidata": "SELECT ?value WHERE { wd:Q734221 p:P166 ?s . ?s ps:P166 wd:Q2393205 . ?s pq:P585 ?value}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {television series} with the {MAX(publication interval)} whose {presenter} is {Christine Prayon} ?",
    "uid": 31135,
    "subgraph": "rank",
    "template_index": 128,
    "question": "Which populat TV series have Christine Prayon as presenter",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q5398426 . ?ent wdt:P2896 ?obj . ?ent wdt:P371 wd:Q1083743 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Christine Prayon is presenter of what popular TV Series?",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q5398426 . ?ent wdt:P2896 ?obj . ?ent wdt:P161 wd:Q1083743 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {business division} of {logo image} of {Laserdisc} ?",
    "uid": 30652,
    "subgraph": "right-subgraph",
    "template_index": 63,
    "question": "What is the business division of which is logo image of Laserdisc ?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q273309 wdt:P154 ?X . ?X wdt:P199 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF xF . xF RFG ?G",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "what business division is logo image Laserdisc?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q273309 wdt:P127 ?X . ?X wdt:P199 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {coachwork type} that contains the word {van} in their name",
    "uid": 23618,
    "subgraph": "string matching simple contains word",
    "template_index": 1974,
    "question": "What are the coachwork type which start with the letter van",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15729598 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'van')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q15729598>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'van')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What are the coachwork sort which begin with the letter van",
    "answers": [
      "van",
      "minivan"
    ]
  },
  {
    "NNQT_question": "How many {military rank} are to/by {Lyndon B. Johnson} ?",
    "uid": 31725,
    "subgraph": "statement_property",
    "template_index": 1378,
    "question": "How many Lyndon B. Johnson military ranks are there?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P410 wd:Q9640 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "What number of Lyndon B. Johnson military ranks exist?",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P410 wd:Q131767 }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is {depicts} of {site of astronomical discovery} of {Woman Drinking Wine} ?",
    "uid": 30544,
    "subgraph": "left-subgraph",
    "template_index": 287,
    "question": "What portrait has the Woman Drinking Wine, that is a site of astronomical discovery?",
    "sparql_wikidata": "SELECT ?answer WHERE { wd:Q32995247 wdt:P65 ?X . ?X wdt:P180 ?answer}",
    "sparql_dbpedia18": "",
    "template": "C RCD xD . xD RDE ?E",
    "answer": [],
    "template_id": 5,
    "paraphrased_question": "Which picture presents the site of astronomical discovery woman drinking wine?",
    "old_sparql_wikidata": "SELECT ?answer WHERE { wd:Q32995247 wdt:P1639 ?X . ?X wdt:P180 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "what is the {point in time} for {William Ramsay} has {nominated for} as {Nobel Prize in Chemistry} ?",
    "uid": 4583,
    "subgraph": "statement_property",
    "template_index": 1028,
    "question": "When was William Ramsay nominated for a Nobel Prize in Chemistry?",
    "sparql_wikidata": "SELECT ?value WHERE { wd:Q950726 p:P1411 ?s . ?s ps:P1411 wd:Q44585 . ?s pq:P585 ?value}",
    "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q950726> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q44585> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
    "template": "(E pred ?Obj ) prop value",
    "answer": [],
    "template_id": "statement_property_1",
    "paraphrased_question": "During which year was William Ramsay nomited for the Nobel Prize in Chemistry?",
    "answers": [
      "1903-01-01T00:00:00Z",
      "1902-01-01T00:00:00Z",
      "1904-01-01T00:00:00Z"
    ]
  },
  {
    "NNQT_question": "What is the {time zone named for a UTC offset} with the {MAX(UTC timezone offset)} whose {replaces} is {Macau Standard Time} ?",
    "uid": 31136,
    "subgraph": "rank",
    "template_index": 336,
    "question": "What time zone replaces Macau one?",
    "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q17272482 . ?ent wdt:P2907 ?obj . ?ent wdt:P1365 wd:Q996734 } ORDER BY DESC(?obj)LIMIT 5 ",
    "sparql_dbpedia18": "",
    "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
    "answer": [],
    "template_id": "Rank2",
    "paraphrased_question": "Name the time zone that replaces Macau one.",
    "old_sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q17272482 . ?ent wdt:P2907 ?obj . ?ent wdt:P460 wd:Q996734 } ORDER BY DESC(?obj)LIMIT 5 ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {document} that {editor} {National Constituent Assembly} and which contains the word {citizen} in their name",
    "uid": 25287,
    "subgraph": "string matching type + relation contains word",
    "template_index": 3511,
    "question": "What is the document published by the National Constituent Assembly that contains the word \"citizen\" in its name",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q49848 . ?sbj wdt:P98 wd:Q876424 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'citizen')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q49848>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P98> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q876424>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'citizen')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
    "template": " <?S P O ; ?S instanceOf Type ; contains word >",
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "What is the record distributed by the National Constituent Get together that contains the word \"citizen\" in its name",
    "answers": [
      "Declaration of the Rights of Man and of the Citizen"
    ]
  },
  {
    "NNQT_question": "What is {Colour Index International constitution ID} of {abscisic acid}",
    "uid": 30950,
    "subgraph": "center",
    "template_index": 3676,
    "question": "Which is the Colour Index International constitution ID for abscisic acid?",
    "sparql_wikidata": "select distinct ?answer where { wd:Q332211 wdt:P2027 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q332211 wdt:P2063 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {Avadi} for {coat of arms} of {Amsterdam}",
    "uid": 31790,
    "subgraph": "simple question right",
    "template_index": 1128,
    "question": "What is the name of the Avadi of Amsterdam?",
    "sparql_wikidata": " select distinct ?obj where { wd:Q727 wdt:P237 ?obj . ?obj wdt:P31 wd:Q584494 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the title of the Avadi coat of arms of Amsterdam?",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q727 wdt:P237 ?obj . ?obj wdt:P31 wd:Q28147344 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "What is the {news conference} for {street key} of {Donald Trump}",
    "uid": 30252,
    "subgraph": "simple question left",
    "template_index": 3001,
    "question": "Which news conference is the street key of Donald Trump?",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1945 wd:Q22686 . ?sbj wdt:P31 wd:Q272281 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Which news conference is Donald Trump's street key?",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P710 wd:Q22686 . ?sbj wdt:P31 wd:Q272281 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "Give me {carries} {fictional detective} that starts with {'s'}",
    "uid": 31164,
    "subgraph": "string matching simple contains word",
    "template_index": 214,
    "question": "What are the objects carrying fictional detective which start with the letter s",
    "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P2505 wd:Q3656924 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "sparql_dbpedia18": "",
    "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "What are objects carrying the anecdotal criminologist which begin with the letter s",
    "old_sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3656924 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false,
    "answers": []
  },
  {
    "NNQT_question": "How many {torch lit by} are to/by {Prince Philip, Duke of Edinburgh} ?",
    "uid": 31771,
    "subgraph": "statement_property",
    "template_index": 1011,
    "question": "How many were torches lit by Prince Philip, Duke of Edinburgh?",
    "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P545 wd:Q80976 }",
    "sparql_dbpedia18": "",
    "template": "Count ent (ent-pred-obj)",
    "answer": [],
    "template_id": "Count_2",
    "paraphrased_question": "Give me the number of torches lit by Prince Philip.",
    "old_sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P542 wd:Q80976 }",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false,
    "answers": []
  }
]