[
  {
    "NNQT_question": "What is the {fictional universe} for {fictional universe described in} of {Manado}",
    "uid": 30228,
    "subgraph": "simple question left",
    "template_index": 1643,
    "question": "Mention the fictional universe described in Manado.",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1445 wd:Q15847 . ?sbj wdt:P31 wd:Q559618 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Say the anecdotal universe depicted within Manado.",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1445 wd:Q83495 . ?sbj wdt:P31 wd:Q559618 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false
  },
  {
    "NNQT_question": "What is the {book} for {language of work or name} of {Gregor Strasser}",
    "uid": 30231,
    "subgraph": "simple question left",
    "template_index": 771,
    "question": "Name a book written in Gregor Strasser",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P407 wd:Q76638 . ?sbj wdt:P31 wd:Q571 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name a book written in Gregor Strasser",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P407 wd:Q143 . ?sbj wdt:P31 wd:Q571 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false
  },
  {
    "NNQT_question": "What is the {city or town} for {enclave within} of {Arminius}",
    "uid": 30238,
    "subgraph": "simple question left",
    "template_index": 3672,
    "question": "Tell me the city which is enclaved within Arminius.",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P501 wd:Q68880 . ?sbj wdt:P31 wd:Q27676416 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Let me know the city which is enclaved inside Arminius.",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P501 wd:Q340 . ?sbj wdt:P31 wd:Q27676416 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false
  },
  {
    "NNQT_question": "What is the {military pentathlon} for {headquarters location} of {Lyon}",
    "uid": 30241,
    "subgraph": "simple question left",
    "template_index": 3499,
    "question": "Name a military pentathlon whose heaquarters are located in Lyon",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P159 wd:Q456 . ?sbj wdt:P31 wd:Q1466233 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Name a military pentathlon with headquarters in Lyon",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P159 wd:Q456 . ?sbj wdt:P31 wd:Q4830453 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false
  },
  {
    "NNQT_question": "What is the {human} for {vehicles per thousand people} of {Oracle Corporation}",
    "uid": 30254,
    "subgraph": "simple question left",
    "template_index": 1512,
    "question": "Name a vehicle per thousand people of the Oracle Corporation",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P5167 wd:Q19900 . ?sbj wdt:P31 wd:Q5 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Title a vehicle per thousand people of the Prophet Enterprise",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P463 wd:Q19900 . ?sbj wdt:P31 wd:Q5 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false
  },
  {
    "NNQT_question": "What is the {musical composition} for {prize money} of {Dionysus}",
    "uid": 30255,
    "subgraph": "simple question left",
    "template_index": 3894,
    "question": "Name a musical composition which prize money is Dionysus",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2121 wd:Q41680 . ?sbj wdt:P31 wd:Q207628 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Title a melodic composition which prize money is Dionysus",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P674 wd:Q41680 . ?sbj wdt:P31 wd:Q207628 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false
  },
  {
    "NNQT_question": "What is the {biblical episode} for {author of foreword} of {Jesus}",
    "uid": 30292,
    "subgraph": "simple question left",
    "template_index": 3201,
    "question": "Tell me about the author of foreword of Jesus Christ.",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P2679 wd:Q302 . ?sbj wdt:P31 wd:Q22704077 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Let me know around the author of foreword of Jesus Christ.",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P3342 wd:Q302 . ?sbj wdt:P31 wd:Q22704077 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false
  },
  {
    "NNQT_question": "What is the {church building} for {Dove.org work ID} of {Paul}",
    "uid": 30293,
    "subgraph": "simple question left",
    "template_index": 1383,
    "question": "Name the church monument where Paul was the Dove.org work ID",
    "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P7236 wd:Q9200 . ?sbj wdt:P31 wd:Q16970 } ",
    "sparql_dbpedia18": "",
    "template": "<?S P O ; ?S InstanceOf Type>",
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Title the church landmark where Paul was the Dove.org work ID",
    "old_sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P417 wd:Q9200 . ?sbj wdt:P31 wd:Q16970 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false
  },
  {
    "NNQT_question": "What is {International Olympic Committee athlete ID} of {Irenaeus}",
    "uid": 30821,
    "subgraph": "center",
    "template_index": 1097,
    "question": "What's Irenaeus's International Olympic Committee athlete ID.",
    "sparql_wikidata": "select distinct ?answer where { wd:Q182123 wdt:P3171 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q235975 wdt:P3171 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false
  },
  {
    "NNQT_question": "What is {Austrian municipality key} of {Port Moresby}",
    "uid": 30829,
    "subgraph": "center",
    "template_index": 493,
    "question": "WHICH IS THE AUSTRIAN MUNICIPALITY KEY OF  PORT MORESBY",
    "sparql_wikidata": "select distinct ?answer where { wd:Q36526 wdt:P964 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q41753 wdt:P964 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false
  },
  {
    "NNQT_question": "What is {nickname} of {Saltillo}",
    "uid": 30848,
    "subgraph": "center",
    "template_index": 3232,
    "question": "Saltillo name",
    "sparql_wikidata": "select distinct ?answer where { wd:Q53077 wdt:P1449 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q434909 wdt:P1449 ?answer}",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false
  },
  {
    "NNQT_question": "What is {candidate} of {University of Tehran}",
    "uid": 30867,
    "subgraph": "center",
    "template_index": 753,
    "question": "what is the candidate of  Univirsity of Tahran",
    "sparql_wikidata": "select distinct ?answer where { wd:Q737835 wdt:P726 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q737835 wdt:P4171 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false
  },
  {
    "NNQT_question": "What is {child} of {Alistair Brownlee}",
    "uid": 31034,
    "subgraph": "center",
    "template_index": 304,
    "question": "Please tell me Alistair Brownlee's child.",
    "sparql_wikidata": "select distinct ?answer where { wd:Q716308 wdt:P40 ?answer}",
    "sparql_dbpedia18": "",
    "template": "E REF ?F",
    "answer": [],
    "template_id": "1.1",
    "paraphrased_question": [],
    "old_sparql_wikidata": "select distinct ?answer where { wd:Q716308 wdt:P2778 ?answer}",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false
  },
  {
    "NNQT_question": "What is the {hurdler} for {contributed to creative work} of {Sasha Grey}",
    "uid": 31787,
    "subgraph": "simple question right",
    "template_index": 1226,
    "question": "Mention the hurdler related work highlighting the work of Sasha Grey.",
    "sparql_wikidata": " select distinct ?obj where { wd:Q2709 wdt:P3919 ?obj . ?obj wdt:P31 wd:Q13724897 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Say the hurdler related work highlighting the work of Sasha Grey.",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q2709 wdt:P3919 ?obj . ?obj wdt:P31 wd:Q9212979 } ",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false
  },
  {
    "NNQT_question": "What is the {monastery} for {hair color} of {Russian Orthodox Church}",
    "uid": 31798,
    "subgraph": "simple question right",
    "template_index": 1367,
    "question": "Mention the hair color monastery of the Russian Orthodox Church monastery.",
    "sparql_wikidata": " select distinct ?obj where { wd:Q60995 wdt:P1884 ?obj . ?obj wdt:P31 wd:Q44613 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Say the hair color monastery of the Russian Standard Church monastery.",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q60995 wdt:P159 ?obj . ?obj wdt:P31 wd:Q44613 } ",
    "operation_type": "relation",
    "operation_difficulty": 1,
    "has_answer": false
  },
  {
    "NNQT_question": "What is the {for-profit charity} for {business division} of {Ford Motor Company}",
    "uid": 31828,
    "subgraph": "simple question right",
    "template_index": 916,
    "question": "Name a for-profit charity business division owned by Ford Motor Company",
    "sparql_wikidata": " select distinct ?obj where { wd:Q44294 wdt:P199 ?obj . ?obj wdt:P31 wd:Q5466627 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Title a for-profit charity trade division claimed by Portage Engine Company",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q44294 wdt:P199 ?obj . ?obj wdt:P31 wd:Q6881511 } ",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false
  },
  {
    "NNQT_question": "What is the {taxon} for {taxon rank} of {Durio}",
    "uid": 31848,
    "subgraph": "simple question right",
    "template_index": 1789,
    "question": "What taxon is the taxon rank of Durio",
    "sparql_wikidata": " select distinct ?obj where { wd:Q2309085 wdt:P105 ?obj . ?obj wdt:P31 wd:Q16521 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the taxon rank of Durio",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q2309085 wdt:P427 ?obj . ?obj wdt:P31 wd:Q16521 } ",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false
  },
  {
    "NNQT_question": "What is the {human biblical figure} for {child} of {Jesus}",
    "uid": 31885,
    "subgraph": "simple question right",
    "template_index": 266,
    "question": "Who is the child of Jesus Christ",
    "sparql_wikidata": " select distinct ?obj where { wd:Q302 wdt:P40 ?obj . ?obj wdt:P31 wd:Q20643955 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Who is the child of Jesus Christ",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q302 wdt:P25 ?obj . ?obj wdt:P31 wd:Q20643955 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false
  },
  {
    "NNQT_question": "What is the {imprint} for {employer} of {50 Cent}",
    "uid": 31886,
    "subgraph": "simple question right",
    "template_index": 678,
    "question": "What is the employer that 50 Cent belongs to called",
    "sparql_wikidata": " select distinct ?obj where { wd:Q6060 wdt:P108 ?obj . ?obj wdt:P31 wd:Q2608849 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "What is the employer that 50 Cent has a place to called",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q6060 wdt:P264 ?obj . ?obj wdt:P31 wd:Q2608849 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false
  },
  {
    "NNQT_question": "What is the {country} for {replaced by} of {Soviet Union}",
    "uid": 31893,
    "subgraph": "simple question right",
    "template_index": 938,
    "question": "Name the country replaced by the Soviet Union",
    "sparql_wikidata": " select distinct ?obj where { wd:Q15180 wdt:P1366 ?obj . ?obj wdt:P31 wd:Q6256 } ",
    "sparql_dbpedia18": "",
    "template": " <S P ?O ; ?O instanceOf Type>",
    "answer": [],
    "template_id": 1,
    "paraphrased_question": "Title the nation prior to the Soviet Union",
    "old_sparql_wikidata": " select distinct ?obj where { wd:Q15180 wdt:P530 ?obj . ?obj wdt:P31 wd:Q6256 } ",
    "operation_type": "relation",
    "operation_difficulty": 3,
    "has_answer": false
  },
  {
    "NNQT_question": "What is {notable work} of {Lucius Quinctius Cincinnatus} and {publisher}",
    "uid": 31993,
    "subgraph": [],
    "template_index": 580,
    "question": "Tell me the most notable work of Lucius Quinctius Cincinnatus and also the publisher.",
    "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q309637 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P123 ?value1 . }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 3,
    "paraphrased_question": "Tell me the most high-quality work of Lucius Quinctius Cincinnatus and additionally the publisher.",
    "old_sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q49081 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P123 ?value1 . }",
    "operation_type": "entity",
    "operation_difficulty": 1,
    "has_answer": false
  },
  {
    "NNQT_question": "What is {number of points/goals/set scored} and {number of matches played/races/starts} of {Pedro Aguirre Cerda} has {member of sports team} as {England national association football team}",
    "uid": 32064,
    "subgraph": [],
    "template_index": 138,
    "question": "Tell me the number of points and games played by Pedro Aguirre Cerda, member of the English national football team.",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q845 p:P54 ?s . ?s ps:P54 wd:Q47762 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Tell me how many points and games Pedro Aguirre Cerda, an English national football team member, has played.",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q207658 p:P54 ?s . ?s ps:P54 wd:Q47762 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 2,
    "has_answer": false
  },
  {
    "NNQT_question": "What is {heat deflection temperature} and {follows} of {Lothair I} has {noble title} as {monarch of Italy}",
    "uid": 32077,
    "subgraph": [],
    "template_index": 1225,
    "question": "Who got the noble title of monarch of Italy before Lothair I and what was his heat deflection temperature.",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q150735 p:P97 ?s . ?s ps:P97 wd:Q271148 . ?s pq:P5682 ?value1 . ?s pq:P155 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "Who got the respectable title of ruler of Italy some time recently Lothair I and what was his heat deflection temperature.",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q150735 p:P97 ?s . ?s ps:P97 wd:Q271148 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }",
    "operation_type": "relation",
    "operation_difficulty": 2,
    "has_answer": false
  },
  {
    "NNQT_question": "What is {appointed by} and {end cause} of {Vladimir Lenin} has {position held} as {senatore a vita}",
    "uid": 32086,
    "subgraph": [],
    "template_index": 590,
    "question": "Name the appointment cause and the halt reason for Vladimir Lenin while serving as a senatore a vita",
    "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q1394 p:P39 ?s . ?s ps:P39 wd:Q826589 . ?s pq:P748 ?value1 . ?s pq:P1534 ?value2 }",
    "sparql_dbpedia18": "",
    "template": [],
    "answer": [],
    "template_id": 2,
    "paraphrased_question": "what was the appointment cause for Vladimir Lenin while serving as a senatore a vita and what was the halt reason",
    "old_sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q83174 p:P39 ?s . ?s ps:P39 wd:Q826589 . ?s pq:P748 ?value1 . ?s pq:P1534 ?value2 }",
    "operation_type": "entity",
    "operation_difficulty": 3,
    "has_answer": false
  }
]